honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
	<registers>
	<register>
	<name>CHARGER_CC_CHARGE_TIMER_REG</name>
	<description>Maximum CC-charge time limit register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00001c20</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CC_CHARGE_TIMER</name>
	<description>Returns the current value of the CC-Charge timeout counter, running at a 1Hz clock. The range of the specific timer is identical to the one of the Pre-Charge and the CV-Charge timers, so it may count up to 6 hours, ranging from 0 to MAX_CC_CHARGE_TIME. It is reset to 0 when the Charger's FSM is either in DISABLED or in END_OF_CHARGE state.</description>
	<bitRange>[30:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MAX_CC_CHARGE_TIME</name>
	<description>This bit-field determines the maximum time (measured in ticks of the Charger's 1Hz clock) allowed for the CC (Constant Current) charging stage. If this is exceeded, a CC charge time-out error will be captured by the Charger's control unit and its FSM will move to the ERROR state. In order to exit this state and re-start charging, the CHARGER_RESUME bit-field of CHARGER_CTRL_REG must be set.
Note: The specific bit-field should be always set to a non-zero value.</description>
	<bitRange>[14:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_CTRL_REG</name>
	<description>Charger main control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x003f6a78</resetValue>
	<resetMask>0x1fffffff</resetMask>
	<fields><field>
	<name>EOC_TRIGGER</name>
	<description>0 = Edge-sensitive End-of-Charge detection support is enabled (default). The Charger's digital block expects a positive edge of the End-of-Charge signal coming from the Charger's analog circuit to let the respective debounce counters start and enable the FSM switch to the END_OF_CHARGE state, if the signal is stable.
1 = Level-sensitive End-of-Charge detection is enabled. In this mode, the Charger's digital block only monitors the level of the End-of-Charge signal coming from the analog circuit and if this is seen high in either CC_CHARGE or CV_CHARGE state, the EOC debounce counters start.</description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EOC_INTERVAL_CHECK_TIMER</name>
	<description>The specific bit-field determines the current state of the timer used to periodically check the End-of-Charge signal, as soon as the Charger's FSM is either in CC_CHARGE or CV_CHARGE state. Thus, as soon as the Charger's FSM enters the CC_CHARGE state:
  - The timer starts increasing when a positive edge detection on End-of-Charge signal occurs.
  - It keeps increasing until reaching the programmed EOC_INTERVAL_CHECK_THRES value, if and only if there is no detection of a negative edge on End-of-Charge signal. If this happens, the timer resets and starts over with a new End-of-Charge positive edge.
  - The timer also resets after having reached its programmed threshold or when the Charger's FSM next state is END_OF_CHARGE. This happens only after having found End-of-Charge signal asserted for 4 consecutive checks and provided that the specific signal has not de-asserted during the timer's interval.
Note: It must be noted that out of these two states, the specific timer is kept to zero. It is also noted that this timer runs at the 1Mhz clock of the Charger's block and its value always ranges from 0 to the EOC_INTERVAL_CHECK_THRES value set in the respective bit-field of CHARGER_CTRL_REG.</description>
	<bitRange>[27:22]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>EOC_INTERVAL_CHECK_THRES</name>
	<description>This bit-field determines the periodic interval of checking the End-of-Charge signal, when the Charger's FSM is either in CC_CHARGE or in CV_CHARGE state. To implement this, a dedicated timer has been used, counting from zero up to the value programmed into this bit-field (see also EOC_INTERVAL_CHECK_TIMER field's description).
As soon as this timer reaches the programmed value, the End-of-Charge signal is sampled and depending on its status (high or low), another counter, keeping the number of consecutive End-of-Charge events, is increased or not. See also the description of the EOC_DEBOUNCE_CNT bit-field of CHARGER_STATUS_REG, for this counter.
Note: The specific bit-field should always be programmed to a non-zero value.</description>
	<bitRange>[21:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>REPLENISH_MODE</name>
	<description>When this bit-field is set and the Charger's FSM is in the BYPASSED state (thus, in Bypass mode), the internal multiplexer inside the digital part of the charger selects the Replenish, instead of the Pre-charge setting to be driven to the main Vbat comparator of the Charger's analogue circuitry. By this way, SW can read the respective analogue comparator's output in CHARGER_STATUS_REG (bit-field MAIN_VBAT_COMP_OUT), after the battery's volrtage has reached the End-of-Charge level, and determine if the battery voltage has dropped below the Replenish level, re-starting the battery charging accordingly.
Note: When the Charger's FSM is active and operational, this bit-field is don't care and the FSM determines which level (Pre-charge or Replenish) will be selected and driven to the analogue, depending on the current state. It is also noted that the supported Pre-charge and Replenish levels can be viewed in the respective bit-fields defined in CHARGER_VOLTAGE_PARAM_REG register.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PRE_CHARGE_MODE</name>
	<description>When set, this bit-field enables a signal of the same name with the bit-field, driven from the Charger's digital part towards the analogue circuitry, in order to determine the current in Pre-Charge mode. If the Charger's FSM is active and operational, the specific bit-field is don't care. Hence, it is considered only when the Charger's FSM has reached the BYPASSED state (thus, in Bypass mode).
With the Charger's FSM being bypassed, SW should take over control and set the specific bit-field, in order to deliver the Pre-Charge instead of the normal Charge current to the Charger's analogue circuitry, during the Pre-Charge phase.
Note: See also the description of CHARGER_CURRENT_PARAM_REG register for the Pre-Charge and normal Charge current levels supported.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CHARGE_LOOP_HOLD</name>
	<description>When set, this bit-field disables charging, provided that the Charger's FSM has switched to the BYPASSED state. This is possible only by setting the CHARGER_BYPASS bit-field of this register.
Thus, as soon as the Charger's FSM is bypassed, the respective signal driven by the FSM is overruled by this bit-field, making the analogue part of the Charger controllable also in this mode. If the Charger's FSM is not bypassed, this bit-field is don't care.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>JEITA_SUPPORT_DISABLED</name>
	<description>0 = Charger's JEITA FSM monitoring the battery temperature checks also if battery temperature is in the Warm or Cool zones.
In that case, it updates accordingly all the Charger's voltage levels (Charge, Pre-Charge, Replenish and OVP) programmed in CHARGER_VOLTAGE_PARAM_REG, as well as the charge and pre-charge current settings of CHARGER_CURRENT_PARAM_REG, depending on the temperature zone determined by the analogue circuitry of the Charger (see also the JEITA registers of the Charger's register file for the Voltage/Current levels in Warm and Cool temperature zones).
1 = Charger's JEITA FSM monitoring the battery temperature checks only if battery temperature is either in the Hot or Cold zones. In that case, it notifies the main Charger FSM to stop charging automatically, when in Hot zone. The same will happen also for the case of Cold, unless the NTC_LOW_DISABLE bit-field of CHARGER_CTRL_REG is set.
Note : It is not recommended to have the specific bit-field kept to '0' (and thus the JEITA support enabled), if at the same time the bit-field TBAT_PROT_ENABLE of the same register is also '0'. Thus, JEITA support should be coupled with the Battery's temperature protection.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TBAT_MONITOR_MODE</name>
	<description>Battery temperature pack monitoring modes, according to the following encoding:
00 = Battery temperature state checked and updated once, as soon as the charger is powered-up and settled.
01 = Battery temperature state checked periodically, depeding on TBAT_MON_TIMER_REG.TBAT_MON_INTERVAL and provided that Charger has been powered-up and charger's FSM is enabled.
10 = Battery temperature state checked periodically depending on TBAT_MON_TIMER_REG.TBAT_MON_INTERVAL, provided that Charger is powered-up and regardless if the Charger's FSM is enabled or not. Hence, this mode can be effective regardless of the state of CHARGE_START bit-field of CHARGER_CTRL_REG.
11 = When selected, it freezes the Battery temperature monitor FSM, as soon as the latter reaches the CHECK_IDLE state (see also CHARGER_STATUS_REG.CHARGER_JEITA_STATE bit-field's description for the states of this FSM). In this mode, the monitoring of Battery temperature is possible only by checking the status of TBAT_HOT_COMP_OUT and MAIN_TBAT_COMP_OUT bit-fields of CHARGER_STATUS_REG, thus by letting SW take over monitoring. This setting may be used in conjunction with Bypass mode (by setting CHARGER_BYPASS of CHARGER_CTRL_REG), so that both charging and battery temperature status monitoring are controlled by SW.</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CHARGE_TIMERS_HALT_ENABLE</name>
	<description>0 = Charge timeout timers continue running when charging is disabled because of a Die or of a Battery temperature error, if and only if STOP_CHARGE_TIMERS bit-field is '0' (default). If it is '1', the counters are stopped also in TDIE_PROT and TBAT_PROT states.
1 = Charge timeout timers are halted in case of a Die or of a Battery temperature error.
In that case, the global charge timer is stopped as soon as the Charger's FSM moves to TDIE_PROT or TBAT_PROT state. Also, either the Pre-Charge, the CC_CHARGE or the CV_CHARGE timer is also stopped, depending on the charging state of the FSM when the Die/Battery temperature error has been detected. </description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>STOP_CHARGE_TIMERS</name>
	<description>0 = Charger's Pre-Charge, CC, CV and Total charge timeout timers are ticking properly, running at the 1Hz clock.
1 = All four Charger's timeout timers are halted, counting is disabled. The counters will be reset when the FSM is either in DISABLED or in END_OF_CHARGE state.
Note: Value '0' is the recommended, '1' is a test mode, since it will globally halt the four timers and thus will block the generation of the respective timer expiration IRQs.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>NTC_LOW_DISABLE</name>
	<description>0 = Charging is disabled when the battery temperature is found to have reached the &quot;COLD&quot; region. Therefore, the Charger's FSM moves directly to &quot;TBAT_PROT&quot; error and generates an IRQ to notify the system accordingly, in case the respective IRQ mask bit of CHARGER_ERROR_IRQ_MASK_REG is set. Also, CHARGER_ERROR_IRQ_STATUS_REG. TBAT_ERROR_IRQ field is updated accordingly.
1 = Charging is allowed to continue, even when the battery temperature pack reaches the &quot;COLD&quot; region. Consequently, the FSM continues charging and no battery temperature error event is generated.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TBAT_PROT_ENABLE</name>
	<description>0 = Battery temperature protection disabled
1 = Battery temperature protection enabled.
Charging will be stopped in case Battery temperature reaches &quot;Hot&quot; zone. It will also be disabled when reaching &quot;Cold&quot; zone, provided that CHARGER_CTRL_REG.NTC_LOW_DISABLE is not set. This is handled by the Charger's FSM, which moves directly to the respective error state (TBAT_PROT), also generating an Error IRQ if the respective IRQ mask bit is set (see also CHARGER_ERROR_IRQ_MASK_REG).</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TDIE_ERROR_RESUME</name>
	<description>0 = FSM will not resume from a Die temperature error. Consequently, its state will be staying to &quot;TDIE_PROT&quot;, for as long as this bit-field is kept low, regardless of the status of the die tempeture comparator. Also, disabling the specific bit-field will reset the Die temperature error debounce counter, when the Charger's FSM is in TDIE_PROT state (so when a Die temperature error has been already detected) and the specific counter will remain frozen to 0 until the TDIE_ERROR_RESUME bit-field is set (see also the TDIE_ERROR_DEBOUNCE_CNT bit-field of CHARGER_STATUS_REG).
1 = FSM will resume from a Die temperature error, as soon as the respective analogue compator confirms that die temperature is again below the maximum allowed level.
It is noted that the maximum Die temperature level is programmable via the CHARGER_TEMPSET_PARAM_REG register's respective bit-field (T_DIE_MAX).</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TDIE_PROT_ENABLE</name>
	<description>0 = Die temperature protection is disabled, thus charging will not be disabled by the Charger's FSM in case of a Die temperature error.
1 = Die temperature protection is enabled, thus the Charger's FSM will move to &quot;TDIE_PROT&quot; state, disabling charging at the same time.
It is noted that the Die temperature error event will be logged in the respective status bit of CHARGER_IRQ_ERROR_STATUS_REG and an IRQ will be generated, if and only if the corresponding mask bit of CHARGER_IRQ_MASK_REG is set. </description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CHARGER_RESUME</name>
	<description>0 = Charger's FSM is not enable to resume from a charge timeout error or a Vbat OVP (Over-Voltage Protection) error. Consequently, FSM stays in &quot;ERROR&quot; state.
1 = Charger's FSM will resume from a charge timeout or from an OVP error, thus its state will move from &quot;ERROR&quot; to &quot;DISABLED&quot; state, so that the charge cycle starts-over.
It is noted that in the case of a Vbat OVP error, the FSM will leave &quot;ERROR&quot; state, as soon as the Vbat comparator for the OVP level shows that Vbat is again OK (so lower than the OVP setting).</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CHARGER_BYPASS</name>
	<description>0 = Charger's FSM is active and running, notifying SW upon switching between its states
1 = Charger's FSM is bypassed, so its state stays to &quot;BYPASS&quot;, so SW should take over the monitoring of the battery voltage and control of the charger. </description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CHARGE_START</name>
	<description>0 = Charger's FSM is disabled, FSM stays at &quot;DISABLED&quot; state
1 = Charger's FSM is enabled, so FSM's state can move from DISABLED to the actual charge states, starting from &quot;PRE_CHARGE&quot;.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CHARGER_ENABLE</name>
	<description>0 = Charger's analogue circuitry is powered-down
1 = Charger's analogue circuitry is being powered-up and will be available after a certain settling time (in ms).
As soon as this bit-field is set, the Charger's FSM waits for this settling time, before proceeding into DISABLED state, where it checks the Vbat level, as well as the Die temperature and the Battery temperature states. This is mandatory, before the actual charging begins, so before the FSM moves to PRE_CHARGE state.
It is finally noted that the settling time is configurable via CHARGER_PWR_UP_TIMER_REG, counting with the 1Khz clock.
Note: The Charger clocks must have been enabled first, by setting the CLK_SYS_REG[CLK_CHG_EN] bit-field to '1', in order to let the FSM proceed.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_CURRENT_PARAM_REG</name>
	<description>Charger current settings register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000020c6</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>I_EOC_DOUBLE_RANGE</name>
	<description>When set, the specific bit-field enables an increase of the (%) range of End-of-Charge current setting. Consequently, the default lower and upper limits of 6% of I_CHARGE (value 0x0 of I_END_OF_CHARGE bit-field) and 20% (value 0x7 of the same bit-field) are increased to 12% and 40% respectively, as soon as the I_EOC_DOUBLE_RANGE bit-field is set.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I_END_OF_CHARGE</name>
	<description>End-of-Charge current setting, ranging from 6%(&quot;000&quot;) to 20% (&quot;111&quot;) of the charge current setting, with a step size of 2%, as follows (when I_EOC_DOUBLE_RANGE = 0):
000 : 6%
001 : 8%
010 : 10%
011 : 12%
100 : 14%
101 : 16%
110 : 18%
111 : 20%
When I_EOC_DOUBLE_RANGE = 1, the range is:
000 : 12%
001 : 16%
010 : 20%
011 : 24%
100 : 28%
101 : 32%
110 : 36%
111 : 40%</description>
	<bitRange>[14:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I_PRECHARGE</name>
	<description>This bit-field determines the Pre-Charge current, in mA, ranging from 0.5 to 72mA, according to the following encoding:
0   :  0.5 mA
1   :  1  mA
2   :  1.5mA
3   :  2 mA
4   :  2.5mA
5   :  3  mA
6   :  3.5mA
7   :  4  mA
8   :  4.5mA
9   :  5  mA
10 :  5.5mA
11 :  6  mA
12 :  6.5mA
13 :  7  mA
14 :  7.5mA
15 :  8  mA
16 :  9  mA
17 : 10 mA
18 : 11 mA
19 : 12 mA
20 : 13 mA
21 : 14 mA
22 : 15 mA
23 : 16 mA
24 : 17 mA
25 : 18 mA
26 : 19 mA
27 : 20 mA
28 : 21 mA
29 : 22 mA
30 : 23 mA
31 : 24 mA
32 : 27 mA
33 : 30 mA
34 : 33 mA
35 : 36 mA
36 : 39 mA
37 : 42 mA
38 : 45 mA
39 : 48 mA
40 : 51 mA
41 : 54 mA
42 : 57 mA
43 : 60 mA
44 : 63 mA
45 : 66 mA
46 : 69 mA
47 : 72 mA
48 : 72 mA
49 : 72 mA
50 : 72 mA
51 : 72 mA
52 : 72 mA
53 : 72 mA
54 : 72 mA
55 : 72 mA
56 : 72 mA
57 : 72 mA
58 : 72 mA
59 : 72 mA
60 : 72 mA
61 : 72 mA
62 : 72 mA
63 : 72 mA</description>
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I_CHARGE</name>
	<description>This bit-field determines the charge current range, in mA. The range is from 5mA to 720mA, according to the following encoding:
0   :   5 mA
1   :  10 mA
2   :  15 mA
3   :  20 mA
4   :  25 mA
5   :  30 mA
6   :  35 mA
7   :  40 mA
8   :  45 mA
9   :  50 mA
10 :  55 mA
11 :  60 mA
12 :  65 mA
13 :  70 mA
14 :  75 mA
15 :  80 mA
16 :  90 mA
17 : 100 mA
18 : 110 mA
19 : 120 mA
20 : 130 mA
21 : 140 mA
22 : 150 mA
23 : 160 mA
24 : 170 mA
25 : 180 mA
26 : 190 mA
27 : 200 mA
28 : 210 mA
29 : 220 mA
30 : 230 mA
31 : 240 mA
32 : 270 mA
33 : 300 mA
34 : 330 mA
35 : 360 mA
36 : 390 mA
37 : 420 mA
38 : 450 mA
39 : 480 mA
40 : 510 mA
41 : 540 mA
42 : 570 mA
43 : 600 mA
44 : 630 mA
45 : 660 mA
46 : 690 mA
47 : 720 mA
48 : 720 mA
49 : 720 mA
50 : 720 mA
51 : 720 mA
52 : 720 mA
53 : 720 mA
54 : 720 mA
55 : 720 mA
56 : 720 mA
57 : 720 mA
58 : 720 mA
59 : 720 mA
60 : 720 mA
61 : 720 mA
62 : 720 mA
63 : 720 mA
Note: It has to be noted that the specific values correspond to the normal battery temperature zone. However, the specific register field may be updated by the JEITA FSM (which checks the battery temperature either once or periodically), in order to adapt the Charge current to the new battery temperature zone (see also CHARGER_CTRL_REG.TBAT_MONITOR_MODE field as well). This is valid also for the Pre-Charge current field of this register and provided that JEITA support is enabled in CHARGER_CTRL_REG.
Consequently, in that case the register return the Charge current settings that abide to the JEITA requirements for the battery (either COOLER, COOL, WARM or NORMAL).</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_CURRENT_STATUS_REG</name>
	<description>Charger current status register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000085</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>I_PRECHARGE_SET</name>
	<description>This bit-field returns the applied Pre-Charge current setting. In JEITA charging, it contains the Pre-Charge value corresponding to the present battery temperature zone, according to JEITA_CURRENT/CURRENT2_SETTINGS_REG. If JEITA charging is disabled, it reflects the value of I_PRECHARGE bit-field CHARGER_CURRENT_PARAM_REG.
The specific bit-field is updated by the battery monitoring (JEITA) FSM, as soon as the latter starts running. Until then, it reflects the corresponding bit-field of CHARGER_CURRENT_PARAM_REG.</description>
	<bitRange>[11:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>I_CHARGE_SET</name>
	<description>This bit-field returns the applied CC current setting. In JEITA charging, it contains the value corresponding to the present battery temperature zone, according to CHARGER_JEITA_CURRENT/CURRENT2_REG. If JEITA charging is disabled, it reflects the value of I_CHARGE bit-field CHARGER_CURRENT_PARAM_REG.
The specific bit-field is updated by the battery monitoring (JEITA) FSM, as soon as the latter starts running. Until then, it reflects the corresponding bit-field of CHARGER_CURRENT_PARAM_REG.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHARGER_CV_CHARGE_TIMER_REG</name>
	<description>Maximum CV-charge time limit register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00001c20</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields><field>
	<name>CV_CHARGE_TIMER</name>
	<description>Returns the current value of the CV-Charge timeout counter, running at a 1Hz clock. The range of the specific timer is identical to the one of the Pre-Charge and the CC-Charge timers, so it may count up to 6 hours, ranging from 0 to MAX_CV_CHARGE_TIME. It is reset to 0 when the Charger's FSM is either in DISABLED or in END_OF_CHARGE state.</description>
	<bitRange>[30:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MAX_CV_CHARGE_TIME</name>
	<description>This bit-field determines the maximum time (measured in ticks of the Charger's 1Hz clock) allowed for the CV (Constant Voltage) charging stage. If this is exceeded, a CV charge time-out error will be captured by the Charger's control unit and its FSM will move to the ERROR state. In order to exit this state and re-start charging, the CHARGER_RESUME bit-field of CHARGER_CTRL_REG must be set.
Note: The specific bit-field should be always set to a non-zero value.</description>
	<bitRange>[14:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHARGER_ERROR_IRQ_CLR_REG</name>
	<description>Interrupt clear register of Charger Error IRQs</description>
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields><field>
