honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
	<registers>
	<register>
	<name>CHG_DET_ADC_CTRL_REG</name>
	<description>Charge detection ADC control register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000007</resetMask>
	<fields><field>
	<name>USB_DM_TO_ADC_EN</name>
	<description>0 = Disables the connection of USBm to the GP_ADC
1 = Enables the connection of USBm to the GP_ADC through a relative test switch</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>USB_DP_TO_ADC_EN</name>
	<description>0 = Disables the connection of USBp to the GP_ADC
1 = Enables the connection of USBp to the GP_ADC through a relative test switch</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHG_DET_DCD_TIMER_REG</name>
	<description>Charge detection DCD time-out timer register (used in the FSM)</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x02580258</resetValue>
	<resetMask>0x03ffffff</resetMask>
	<fields><field>
	<name>DCD_TIMER</name>
	<description>This bit-field returns the current value of the DCD time-out timer, also ticking with the 1KHz clock, same as the shared 8-bit timer.
The specific timer counts only in states NODE_ATTACHED, WAIT_FOR_DCD and CHECK_FOR_DCD, since these are the states where Data Contact Detection is evaluated.
The timer is automatically reloaded with the programmed threshold value (DCD_TIMEOUT_THRES) as soon as the FSM returns to its starting state (WAIT_FOR_ATTACH, 0x0).</description>
	<bitRange>[25:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCD_TIMEOUT_THRES</name>
	<description>This bit-field determines the value from which the Data Contact Detection (DCD) time-out timer starts down-counting, until expiring to zero. Non-zero values are recommended.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHG_DET_FSM_CTRL_REG</name>
	<description>Charge detection FSM control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>CHG_DET_EN</name>
	<description>0 = Charge detection FSM is disabled, the analog part is controlled through the CHG_DET_SW_CTRL_REG register's bit-fields.
1 = Charge detection FSM is enabled and controls the analog part, overruling the content of CHG_DET_SW_CTRL_REG</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHG_DET_FSM_STATUS_REG</name>
	<description>Charge detection FSM status register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields><field>
	<name>CHG_DET_STATE</name>
	<description>This bit-field returns the current state of the charge detection block's FSM. The supported states are:
  - 0x0 : WAIT_FOR_ATTACH (starting state)
  - 0x1 : NODE_ATTACHED (USB_DP_VAL first check)
  - 0x2 : WAIT_FOR_DCD (Data Contact Detection - first state)
  - 0x3 : CHECK_FOR_DCD (Data Contact Detection - second state)
  - 0x4 : WAIT_FOR_PCD (Primary Contact Detection - first state)
  - 0x5 : CHECK_FOR_PCD (Primary Contact Detection - second state)
  - 0x6 : WAIT_FOR_SCD (Secondary Contact Detection - first state)
  - 0x7 : CHECK_FOR_SCD (Secondary Contact Detection - second state)
  - 0x8 : CHG_PORT_DETECTED (terminal state, indicating the port detection's completion).
It is noted that:
  - The FSM returns to state WAIT_FOR_ATTACH either when VBUS_AVAILABLE goes to '0', or when it is disabled by the SW.
  - The FSM may return to state WAIT_FOR_ATTACH from any of the other states when VBUS_AVAILABLE goes to '0', implying either a USB detach event or a VBUS voltage drop.
  - The FSM implements a time-out mechanism during the Data Contact Detection phase (NODE_ATTACHED, WAIT_FOR_DCD and CHECK_FOR_DCD states). A dedicated 10-bit timer counts down in any of these states, until USB_DP_VAL is found to be '0' (so we have a contact detected) or until it expires.
  - The time-out timer's expiration means that there is no D+/D- pins contact detected within the required time-out period, as defined through CHG_DET_DCD_TIMER_REG and as required by the spec. Even in this case though, the FSM does not abort, but proceeds normally to the next state, which is the first Primary Detection State, to comply with the Battery Charging specification.</description>
	<bitRange>[12:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>NO_CONTACT_DETECTED</name>
	<description>0 = Contact is sensed on the Dp/Dm (data) pins by the FSM, during the Data Contact Detection (DCD) phase (USB_DP_VAL = 0)
1 = No contact is sensed on the Dp/Dm pins during the DCD phase (USB_DP_VAL = 1)
Note: Even in the case of no contact detected on the Dp/Dm pins, the FSM continues with the port detection procedure, moving to the Primary Contact Detection (PCD) states.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PORT_2P4AMP_DETECTED</name>
	<description>0 = Port detection either not yet finished or finished without detecting a 2.4 Amp charging port
1 = Port detection has finished by detecting a 2.4 Amp charging port</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PORT_2AMP_DETECTED</name>
	<description>0 = Port detection either not yet finished or finished without detecting a 2 Amp charging port
1 = Port detection has finished by detecting a 2 Amp charging port</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PORT_1AMP_DETECTED</name>
	<description>0 = Port detection either not yet finished or finished without detecting a 1 Amp charging port
1 = Port detection has finished by detecting a 1 Amp charging port</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PS2_PROP_PORT_DETECTED</name>
	<description>0 = Port detection either not yet finished or finished without detecting a PS2 or a Proprietary charger port
1 = Port detection has finished by detecting either a PS2 or a Proprietary charger port</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DCP_PORT_DETECTED</name>
	<description>0 = Port detection either not yet finished or finished without detecting a DCP port (Dedicated Charging Port)
1 = Port detection has finished by detecting a DCP port</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CDP_PORT_DETECTED</name>
	<description>0 = Port detection either not yet finished or finished without detecting a CDP port (Charging Downstream Port)
1 = Port detection has finished by detecting a CDP port</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SDP_PORT_DETECTED</name>
	<description>0 = Port detection either not yet finished or finished without detecting an SDP port (Standard Downstream Port)
1 = Port detection has finished by detecting an SDP port</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DETECTION_COMPLETED</name>
	<description>0 = Port detection not yet finished, FSM still active
1 = Port detection completed, FSM has reached its terminal state (CHG_PORT_DETECTED). The port type is accessible through the relevant bit-fields of this register.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHG_DET_IRQ_CLEAR_REG</name>
	<description>Charge detection IRQ clear register</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>CHG_DET_IRQ_CLR</name>
	<description>Writing any value to this register clears the charge detection IRQ, reading always returns zero.</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>CHG_DET_IRQ_MASK_REG</name>
	<description>Charge detection IRQ mask register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>CHG_DET_IRQ_EN</name>
	<description>0 = Charge detection block's IRQ generation is disabled, interrupts to Cortex-M33 are masked.
1 = Charge detection block's IRQ generation is enabled.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHG_DET_IRQ_STATUS_REG</name>
	<description>Charge detection IRQ status register</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>CHG_DET_IRQ</name>
	<description>0 = No new charge detection IRQ has been generated.
1 = A new charge detection IRQ is generated and should be cleared by SW, by writing to CHG_DET_IRQ_CLEAR_REG (interrupt is level-sensitive).</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHG_DET_STATUS_REG</name>
	<description>Charge detection status register holding the comparator outputs</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>USB_DM_VAL2</name>
	<description>0: USBp &lt; 2.3V
1: USBp &gt; 2.5V</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>USB_DP_VAL2</name>
	<description>0: USBp &lt; 2.3V
1: USBp &gt; 2.5V</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>USB_DM_VAL</name>
	<description>0 = USBm &lt; 0.8V
1 = USBm &gt; 1.5V (PS2 or Proprietary Charger)</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>USB_DP_VAL</name>
	<description>0 = USBp &lt; 0.8V
1 = USBp &gt; 1.5V (PS2 or Proprietary Charger)</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>USB_CHG_DET</name>
	<description>0 = Standard Downstream Port (SDP) or no Dp/Dm contact detected (nothing connected)
1 = Charging Downstream Port (CDP) or Dedicated Charging Port (DCP)</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>USB_DCP_DET</name>
	<description>0 = Charging downstream port is detected
1 = Dedicated charger is detected
It is noted that the control bit VDM_SRC_ON must be set to validate this status bit. 
Note: This register shows the actual status.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>CHG_DET_SW_CTRL_REG</name>
	<description>Charge detection manual (SW-based) mode control register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>IDM_SINK_ON</name>
	<description>0 = Disables the Idm_sink to USBm
1 = Enables the Idm_sink to USBm</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IDP_SINK_ON</name>
	<description>0 = Disables the Idp_sink to USBp
1 = Enables the Idp_sink to USBp</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VDM_SRC_ON</name>
	<description>0 = Disables the Vdm_src
1 = Enables the Vdm to USBm and also the USB_DCP_DET status bit</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VDP_SRC_ON</name>
	<description>0 = Disables the Vdp_src
1 = Enables the Vdp_src and also the USB_CHG_DET status bit</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IDP_SRC_ON</name>
	<description>0 = Disables the Idp_src and the Rdm_dwn
1 = Enables the Idp_src and the Rdm_dwn</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>USB_CHARGE_ON</name>
	<description>0 = Disables the charge detection analog circuit
1 = Enables the charge detection analog circuit</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CHG_DET_TIMER_REG</name>
	<description>Charge detection timer register (used in the FSM)</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00320032</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>CHG_DET_TIMER</name>
	<description>This bit-field returns the current value of the charge detection timer, which is used by the FSM and which down-counts with a clock of 1KHz. The specific clock is enabled by setting the CLK_SYS_REG[CLK_CHG_EN] bit-field to '1' and it is the same clock used by the Charger's digital block.
The specific timer is automatically re-loaded with the programmed threshold value (CHG_DET_TIMER_THRES), upon expiring to zero or when the charge detection FSM moves to the state NODE_ATTACHED (0x1).</description>
	<bitRange>[23:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CHG_DET_TIMER_THRES</name>
	<description>This bit-field determines the value from which the charge detection timer starts down-counting, until expiring to zero. Non-zero values are recommended.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CHIP_VERSION</name>
	<version>1.0</version>
	<description>CHIP_VERSION registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50040000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>256</size>
	<usage>registers</usage>
</addressBlock>
	
