honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
	<registers>
	<register>
	<name>CLK_PDCTRL_REG</name>
	<description>Clock control settings for PD_CTRL</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>EMMC_INV_TX_CLK</name>
	<description>Inverts the clock in the TX path</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EMMC_INV_RX_CLK</name>
	<description>Invert the clock in the RX path, cascaded with INV_TX_CLK</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EMMC_ENABLE</name>
	<description>Enables the clock.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EMMC_CLK_DIV</name>
	<description>clock divider setting
0x0 : divide by 16
0x1 : divide by 1
0x2 : divide by 2
0x4 : divide by 4
0x8 : divide by 8</description>
	<bitRange>[10:7]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_GPU</name>
	<version>1.0</version>
	<description>CRG_GPU registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x51001000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>8</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>CLK_GPU_REG</name>
	<description>Control register for clocks in PD_GPU</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>GPU_ENABLE</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_SNC</name>
	<version>1.0</version>
	<description>CRG_SNC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50020900</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>16</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>CLK_SNC_REG</name>
	<description>Peripheral divider register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>I3C_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I3C_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C3_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C3_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C2_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI2_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART3_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART3_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART2_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART2_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RESET_CLK_SNC_REG</name>
	<description>Peripheral divider register RESET register. Reads back 0x0000</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>I3C_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I3C_ENABLE</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[16:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C3_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C3_ENABLE</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C2_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C2_ENABLE</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C_ENABLE</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI2_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI2_ENABLE</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI_ENABLE</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART3_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART3_ENABLE</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART2_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART2_ENABLE</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UART_ENABLE</name>
	<description>When writing a '1', the respective bit will be reset. Writing a '0' is discarded.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SET_CLK_SNC_REG</name>
	<description>Peripheral divider register SET register. Reads back 0x0000</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0003ffff</resetMask>
	<fields><field>
	<name>I3C_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[17:17]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>I3C_ENABLE</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[16:16]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>I2C3_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>I2C3_ENABLE</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>I2C2_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>I2C2_ENABLE</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>I2C_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>I2C_ENABLE</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>SPI2_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>SPI2_ENABLE</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>SPI_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>SPI_ENABLE</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>UART3_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>UART3_ENABLE</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>UART2_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>UART2_ENABLE</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>UART_CLK_SEL</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>UART_ENABLE</name>
	<description>When writing a '1', the respective bit will be set. Writing a '0' is discarded.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-writeOnce</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_SYS</name>
	<version>1.0</version>
	<description>CRG_SYS registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50040400</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>20</size>
	<usage>registers</usage>
</addressBlock>
	
