honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
	<registers>
	<register>
	<name>BATCHECK_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>BATCHECK_LOAD_ENABLE</name>
	<description>Enable a current load on the battery.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BATCHECK_ILOAD</name>
	<description>Set the current load to (ILOAD+1) mA.</description>
	<bitRange>[6:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BATCHECK_TRIM</name>
	<description>Trim the current load with steps of 2.7% from -19.1% to +19.1%.
0: +0.0% , 8: -0%
1: +2.7% , 9: -2.7%
2: +5.5% , 10: -5.5%
3: +8.2% , 11: -8.2%
4: +10.9% , 12: -10.9%
5: +13.6% , 13: -13.6%
6: +16.4% , 14: -16.4%
7: +19.1% , 15: -19.1%</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CLK_SYS_REG</name>
	<description>Peripheral divider register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SPI3_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI3_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLK_CHG_EN</name>
	<description>Enables the clocks for the charger FSM block</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCD_RESET_REQ</name>
	<description>Generates a SW reset towards the LCD controller.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCD_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCD_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>RESET_CLK_SYS_REG</name>
	<description>Peripheral divider RESET register</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SPI3_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI3_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLK_CHG_EN</name>
	<description>Enables the clocks for the charger FSM block</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCD_RESET_REQ</name>
	<description>Generates a SW reset towards the LCD controller.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCD_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCD_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SET_CLK_SYS_REG</name>
	<description>Peripheral divider SET register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SPI3_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SPI3_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLK_CHG_EN</name>
	<description>Enables the clocks for the charger FSM block</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCD_RESET_REQ</name>
	<description>Generates a SW reset towards the LCD controller.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCD_CLK_SEL</name>
	<description>Selects the clock source
1 = DIV1 clock
0 = DIVN clock</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LCD_ENABLE</name>
	<description>Enables the clock</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_TOP</name>
	<version>1.0</version>
	<description>CRG_TOP registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50000000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>252</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>ANA_STATUS_REG</name>
	<description>Analog Signals Status Register</description>
	<addressOffset>0x000000ec</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x3fffffff</resetMask>
	<fields><field>
	<name>FLAG_LDO_V30_COMBINED_OK</name>
	
	<bitRange>[29:29]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XOR_DOUT_WAKEUP_PADS</name>
	<description>Will be the result of XOR operation of the hibernation wakeup pads outputs combined.
DFT_EN_INPUT_PD_AON_PADS in TEST_CTRL5_REG must be 1.</description>
	<bitRange>[28:28]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VBUS_AVAILABLE</name>
	<description>High when VBUS &gt; ( VBAT + 150 mV). Hysteresis is approx. 40 mV</description>
	<bitRange>[27:27]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FLAG_ADC_LDO_OK</name>
	<description>When high, ldo_adc is active</description>
	<bitRange>[26:26]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FLAG_IBIAS_TRIM</name>
	<description>10nA Iref trimming, high when on-chip current is larger than reference current</description>
	<bitRange>[25:25]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOD_VIN_NOK</name>
	<description>General output of the BOD to indicate that one of the monitored inputs is below the trigger-level.</description>
	<bitRange>[24:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BG_OK</name>
	<description>When high bandgap is active</description>
	<bitRange>[23:23]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOOST_DCDC_VLED_OK</name>
	<description>When high, boost dcdc vled is active</description>
	<bitRange>[22:22]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LDO_VSYS_HIGH_TEMP</name>
	<description>If 1 indicates that temperature of LDO_VSYS is above operating conditions</description>
	<bitRange>[21:21]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VBAT_VSYS_STATE</name>
	<description>0x0 : Hibernation mode or VBUS-only ( sysbat switch opened).
0x1 : Test mode ( sysbat switch closed).
0x2 : Ideal diode enabled (with VBAT-only or VBUS and VBAT) .
0x3 : Sleep mode (with VBAT-only, sysbat switch closed).</description>
	<bitRange>[20:19]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LDO_VSYS_HEAD_LIM</name>
	<description>When high, the headroom loop is controlling VSYS </description>
	<bitRange>[18:18]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LDO_VSYS_CURR_LIM</name>
	<description>When high, the current limiter is controlling VSYS </description>
	<bitRange>[17:17]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LDO_VSYS_LIM</name>
	<description>When high, the voltage loop is controlling VSYS </description>
	<bitRange>[16:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LDO_VSYS_OK</name>
	<description>When high, LDO_VSYS is in regulating mode </description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LDO_V30_OK</name>
	<description>When high, ldo_v30 is active</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SWITCH_V18F_OK</name>
	<description>V18F switch completely closed</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUCK_DCDC_V18P_OK</name>
	<description>V18P Rail ok based on DCDC V18P programmed level</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUCK_DCDC_V18_OK</name>
	<description>V18 Rail ok based on DCDC V18 programmed level</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUCK_DCDC_V14_OK</name>
	<description>V14 Rail ok based on DCDC V14 programmed level</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUCK_DCDC_V12_OK</name>
	<description>V12 Rail ok based on DCDC V12 programmed level</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COMP_VBUS_PLUGIN</name>
	<description>VBUS is connected (VBUS &gt; 2.5V)</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COMP_VSYS_NEAR_VLED</name>
	<description>BOOST_VLED_SEL=0x0 : VSYS&gt;4.3
BOOST_VLED_SEL=0x1 : VSYS&gt;4.55
BOOST_VLED_SEL=0x2 : VSYS&gt;4.8
BOOST_VLED_SEL=0x3 : VSYS&gt;4.8</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COMP_VBUS_ABOVE_VSYS</name>
	<description>VBUS&gt;VSYS+0.05V</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COMP_VSYS_OK</name>
	<description>VSYS&gt; 2.45V</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COMP_VBAT_OK</name>
	<description>VBAT&gt; 2.7V</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>COMP_VBUS_OK</name>
	<description>1: VBUS&gt; 4.1V
0: VBUS&lt;3.4V</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>POR_VSYS_OK</name>
	
