honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>POR_V30_OK</name>
	
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>BANDGAP_REG</name>
	<description>bandgap trimming</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00008020</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>EN_BGR_TCCOMP</name>
	<description>Enable Temperature compensation in the reference current
for Charger and LED module.
&quot;1&quot; = enabled ( = default setting)
&quot;0&quot; = Disabled original currents from BGR are used
instead of the Temp-compensated currents</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BANDGAP_ENABLE_CLAMP</name>
	<description>Enables a supply clamp inside the bandgap that improves PSRR. Should be enabled by software after cold boot.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BGR_TRIM</name>
	<description>Trim register for bandgap</description>
	<bitRange>[11:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYSRAM_LPMX</name>
	<description>RAM Transparent Light Sleep (TLS) Core Enable for System RAMs and Cache RAM. Assert low to enable the TLS core feature, which will result in lower leakage current.
In case VDD is below 0.81V, it is necessary to hold this pin high to maintain data retention.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BGR_ITRIM</name>
	<description>Current trimming for bias </description>
	<bitRange>[4:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BIAS_VREF_SEL_REG</name>
	
	<addressOffset>0x000000e8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000bb</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>BIAS_VREF_RF2_SEL</name>
	<description>same coding as BIAS_VREF_RF1_SEL.</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BIAS_VREF_RF1_SEL</name>
	<description>Vref_code | Vref_Voltage (mV)
0:900
1:930
2:960
3:990
4:1020
5:1050
6:1080
7:1110
8:1140
9:1170
10:1200
11:1230
12:1260
13:1290
14:1320
15:1350</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BOD_CTRL_REG</name>
	<description>Brown Out Detection control register</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0007fc02</resetValue>
	<resetMask>0x0007ffff</resetMask>
	<fields><field>
	<name>BOD_VBUS_RST_EN</name>
	<description>If set, generate power-on reset on channel VBUS</description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_VBAT_RST_EN</name>
	<description>If set, generate power-on reset on channel VBAT.</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_VSYS_RST_EN</name>
	<description>If set, generate power-on reset on channel VSYS. Bear in mind that there is an additional configurable POR on VSYS rail, check POR_CTRL_REG.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V18F_RST_EN</name>
	<description>If set, generate power-on reset on channel V18F</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V18P_RST_EN</name>
	<description>If set, generate power-on reset on channel V18P</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V18_RST_EN</name>
	<description>If set, generate power-on reset on channel V18</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V14_RST_EN</name>
	<description>If set, generate power-on reset on channel V14</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V12_RST_EN</name>
	<description>If set, generate power-on reset on channel V12</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_VBUS_EN</name>
	<description>Enable brown-out detection for channel VBUS</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_VBAT_EN</name>
	<description>Enable brown-out detection for channel VBAT.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_VSYS_EN</name>
	<description>Enable brown-out detection for channel VSYS. Bear in mind that there is an additional configurable POR on VSYS rail, check POR_CTRL_REG.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V18F_EN</name>
	<description>Enable brown-out detection for channel V18F</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V18P_EN</name>
	<description>Enable brown-out detection for channel V18P</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V18_EN</name>
	<description>Enable brown-out detection for channel V18</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V14_EN</name>
	<description>Enable brown-out detection for channel V14</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_V12_EN</name>
	<description>Enable brown-out detection for channel VDD (V12)</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOD_STATUS_CLEAR</name>
	<description>Clears BOD_STATUS_REG when this bit is 1 for more than 2us. It must be 0 to register BOD events in BOD_STATUS_REG.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>BOD_STATUS_REG</name>
	
