honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
	<registers>
	<register>
	<name>VSYS_GEN_CTRL_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000610ed</resetValue>
	<resetMask>0x01ffffff</resetMask>
	<fields><field>
	<name>FORCE_VBAT_VSYS_SW</name>
	<description>0x0,0x1: VBAT_VSYS set to ideal diode
0x2: Forces VBAT_VSYS switch to be opened
0x3: Forces VBAT_VSYS switch to be closed </description>
	<bitRange>[24:23]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FORCE_LDO_ENABLE</name>
	<description>0x0,0x1: LDO VSYS will be enabled when COMP_VBUS_OK &amp; COMP_VBUS_ABOVE_VSYS.
0x2: LDO_VSYS will be disabled regardless of VBUS state
0x3: LDO_VSYS will be enabled regardless of VBUS state</description>
	<bitRange>[22:21]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_TEMP_PROTECT_MODE</name>
	<description>0x0: LDO_VSYS is muted (disabled) when temperature is too high, when temperature is back to operating conditions ldo is unmuted
0x1: LDO_VSYS is muted (disabled) when temperature is too high, LDO_VSYS_HIGH_TEMP_IRQ must be cleared to allow ldo to be unmuted. See VSYS_GEN_IRQ_CLEAR_REG.
0x2: LDO_VSYS is not muted (disabled) when temperature is too high
0x3: Force LDO_VSYS mute </description>
	<bitRange>[20:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EN_HEADROOM</name>
	<description>Enables the voltage headroom loop in the LDO_VSYS. </description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CURLIM_OFFSET_TRIM</name>
	<description>For adjusting the offset of the curlim range ( +/- 78 mA)
0x0 = maximum positive offset.
0x10 = minimal offset ( reset value).
0x1F = maximum negative offset.</description>
	<bitRange>[17:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CURLIM_GAIN_TRIM</name>
	<description>For adjusting the gain of the curlim range ( +/- 20%)
0x0 = maximum gain.
0x10 = nominal gain ( reset value).
0x1F = minimum gain.</description>
	<bitRange>[12:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CURLIM_SET</name>
	<description>Sets the level of the LDO_VSYS current limiter in 10 mA steps. It is reset when vbus is not plugged (COMP_VBUS_PLUGIN == 0).
0x0 = 1270 mA
0x1 = 1260 mA
...
0x76 = 90 mA ( reset value)
</description>
	<bitRange>[7:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EN_CURLIM</name>
	<description>Enables the current limiter in the LDO_VSYS</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>VSYS_GEN_IRQ_CLEAR_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>VBUS_LOW_DRIVE_IRQ_CLEAR</name>
	<description>Clears VBUS_LOW_DRIVE_IRQ</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>LDO_VSYS_HIGH_TEMP_IRQ_CLEAR</name>
	<description>Clears LDO_VSYS_HIGH_TEMP_IRQ</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>VSYS_GEN_IRQ_MASK_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000002</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>VBUS_LOW_DRIVE_IRQ_MASK</name>
	<description>Masks VBUS_LOW_DRIVE_IRQ interrupt. It is reset when vbus is not plugged in (COMP_VBUS_PLUGIN == 0). This is because when vbus is just plugged in, it is likely to bounce; therefore IRQ is masked to avoid false triggering. Some time after vbus plugin, software might increase ldo_vsys current limit and should set this mask to 0 (after clearing IRQ).</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_VSYS_HIGH_TEMP_IRQ_MASK</name>
	<description>Masks LDO_VSYS_HIGH_TEMP_IRQ interrupt</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>VSYS_GEN_IRQ_STATUS_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>VBUS_LOW_DRIVE_IRQ_STATUS</name>
	<description>Indicates vbus drive strength is not enough to keep vbus up with the set limit of ldo_vbus. Consider lowering CURLIM_SET in VSYS_GEN_CTRL_REG. </description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LDO_VSYS_HIGH_TEMP_IRQ_STATUS</name>
	<description>Indicates that a high temperature has been detected at ldo_vsys </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>CRG_XTAL</name>
	<version>1.0</version>
	<description>CRG_XTAL registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50050400</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>156</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>PLL_SYS_CTRL1_REG</name>
	<description>System PLL control register 1.</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000e8a0</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PLL_OUT_DIV</name>
	<description>0: Output divider ON 1: Output divider OFF</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_SEL_MIN_CUR_INT</name>
	<description>0: VCO current read from min_current &lt;5:0&gt;,
1: VCO current is internally determined with a calibration algoritm.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_PRE_DIV</name>
	<description>PLL input divider (1: Indicates divide by 2).</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_N_DIV</name>
	<description>PLL loop divider N (x means divide by x, 0 means divide by 1) </description>
	<bitRange>[10:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_PLL_VREF_HOLD</name>
	<description>0: Indicates that the reference input is tracked,
1: Indicates that the reference input is sampled.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_PLL_ENABLE</name>
	<description>0: LDO PLL off,
1: LDO PLL on.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_RST_N</name>
	<description>0: PLL in Reset 1L PLL out of Reset </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_EN</name>
	<description>0: Power down
1: PLL on </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PLL_SYS_CTRL2_REG</name>
	<description>System PLL control register 2.</description>
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00002480</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PLL_RECALIB</name>
	<description>Recalibrate</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PLL_SYS_CTRL3_REG</name>
	<description>System PLL control register 3.</description>
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00009070</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PLL_MIN_CURRENT</name>
	<description>VCO current trimming.</description>
	<bitRange>[6:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PLL_SYS_STATUS_REG</name>
	<description>System PLL status register.</description>
	<addressOffset>0x00000070</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>LDO_PLL_OK</name>
	<description>1: Indicates that LDO PLL is in regulation.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PLL_CALIBRATION_END</name>
	<description>Indicates that calibration has finished.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PLL_BEST_MIN_CUR</name>
	<description>Calibrated VCO current.</description>
	<bitRange>[10:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PLL_LOCK_FINE</name>
	<description>1: PLL locked </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>PLL_USB_CTRL1_REG</name>
	<description>USB PLL control register 1.</description>
	<addressOffset>0x00000074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00006890</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PLL_OUT_DIV</name>
	<description>0: Output divider ON 1: Output divider OFF</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_SEL_MIN_CUR_INT</name>
	<description>0: VCO current read from min_current &lt;5:0&gt;,
1: VCO current is internally determined with a calibration algoritm.</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_PRE_DIV</name>
	<description>PLL input divider (1: Indicates divide by 2).</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_N_DIV</name>
	<description>PLL loop divider N (x means divide by x, 0 means divide by 1) </description>
	<bitRange>[10:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_PLL_VREF_HOLD</name>
	<description>0: Indicates that the reference input is tracked,
1: Indicates that the reference input is sampled.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LDO_PLL_ENABLE</name>
	<description>0: LDO PLL off,
1: LDO PLL on.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_RST_N</name>
	<description>0: PLL in Reset 1L PLL out of Reset </description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PLL_EN</name>
	<description>0: Power down
1: PLL on </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PLL_USB_CTRL2_REG</name>
	<description>USB PLL control register 2.</description>
	<addressOffset>0x00000078</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00002480</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PLL_RECALIB</name>
	<description>Recalibrate</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PLL_USB_CTRL3_REG</name>
	<description>USB PLL control register 3.</description>
	<addressOffset>0x0000007c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00009070</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PLL_MIN_CURRENT</name>
	<description>VCO current trimming.</description>
	<bitRange>[6:1]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>PLL_USB_STATUS_REG</name>
	<description>USB PLL status register.</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>LDO_PLL_OK</name>
	<description>1: Indicates that LDO PLL is in regulation.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PLL_CALIBRATION_END</name>
	<description>Indicates that calibration has finished.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PLL_BEST_MIN_CUR</name>
	<description>Calibrated VCO current.</description>
	<bitRange>[10:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>PLL_LOCK_FINE</name>
	<description>1: PLL locked </description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>RESET_SYS_IRQ_CTRL_REG</name>
	<description>System IRQ RESET register</description>
	<addressOffset>0x00000098</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>CMAC2SNC_IRQ_BIT</name>
	<description>When writing a '1', the respective IRQ line will be reset. Writing a '0' is discarded.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMAC2SYS_IRQ_BIT</name>
	<description>When writing a '1', the respective IRQ line will be reset. Writing a '0' is discarded.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC2SYS_IRQ_BIT</name>
	<description>When writing a '1', the respective IRQ line will be reset. Writing a '0' is discarded.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC2CMAC_IRQ_BIT</name>
	<description>When writing a '1', the respective IRQ line will be reset. Writing a '0' is discarded.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS2SNC_IRQ_BIT</name>
	<description>When writing a '1', the respective IRQ line will be reset. Writing a '0' is discarded.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS2CMAC_IRQ_BIT</name>
	<description>When writing a '1', the respective IRQ line will be reset. Writing a '0' is discarded.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SET_SYS_IRQ_CTRL_REG</name>
	<description>System IRQ SET register</description>
	<addressOffset>0x00000094</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>CMAC2SNC_IRQ_BIT</name>
	<description>When writing a '1', the respective IRQ line will be set. Writing a '0' is discarded.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMAC2SYS_IRQ_BIT</name>
	<description>When writing a '1', the respective IRQ line will be set. Writing a '0' is discarded.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC2SYS_IRQ_BIT</name>
	<description>When writing a '1', the respective IRQ line will be set. Writing a '0' is discarded.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC2CMAC_IRQ_BIT</name>
	<description>When writing a '1', the respective IRQ line will be set. Writing a '0' is discarded.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS2SNC_IRQ_BIT</name>
	<description>When writing a '1', the respective IRQ line will be set. Writing a '0' is discarded.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS2CMAC_IRQ_BIT</name>
	<description>When writing a '1', the respective IRQ line will be set. Writing a '0' is discarded.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>SYS_IRQ_CTRL_REG</name>
	<description>System IRQ control register</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>CMAC2SNC_IRQ_BIT</name>
	<description>Direct read/write to the specific IRQ bit</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMAC2SYS_IRQ_BIT</name>
	<description>Direct read/write to the specific IRQ bit</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC2SYS_IRQ_BIT</name>
	<description>Direct read/write to the specific IRQ bit</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SNC2CMAC_IRQ_BIT</name>
	<description>Direct read/write to the specific IRQ bit</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS2SNC_IRQ_BIT</name>
	<description>Direct read/write to the specific IRQ bit</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SYS2CMAC_IRQ_BIT</name>
	<description>Direct read/write to the specific IRQ bit</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_CAP_MEAS_REG</name>
	<description>Capacitance measure circuit control</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000090</resetValue>
	<resetMask>0x000001ff</resetMask>
	<fields><field>
	<name>XTAL32M_MEAS_TIME</name>
	<description>Select measurement time (in DIVN clock-cycles)
0: 32
1: 64

6: 2048
7: 4096</description>
	<bitRange>[8:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_MEAS_START</name>
	<description>Starts capacitance measurement</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_MEAS_CUR</name>
	<description>Select measurement current (minimum required capacitance)
0: 100nA (0.44pF)
1: 500nA (2.22pF)
2: 1uA (4.44pF)
3: 5uA (22.2pF)</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CAP_SELECT</name>
	<description>Select measured capacitance
0: disabled
1: hold capacitance
2: xtal_p
3: xtal_n
4: xtal_p + xtal_n
5: low reference on xtal_p
6: low reference on xtal_p</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_CTRL_REG</name>
	<description>Xtal32m control register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000415</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>XTAL32M_DRIVE_CYCLES</name>
	<description>Number of drive clock-cycles
0x0: Drive disabled
0x1: 4
0x2: 8
0x3: 16
0x4: 32
0x5: 64
0x6:128
0x7:256</description>
	<bitRange>[11:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_ENABLE</name>
	<description>Enables xtal32m (testing purposes)</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_BIASPROT</name>
	<description>Bias startup circuit
0: enable during startup
1: always enabled
2: always disabled</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_LDO_SAH</name>
	<description>Controls amplitude regulator sample-and-hold
2'b00: set to HOLD when IRQ fires
2'b01: always TRACK
2'b1x: always HOLD</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_AMPREG_SAH</name>
	<description>Controls amplitude regulator sample-and-hold
2'b00: set to HOLD when IRQ fires
2'b01: always TRACK
2'b1x: always HOLD</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_BIAS_SAH</name>
	<description>Controls bias sample-and-hold
2'b00: set to HOLD when IRQ fires
2'b01: always TRACK
2'b1x: always HOLD</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_FSM_REG</name>
	<description>Startup state machine configuration</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>XTAL32M_BOOST_MODE</name>
	<description>Boost mode configuration
0: Only allow BOOST mode in START state
1: Allow BOOST mode in SETTLE and START state</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_FSM_APPLY_CONFIG</name>
	<description>CUR_SET, AMPL_SET, CMP_LVL and TRIM from XTAL32M_TRIM_REG are
0: applied at next startup
1: immediately applied</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_FSM_FORCE_IDLE</name>
	<description>Forces FSM in IDLE state, allows for software control</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CMP_MODE</name>
	<description>Use following comparator trim settings in SETTLE state:
0: XTAL32M_TRIM_REG.CMP_LVL
1: XTAL32M_SETTLE_REG.CMP_LVL</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_TRIM_MODE</name>
	<description>Use following trimsetting in the SETTLE state
0: XTAL32M_TRIM_REG.TRIM
1: XTAL32M_SETTLE_REG.TRIM</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_CUR_MODE</name>
	<description>Use the following current setting in the SETTLE state
0: XTAL32M_START_REG.CUR_SET
1: XTAL32M_SETTLE_REG.CUR_SET</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_IRQ_CTRL_REG</name>
	<description>Xtal32m Interrupt control register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000008ff</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields><field>
	<name>XTAL32M_IRQ_CAP_CTRL</name>
	<description>The IRQ counter is captured in the XTAL32M_IRQ_STATUS_REG.IRQ_COUNT_CAP when reaching the following state
0: START
1: SETTLE
2: RUN</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_IRQ_ENABLE</name>
	<description>Enable xtal interrupt generation.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_IRQ_CLK</name>
	<description>Clock divider for IRQ counter
0: 4us
1: 32us</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XTAL32M_IRQ_CNT</name>
	<description>IRQ counter start value.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>XTAL32M_IRQ_STAT_REG</name>
	<description>XTAL32M IRQ status register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>XTAL32M_IRQ_COUNT_CAP</name>
	<description>Captured IRQ counter</description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>XTAL32M_IRQ_COUNT_STAT</name>
	<description>Current IRQ counter value</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>XTAL32M_SETTLE_REG</name>
	<description>Trim values for XTAL32M in SETTLE state of startup</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x001a312c</resetValue>
	<resetMask>0x1fffffff</resetMask>
	<fields><field>
	<name>XTAL32M_TIMEOUT</name>
	<description>Timeout
0: disabled
1: 4us
2: 8us

