honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00024000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>BOOST_COMP_TRIM</name>
	<description>Actual P side comparator trim value</description>
	<bitRange>[23:18]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOOST_IDLE</name>
	<description>Converter idle</description>
	<bitRange>[17:17]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOOST_CUR_LIM</name>
	<description>Actual inductor peak current limit</description>
	<bitRange>[16:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOOST_COMP_P_DYN_P</name>
	<description>P output of P side dynamic comparator</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOOST_COMP_P_DYN_N</name>
	<description>N output of P side dynamic comparator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOOST_COMP_P_CONT</name>
	<description>Output of P side continuous time comparator</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOOST_COMP_N_CONT</name>
	<description>Output of N side continuous time comparator</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOOST_TIMEOUT_PSW</name>
	<description>Timeout on P switch occurred</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOOST_TIMEOUT_NSW</name>
	<description>Timeout on N switch occurred</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOOST_VOUT_NOK</name>
	<description>NOK output of output voltage comparator</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOOST_VOUT_OK</name>
	<description>OK output of output voltage comparator</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOOST_SW_STATE</name>
	<description>State of boost converter switches
0x0: Both off
0x1: P switch on
0x2: N switch on
0x3: Undefined</description>
	<bitRange>[3:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOOST_STARTUP_COMPLETE</name>
	<description>Indicates if the converter is enabled and the startup counter has expired (internal biasing settled)</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BOOST_VLED_OK</name>
	<description>Indicates that V_LED is above its threshold, reset after too many subsequent V_NOK events</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>BOOST_TEST_CTRL_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00f00200</resetValue>
	<resetMask>0x1fffffff</resetMask>
	<fields><field>
	<name>BOOST_ILOAD_SEL_TEST</name>
	<description>Test mode control for 20mA test-mux
0x0: All switches open (Default)
0x1: Sink 20mA from LX for testing PMOS
0x2: Sink 20mA from V_LED
0x3: Source 20mA into LX for testing NMOS</description>
	<bitRange>[28:27]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOST_LSSUP_TRIM</name>
	<description>Trim low side supply voltage
V = 2 V + 300 mV * N, default 2.9 V</description>
	<bitRange>[23:22]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOST_HSGND_TRIM</name>
	<description>Trim high side ground
V = VBAT - (2 V + 400 mV * N), default VBAT - 3.2 V</description>
	<bitRange>[21:20]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>VLED_PWR_CTRL_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000200</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields><field>
	<name>VLED_PWR_FORCE</name>
	<description>Manual selection of VLED supply source, requires that VLED_PWR_MANUAL = 0x1
0x0: VLED not powered
0x1: VLED powered by VSYS
0x2: VLED powered by boost converter
0x3: N.A.</description>
	<bitRange>[12:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VLED_PWR_MANUAL</name>
	<description>0x0: VLED supply source automatically selected
0x1: VLED supply source manually selected</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VLED_PWR_USE_VSYS_LVL</name>
	<description>Sets the condition for powering VLED from VSYS
0x0: VLED always powered from VSYS
0x1: VLED powered form VSYS if VSYS is near VLED, depending on vsys-comparator (Default)</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VLED_PWR_ENABLE</name>
	<description>0x0: VLED power controller disabled
0x1: VLED power controller enabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VSYS_OK_DEBOUNCE</name>
	<description>Sets debounce time on VSYS comparator in steps of 1.024 ms
Note: actual delay can be up to one period of 1.024 ms clock shorter than programmed depending on alignment of comparator trip event and clock edge </description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>VLED_PWR_STATUS_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>VLED_PWR_ALLOW_BOOST</name>
	<description>Indicates whether boost converter is blocked or not</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VLED_PWR_VSYS_CONNECTED</name>
	<description>Indicates that VSYS switch is closed</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VLED_PWR_SWITCH_CTRL_STATE</name>
	<description>State of the VLED power control FSM
0x0: Disabled
0x1: VSYS
0x2: Boost
0x3: N.A.</description>
	<bitRange>[3:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VSYS_OK_DEBOUNCED</name>
	<description>Output of VSYS OK debounce logic</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>VSYS_OK</name>
	<description>Output of VSYS OK logic</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>DMA</name>
	<version>1.0</version>
	<description>DMA registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x51000400</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>280</size>
	<usage>registers</usage>
</addressBlock>
	
