honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
	<access>read-write</access>
	</field><field>
	<name>AINC</name>
	<description>Enable increment of source address.
0 = do not increment (source address stays the same during the transfer)
1 = increment according to the value of BW bit-field (by 1, when BW=&quot;00&quot; ; by 2, when BW=&quot;01&quot; ; by 4, when BW=&quot;10&quot;)</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BINC</name>
	<description>Enable increment of destination address.
0 = do not increment (destination address stays the same during the transfer)
1 = increment according to the value of BW bit-field (by 1, when BW=&quot;00&quot; ; by 2, when BW=&quot;01&quot; ; by 4, when BW=&quot;10&quot;)</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DREQ_MODE</name>
	<description>0: DMA channel starts immediately
1: DMA channel must be triggered by peripheral DMA request (see also the description of DMA_REQ_MUX_REG)
NOTE: This bit-field is overruled to '0' when channel 5 is configured as trusted channel (in Secure Boot mode).</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BW</name>
	<description>Bus transfer width:
00 = 1 Byte (suggested for peripherals like UART and 8-bit SPI)
01 = 2 Bytes (suggested for peripherals like I2C and 16-bit SPI)
10 = 4 Bytes (suggested for Memory-to-Memory transfers)
11 = Reserved</description>
	<bitRange>[2:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_ON</name>
	<description>0: DMA channel is off, clocks are disabled
1: DMA channel is enabled. This bit will be automatically cleared after the completion of a transfer, if Circular mode is not enabled. In Circular mode, this bit stays set.
NOTE: If DMA_ON is disabled by SW while the DMA channel is active, it cannot be enabled again until the channel has completed the last on-going read-write cycle and has stopped. Thus, the SW has to check that the reading of DMA7_CTRL_REG.DMA_ON returns 0, before setting again the specific bit-field.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DMA7_IDX_REG</name>
	<description>Index pointer register of DMA channel 7</description>
	<addressOffset>0x000000f4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DMA7_IDX</name>
	<description>This (read-only) register determines the data items already transferred by the DMA channel. Hence, if its value is 1, then the DMA channel has already copied one data item and it is currently performing the next copy. If its value is 2, then two items have already been copied, and so on.
When the transfer is completed (so when DMA7_CTRL_REG[DMA_ON] has been cleared) and DMA7_CTRL_REG[CIRCULAR] is not set, the register keeps its (last) value (which should be equal to DMA7_LEN_REG) and it is automatically reset to 0 upon starting a new transfer. In Circular mode, the register is automatically initialized to 0 as soon as the DMA channel starts-over again.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DMA7_INT_REG</name>
	<description>Interrupt length register of DMA channel 7</description>
	<addressOffset>0x000000e8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DMA7_INT</name>
	<description>Number of transfers until an interrupt is generated. The interrupt is generated after a transfer, if and only if DMA7_INT_REG has reached DMA7_IDX_REG and before DMA7_IDX_REG is incremented. The interrupt enable bit of this this channel must be already enabled, to let the channel's controller generate the interrupt (see also DMA_INT_MASK_REG and the SET/RESET interrupt registers).</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DMA7_LEN_REG</name>
	<description>Transfer length register of DMA channel 7</description>
	<addressOffset>0x000000ec</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DMA7_LEN</name>
	<description>DMA channel's transfer length. DMA7_LEN of value 0, 1, 2, ... results into an actual transfer length of 1, 2, 3, ...</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DMA_CLEAR_INT_REG</name>
	<description>DMA Interrupt clear register</description>
	<addressOffset>0x00000108</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>DMA_RST_IRQ_CH7</name>
	<description>Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 7 ; writing a 0 will have no effect</description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DMA_RST_IRQ_CH6</name>
	<description>Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 6 ; writing a 0 will have no effect</description>
	<bitRange>[6:6]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DMA_RST_IRQ_CH5</name>
	<description>Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 5 ; writing a 0 will have no effect</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DMA_RST_IRQ_CH4</name>
	<description>Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 4 ; writing a 0 will have no effect</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DMA_RST_IRQ_CH3</name>
	<description>Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 3 ; writing a 0 will have no effect</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DMA_RST_IRQ_CH2</name>
	<description>Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 2 ; writing a 0 will have no effect</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DMA_RST_IRQ_CH1</name>
	<description>Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 1 ; writing a 0 will have no effect</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>DMA_RST_IRQ_CH0</name>
	<description>Writing a 1 will reset the status bit of DMA_INT_STATUS_REG for channel 0 ; writing a 0 will have no effect</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>DMA_INT_MASK_REG</name>
	<description>DMA Interrupt mask register</description>
	<addressOffset>0x0000010c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>DMA_IRQ_ENABLE7</name>
	<description>0: disable interrupts on channel 7
1: enable interrupts on channel 7</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_IRQ_ENABLE6</name>
	<description>0: disable interrupts on channel 6
1: enable interrupts on channel 6</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_IRQ_ENABLE5</name>
	<description>0: disable interrupts on channel 5
1: enable interrupts on channel 5</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_IRQ_ENABLE4</name>
	<description>0: disable interrupts on channel 4
1: enable interrupts on channel 4</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_IRQ_ENABLE3</name>
	<description>0: disable interrupts on channel 3
1: enable interrupts on channel 3</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_IRQ_ENABLE2</name>
	<description>0: disable interrupts on channel 2
1: enable interrupts on channel 2</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_IRQ_ENABLE1</name>
	<description>0: disable interrupts on channel 1
1: enable interrupts on channel 1</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_IRQ_ENABLE0</name>
	<description>0: disable interrupts on channel 0
1: enable interrupts on channel 0</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DMA_INT_STATUS_REG</name>
	<description>DMA Interrupt status register</description>
	<addressOffset>0x00000104</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DMA_BUS_ERR7</name>
	<description>0: No bus error response is detected for channel 7
1: Bus error response detected for channel 7
NOTE: This bit-field is auto-clear and it is initialized to '0' as soon as a new transfer is started. It is also noted that when channel 7 is configured as &quot;trusted&quot; (in Secure Boot mode), this bit-field is overruled to '0', masking the bus error status reported to the user.</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_BUS_ERR6</name>
	<description>0: No bus error response is detected for channel 6
1: Bus error response detected for channel 6</description>
	<bitRange>[14:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_BUS_ERR5</name>
	<description>0: No bus error response is detected for channel 5
1: Bus error response detected for channel 5</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_BUS_ERR4</name>
	<description>0: No bus error response is detected for channel 4
1: Bus error response detected for channel 4
NOTE: This bit-field is auto-clear and it is initialized to '0' as soon as a new transfer is started.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_BUS_ERR3</name>
	<description>0: No bus error response is detected for channel 3
1: Bus error response detected for channel 3
NOTE: This bit-field is auto-clear and it is initialized to '0' as soon as a new transfer is started.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_BUS_ERR2</name>
	<description>0: No bus error response is detected for channel 2
1: Bus error response detected for channel 2
NOTE: This bit-field is auto-clear and it is initialized to '0' as soon as a new transfer is started.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_BUS_ERR1</name>
	<description>0: No bus error response is detected for channel 1
1: Bus error response detected for channel 1
NOTE: This bit-field is auto-clear and it is initialized to '0' as soon as a new transfer is started.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_BUS_ERR0</name>
	<description>0: No bus error response is detected for channel 0
1: Bus error response detected for channel 0
NOTE: This bit-field is auto-clear and it is initialized to '0' as soon as a new transfer is started.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_IRQ_CH7</name>
	<description>0: IRQ on channel 7 is not set
1: IRQ on channel 7 is set</description>
	<bitRange>[7:7]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_IRQ_CH6</name>
	<description>0: IRQ on channel 6 is not set
1: IRQ on channel 6 is set</description>
	<bitRange>[6:6]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_IRQ_CH5</name>
	<description>0: IRQ on channel 5 is not set
1: IRQ on channel 5 is set</description>
	<bitRange>[5:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_IRQ_CH4</name>
	<description>0: IRQ on channel 4 is not set
1: IRQ on channel 4 is set</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_IRQ_CH3</name>
	<description>0: IRQ on channel 3 is not set
1: IRQ on channel 3 is set</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_IRQ_CH2</name>
	<description>0: IRQ on channel 2 is not set
1: IRQ on channel 2 is set</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_IRQ_CH1</name>
	<description>0: IRQ on channel 1 is not set
1: IRQ on channel 1 is set</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_IRQ_CH0</name>
	<description>0: IRQ on channel 0 is not set
1: IRQ on channel 0 is set</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>DMA_REQ_MUX_REG</name>
	<description>DMA channels peripherals mapping register</description>
	<addressOffset>0x00000100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000ffff</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DMA67_SEL</name>
	<description>Select which combination of peripherals are mapped on the DMA channels. The peripherals are mapped as pairs on two channels.
The first DMA request is mapped on channel 6 and the second on channel 7. Please refer to the description of DMA01_SEL bit-field for the exact peripherals' mapping.
NOTE: When channel DMA7 is configured as secure channel, it cannot support any peripheral requests, since DREQ_MODE is disabled automatically, overruling the corresponding bit-field of DMA7_CTRL_REG.</description>
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA45_SEL</name>
	<description>Select which combination of peripherals are mapped on the DMA channels. The peripherals are mapped as pairs on two channels.
The first DMA request is mapped on channel 4 and the second on channel 5. Please refer to the description of DMA01_SEL bit-field for the exact peripherals' mapping.</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA23_SEL</name>
	<description>Select which combination of peripherals are mapped on the DMA channels. The peripherals are mapped as pairs on two channels.
The first DMA request is mapped on channel 2 and the second on channel 3. Please refer to the description of DMA01_SEL bit-field for the exact peripherals' mapping.</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA01_SEL</name>
	<description>Select which combination of peripherals are mapped on the DMA channels. The peripherals are mapped as pairs on two channels.
The first DMA request is mapped on channel 0 and the second on channel 1 and the peripherals supported are listed below. Note that in the following list, the &quot;rx&quot; implies a Peripheral-to-Memory transfer and the &quot;tx&quot; a Memory-to-Peripheral transfer.
0x0: SPI_rx / SPI_tx
0x1: SP2_rx / SPI2_tx
0x2: UART_rx / UART_tx
0x3: UART2_rx / UART2_tx
0x4: I2C_rx / I2C_tx
0x5: I2C2_rx / I2C2_tx
0x6: USB_rx / USB_tx
0x7: UART3_rx / UART3_tx
0x8: PCM / PCM
0x9: SRC_rx / SRC_tx
0xA: SPI3_rx / SPI3_tx
0xB: I2C3_rx / I2C3_tx
0xC: GP_ADC / APP_ADC
0xD: SRC2_rx / SRC2_tx
0xE: I3C_rx / I3C_tx
0xF: None

NOTE: If any of the two available peripheral selector fields (DMA01_SEL, DMA23_SEL) have the same value, the lesser significant selector has higher priority and will control the DMA acknowledge signal driven to the selected peripheral. Hence, if DMA01_SEL = DMA23_SEL, the channels 0 and 1 will provide the Rx and Tx DMA acknowledge signals for the selected peripheral.
Consequently, it is suggested to assign the intended peripheral value to a unique selector field. Exception is the SRC, for which the mapping of the same peripheral option to more than one channel pairs may be intended (e.g. for stereo mode).</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>DMA_RESET_INT_MASK_REG</name>
	<description>DMA Reset Interrupt mask register</description>
	<addressOffset>0x00000114</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>DMA_RESET_IRQ_ENABLE7</name>
	<description>Writing a '1' will disable the IRQs in the DMA channel 7, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_RESET_IRQ_ENABLE6</name>
	<description>Writing a '1' will disable the IRQs in the DMA channel 6, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_RESET_IRQ_ENABLE5</name>
	<description>Writing a '1' will disable the IRQs in the DMA channel 5, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_RESET_IRQ_ENABLE4</name>
	<description>Writing a '1' will disable the IRQs in the DMA channel 4, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_RESET_IRQ_ENABLE3</name>
	<description>Writing a '1' will disable the IRQs in the DMA channel 3, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_RESET_IRQ_ENABLE2</name>
	<description>Writing a '1' will disable the IRQs in the DMA channel 2, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_RESET_IRQ_ENABLE1</name>
	<description>Writing a '1' will disable the IRQs in the DMA channel 1, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_RESET_IRQ_ENABLE0</name>
	<description>Writing a '1' will disable the IRQs in the DMA channel 0, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-writeOnce</access>
	</field></fields>
</register><register>
	<name>DMA_SET_INT_MASK_REG</name>
	<description>DMA Set Interrupt mask register</description>
	<addressOffset>0x00000110</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>DMA_SET_IRQ_ENABLE7</name>
	<description>Writing a '1' will enable the IRQs in the DMA channel 7, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_SET_IRQ_ENABLE6</name>
	<description>Writing a '1' will enable the IRQs in the DMA channel 6, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_SET_IRQ_ENABLE5</name>
	<description>Writing a '1' will enable the IRQs in the DMA channel 5, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_SET_IRQ_ENABLE4</name>
	<description>Writing a '1' will enable the IRQs in the DMA channel 4, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_SET_IRQ_ENABLE3</name>
	<description>Writing a '1' will enable the IRQs in the DMA channel 3, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_SET_IRQ_ENABLE2</name>
	<description>Writing a '1' will enable the IRQs in the DMA channel 2, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_SET_IRQ_ENABLE1</name>
	<description>Writing a '1' will enable the IRQs in the DMA channel 1, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-writeOnce</access>
	</field><field>
	<name>DMA_SET_IRQ_ENABLE0</name>
	<description>Writing a '1' will enable the IRQs in the DMA channel 0, writing a '0' has no effect. Reading returns always '0'.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-writeOnce</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>EMMC</name>
	<version>1.0</version>
	<description>EMMC registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x30058000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>3952</size>
	<usage>registers</usage>
</addressBlock>
	
