honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
Values:
0x0 (NO_RESP): No Response
0x1 (RESP_LEN_136): Response Length 136
0x2 (RESP_LEN_48): Response Length 48
0x3 (RESP_LEN_48B): Response Length 48; Check
Busy after response
</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_CQCAP_REG</name>
	<description>This register indicates the capabilities of the command queuing engine.</description>
	<addressOffset>0x00000184</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000030c8</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>CRYPTO_SUPPORT</name>
	<description>Crypto Support   
This bit indicates whether the Host Controller supports cryptographic operations.
Values:
0x0 (FALSE): Crypto not Supported
0x1 (TRUE): Crypto Supported</description>
	<bitRange>[28:28]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CQCCAP_RSVD2</name>
	<description>These bits [27:16] of the CQCAP register are reserved. They always return 0.
</description>
	<bitRange>[27:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ITCFMUL</name>
	<description>Internal Timer Clock Frequency Multiplier (ITCFMUL)
This field indicates the frequency of the clock used for interrupt coalescing timer and for
determining the SQS polling period. See ITCFVAL definition for details. Values 0x5 to 0xF are reserved.
Values:
0x0 (CLK_1KHz): 1KHz clock
0x1 (CLK_10KHz): 10KHz clock
0x2 (CLK_100KHz): 100KHz clock
0x3 (CLK_1MHz): 1MHz clock
0x4 (CLK_10MHz): 10MHz clock</description>
	<bitRange>[15:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>ITCFVAL</name>
	<description>Internal Timer Clock Frequency Value (ITCFVAL)
This field scales the frequency of the timer clock provided by ITCFMUL. The Final clock frequency of actual timer clock is calculated as ITCFVAL* ITCFMUL.
</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_CTRL_R_REG</name>
	<description>This register is used to control the operation of EMMC Controller.</description>
	<addressOffset>0x00000508</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000001</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields><field>
	<name>SW_CG_DIS</name>
	<description>Internal clock gating disable control
This bit must be used to disable IP's internal clock gating when required. when disabled clocks are not gated. Clocks to the core (except hclk) must be stopped when programming this bit.
Values:
0x0 (ENABLE): Internal clock gates are active and clock gating is controlled internally
0x1 (DISABLE): Internal clock gating is disabled, clocks are not gated internally</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_CONFLICT_CHECK</name>
	<description>Command conflict check
This bit enables command conflict check.
Note:emmc controller monitors the CMD line whenever a command is issued and checks whether the value driven on sd_cmd_out matches the value on sd_cmd_in at next subsequent edge
of cclk_tx to determine command conflict error. This bit is cleared only if the feed back delay (including IO Pad delay) is more than (t_card_clk_period - t_setup), where t_setup is the setup time of
a flop in emmc. The I/O pad delay is consistent across CMD and DATA lines, and it is within the value:
(2*t_card_clk_period - t_setup)  
Values:
0x0 (DISABLE_CMD_CONFLICT_CHK): Disable command conflict check
0x1 (CMD_CONFLICT_CHK_LAT1): Check for command conflict after 1 card clock cycle</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_CURR_CAPABILITIES1_R_REG</name>
	<description>This register indicate the maximum current capability for each voltage, for VDD1. The value is meaningful if the Voltage Suppor</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>MAX_CUR_18V</name>
	<description>Maximum Current for 1.8V
This bit specifies the Maximum Current for 1.8V VDD1 power supply for the card.
- 0: Get information through another method
- 1: 4mA
- 2: 8mA
- 3: 13mA
- .......
- 255: 1020mA</description>
	<bitRange>[23:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MAX_CUR_30V</name>
	<description>Maximum Current for 3.0V
This bit specifies the Maximum Current for 3.0V VDD1 power supply for the card.
- 0: Get information through another method
- 1: 4mA
- 2: 8mA
- 3: 13mA
- .......
- 255: 1020mA</description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>MAX_CUR_33V</name>
	<description>Maximum Current for 3.3V
This bit specifies the Maximum Current for 3.3V VDD1 power supply for the card.
- 0: Get information through another method
- 1: 4mA
- 2: 8mA
- 3: 13mA
- .......
- 255: 1020mA</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_CURR_CAPABILITIES2_R_REG</name>
	<description>This register indicates the maximum current capability for each voltage (for VDD2). The value is meaningful if Voltage Support </description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>MAX_CUR_VDD2_18V</name>
	<description>Maximum Current for 1.8V VDD2
This bit specifies the Maximum Current for 1.8V VDD2 power supply for the UHS-II card.
- 0: Get information through another method
- 1: 4mA
- 2: 8mA
- 3: 13mA
- .......
- 255: 1020mA</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_EMBEDDED_CTRL_R_REG</name>
	<description>This register controls the embedded device. When the Host Controller is connected to a removable device, this register is not u</description>
	<addressOffset>0x00000f6c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>BACK_END_PWR_CTRL</name>
	<description>Back-End Power Control (SD Mode)

Each bit of this field controls back-end power supply for an embedded device.
- 0 : Back-End Power is off
- 1 : Back-End Power is supplied

D24 : Back-End Power for Device 1

