honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
D25 : Back-End Power for Device 2

D26 : Back-End Power for Device 3

D27 : Back-End Power for Device 4

D28 : Back-End Power for Device 5

D29 : Back-End Power for Device 6

D30 : Back-End Power for Device 7
</description>
	<bitRange>[30:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INT_PIN_SEL</name>
	<description>Interrupt Pin Select

These bits enable the interrupt pin inputs.
- 000 : Interrupts (INT_A,INT_B,INT_C) are disabled
- xx1 : INT_A is enabled
- x1x : INT_B is enabled
- 1xx : INT_C is enabled</description>
	<bitRange>[22:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CLK_PIN_SEL</name>
	<description>Clock Pin Select (SD Mode)

This bit is selected by one of clock pin outputs.
- 0x0 : Clock pins are disabled
- 0x1 : CLK[1] is selected
- 0x2 : CLK[2] is selected
-  .      . 
-  .      . 
-  .      . 
- 0x7 : CLK[7] is selected
</description>
	<bitRange>[18:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUS_WIDTH_PRESET</name>
	<description>Bus Width Preset (SD Mode)

Each bit of this field specifies the bus width for each embedded device. The shared bus supports mixing of 4-bit and 8-bit bus width devices.
- D08 : Bus Width Preset for Device 1
- D09 : Bus Width Preset for Device 2
- D10 : Bus Width Preset for Device 3
- D11 : Bus Width Preset for Device 4
- D12 : Bus Width Preset for Device 5
- D13 : Bus Width Preset for Device 6
- D14 : Bus Width Preset for Device 7

Function of each bit is defined as follows:
- 0 : 4-bit bus width mode
- 1 : 8-bit bus width mode
</description>
	<bitRange>[14:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>NUM_INT_PIN</name>
	<description>Number of Interrupt Input Pins

This field indicates support of interrupt input pins for an embedded system.
</description>
	<bitRange>[5:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>NUM_CLK_PIN</name>
	<description>Number of Clock Pins (SD Mode)

This field indicates support of clock pins to select one of devices for shared bus system. Up to 7 clock pins can be supported.
- 0x0 : Shared bus is not supported
- 0x1 : 1 SDCLK is supported
- 0x2 - 2 SDCLK is supported
-  .    .
-  .    .
-  .    .
- 0x7 : 7 SDCLK is supported
</description>
	<bitRange>[2:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_EMMC_CTRL_R_REG</name>
	<description>This register is used to control the eMMC operation.</description>
	<addressOffset>0x0000052c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000000c</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>EMMC_RST_N_OE</name>
	<description>Output Enable control for EMMC Device Reset signal PAD control.
This field drived sd_rst_n_oe output ofemmc
Values:
0x1 (ENABLE): sd_rst_n_oe is 1
0x0 (DISABLE): sd_rst_n_oe is 0</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EMMC_RST_N</name>
	<description>EMMC Device Reset signal control.
This register field controls the sd_rst_n output of emmc
Values:
0x1 (RST_DEASSERT): Reset to eMMC device is deasserted
0x0 (RST_ASSERT): Reset to eMMC device asserted (active low)</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DISABLE_DATA_CRC_CHK</name>
	<description>Disable Data CRC Check
This bit controls masking of CRC16 error for Card Write in eMMC mode. This is useful in bus testing (CMD19) for an eMMC device. In bus testing, an eMMC card does not send CRC status for a block, which may generate CRC error. This CRC error can be masked using this bit during bus testing.
Values:
0x1 (DISABLE): DATA CRC check is disabled
0x0 (ENABLE): DATA CRC check is enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_IS_EMMC</name>
	<description>eMMC Card present
This bit indicates the type of card connected. An application program this bit based on the card connected to MSHC.
Values:
0x1 (EMMC_CARD): Card connected to IP is an eMMC card
0x0 (NON_EMMC_CARD): Card connected to IP is a non-eMMC card</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_ERROR_INT_SIGNAL_EN_R_REG</name>
	<description>This register is used to select the interrupt status that is notified to the Host System as an interrupt. All these status bits</description>
	<addressOffset>0x0000003a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VENDOR_ERR_SIGNAL_EN3</name>
	<description>The 16th bit of Error Interrupt Signal Enable is reserved.
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VENDOR_ERR_SIGNAL_EN2</name>
	<description>The 15th bit of Error Interrupt Signal Enable is reserved.
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VENDOR_ERR_SIGNAL_EN1</name>
	<description>The 14th bit of Error Interrupt Signal Enable is reserved.
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOT_ACK_ERR_SIGNAL_EN</name>
	<description>Boot Acknowledgment Error (eMMC Mode only).
Setting this bit to 1 enables generating interrupt signal when Boot Acknowledgement Error in Error Interrupt Status register is set.
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESP_ERR_SIGNAL_EN</name>
	<description>Response Error Signal Enable (SD Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TUNING_ERR_SIGNAL_EN</name>
	<description>Tuning Error Signal Enable (UHS-I Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADMA_ERR_SIGNAL_EN</name>
	<description>ADMA Error Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AUTO_CMD_ERR_SIGNAL_EN</name>
	<description>Auto CMD Error Signal Enable (SD/eMMC Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CUR_LMT_ERR_SIGNAL_EN</name>
	<description>Current Limit Error Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DATA_END_BIT_ERR_SIGNAL_EN</name>
	<description>Data End Bit Error Signal Enable (SD/eMMC Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DATA_CRC_ERR_SIGNAL_EN</name>
	<description>Data CRC Error Signal Enable (SD/eMMC Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DATA_TOUT_ERR_SIGNAL_EN</name>
	<description>Data Timeout Error Signal Enable (SD/eMMC Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_IDX_ERR_SIGNAL_EN</name>
	<description>Command Index Error Signal Enable (SD/eMMC Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_END_BIT_ERR_SIGNAL_EN</name>
	<description>Command End Bit Error Signal Enable (SD/eMMC Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_CRC_ERR_SIGNAL_EN</name>
	<description>Command CRC Error Signal Enable (SD/eMMC Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_TOUT_ERR_SIGNAL_EN</name>
	<description>Command Timeout Error Signal Enable (SD/eMMC Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_ERROR_INT_STAT_EN_R_REG</name>
	<description>This register sets the Interrupt Status for Error Interrupt Status register (ERROR_INT_STAT_R), when ERROR_INT_STAT_EN_R is set</description>
	<addressOffset>0x00000036</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VENDOR_ERR_STAT_EN3</name>
	<description>The 15th bit of Error Interrupt Status Enable register is reserved.
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VENDOR_ERR_STAT_EN2</name>
	<description>The 14th bit of Error Interrupt Status Enable register is reserved.
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>VENDOR_ERR_STAT_EN1</name>
	<description>The 13th bit of Error Interrupt Status Enable register is reserved.
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BOOT_ACK_ERR_STAT_EN</name>
	<description>Boot Acknowledgment Error (eMMC Mode only)
Setting this bit to 1 enables setting of Boot Acknowledgment Error in Error Interrupt Status register (ERROR_INT_STAT_R).

Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESP_ERR_STAT_EN</name>
	<description>Response Error Status Enable (SD Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TUNING_ERR_STAT_EN</name>
	<description>Tuning Error Status Enable (UHS-I Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADMA_ERR_STAT_EN</name>
	<description>ADMA Error Status Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AUTO_CMD_ERR_STAT_EN</name>
	<description>Auto CMD Error Status Enable (SD/eMMC Mode only).
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CUR_LMT_ERR_STAT_EN</name>
	<description>Current Limit Error Status Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DATA_END_BIT_ERR_STAT_EN</name>
	<description>Data End Bit Error Status Enable (SD/eMMC Mode only).
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DATA_CRC_ERR_STAT_EN</name>
	<description>Data CRC Error Status Enable (SD/eMMC Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DATA_TOUT_ERR_STAT_EN</name>
	<description>Data Timeout Error Status Enable (SD/eMMC Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_IDX_ERR_STAT_EN</name>
	<description>Command Index Error Status Enable (SD/eMMC Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_END_BIT_ERR_STAT_EN</name>
	<description>Command End Bit Error Status Enable (SD/eMMC Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_CRC_ERR_STAT_EN</name>
	<description>Command CRC Error Status Enable (SD/eMMC Mode only)
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_TOUT_ERR_STAT_EN</name>
	<description>Command Timeout Error Status Enable (SD/eMMC Mode only).
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_ERROR_INT_STAT_R_REG</name>
	<description>This register enables an interrupt when the Error Interrupt Status Enable is enabled and at least one of the statuses is set to</description>
	<addressOffset>0x00000032</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>BOOT_ACK_ERR</name>
	<description>Boot Acknowledgement Error.
This bit is set when there is a timeout for boot acknowledgement or when detecting boot ack status having a value other than 010. This is applicable only when boot acknowledgement is expected in eMMC mode.

Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESP_ERR</name>
	<description>Response Error.
Host Controller Version 4.00 supports response error check function to avoid overhead of response error check by Host Driver during DMA execution. If Response Error Check Enable is set to 1 in the Transfer Mode register, Host Controller Checks R1 or R5 response. If an error is detected in a response, this bit is set to 1.This is applicable in SD/eMMC mode.

Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TUNING_ERR</name>
	<description>Tuning Error.
This bit is set when an unrecoverable error is detected in a tuning circuit except during the tuning procedure (occurrence of an error during tuning procedure is indicated by Sampling Clock Select in the Host Control 2 register). By detecting Tuning Error, Host Driver needs to abort a command executing and perform tuning. To reset tuning circuit, Sampling Clock Select is set to 0 before executing tuning procedure. The Tuning Error is higher priority than the other error interrupts generated during data transfer. By detecting Tuning Error, the Host Driver must discard data transferred by a current read/write command and retry data transfer after the Host Controller retrieved from the tuning circuit error. This is applicable in SD/eMMC mode.

Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADMA_ERR</name>
	<description>ADMA Error.
This bit is set when the Host Controller detects error during ADMA-based data transfer. The error could be due to following reasons:
- Error response received from System bus (Master I/F)
- ADMA3,ADMA2 Descriptors invalid
- CQE Task or Transfer descriptors invalid
When the error occurs, the state of the ADMA is saved in the ADMA Error Status register.
In eMMC CQE mode:
The Host Controller generates this Interrupt when it detects an invalid descriptor data (Valid=0) at the ST_FDS state. ADMA Error State in the ADMA Error Status indicates that an error has occurred in ST_FDS state. The Host Driver may find that Valid bit is not set at the error descriptor.

Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AUTO_CMD_ERR</name>
	<description>Auto CMD Error.
This error status is used by Auto CMD12 and Auto CMD23 in SD/eMMC mode. This bit is set when detecting that any of the bits D00 to D05 in Auto CMD Error Status register has changed from 0 to 1. D07 is effective in case of Auto CMD12. Auto CMD Error Status register is valid while this bit is set to 1 and may be cleared by clearing of this bit.

Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CUR_LMT_ERR</name>
	<description>Current Limit Error.
By setting the SD Bus Power bit in the Power Control register, the Host Controller is requested to supply power for the SD Bus. If the Host Controller supports the Current Limit function, it can
be protected from an illegal card by stopping power supply to the card in which case this bit indicates a failure status. A reading of 1 for this bit means that the Host Controller is not supplying
power to the SD card due to some failure. A reading of 0 for this bit means that the Host Controller is supplying power and no error has occurred. The Host Controller may require some sampling time to
detect the current limit.emmc Host Controller does not support this function, this bit is always set to 0.

Values:
0x0 (FALSE): No error
0x1 (TRUE): Power Fail</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DATA_END_BIT_ERR</name>
	<description>Data End Bit Error.
This error occurs in SD/eMMC mode either when detecting 0 at the end bit position of read data that uses the DAT line or at the end bit position of the CRC status.

Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DATA_CRC_ERR</name>
	<description>Data CRC Error.
This error occurs in SD/eMMC mode when detecting CRC error when transferring read data which uses the DAT line, when detecting the Write CRC status having a value of other than 010 or when write CRC status timeout.

Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DATA_TOUT_ERR</name>
	<description>Data Timeout Error.
This bit is set in SD/eMMC mode when detecting one of the following timeout conditions:
- Busy timeout for R1b, R5b type
- Busy timeout after Write CRC status
- Write CRC Status timeout
- Read Data timeout

Values:
0x0 (FALSE): No error
0x1 (TRUE): Time out</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_IDX_ERR</name>
	<description>Command Index Error.
This bit is set if a Command Index error occurs in the command respons in SD/eMMC mode.

Values:
0x0 (FALSE): No error
0x1 (TRUE): Error</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_END_BIT_ERR</name>
	<description>Command End Bit Error.
This bit is set when detecting that the end bit of a command response is 0 in SD/eMMC mode. 

Values:
0x0 (FALSE): No error
0x1 (TRUE): End Bit error generated</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_CRC_ERR</name>
	<description>Command CRC Error.
Command CRC Error is generated in SD/eMMC mode for following two cases.
- If a response is returned and the Command Timeout Error is set to 0 (indicating no timeout), this bit is set to 1 when detecting a CRC error in the command response.
- The Host Controller detects a CMD line conflict by monitoring the CMD line when a command is issued. If the Host Controller drives the CMD line to 1 level, but detects 0 level on the CMD line at the next SD clock edge, then the Host Controller aborts the command (stop driving CMD line) and set this bit to 1. The Command Timeout Error is also set to 1 to distinguish a CMD line conflict.

Values:
0x0 (FALSE): No error
0x1 (TRUE): CRC error generated</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_TOUT_ERR</name>
	<description>Command Timeout Error.
In SD/eMMC Mode,this bit is set only if no response is returned within 64 SD clock cycles from the end bit of the command. If the Host Controller detects a CMD line conflict, along with Command CRC Error bit, this bit is set to 1, without waiting for 64 SD/eMMC card clock cycles.

