honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
Values:
0x0 (FALSE): No error
0x1 (TRUE): Time out</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_FORCE_AUTO_CMD_STAT_R_REG</name>
	<description>The register is not a physically implemented but is an address at which the Auto CMD Error Status register can be written.This </description>
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>FORCE_CMD_NOT_ISSUED_AUTO_CMD12</name>
	<description>Force Event for Command Not Issued By Auto CMD12 Error
Values:
0x1 (TRUE): Command Not Issued By Auto CMD12 Error Status is set
0x0 (FALSE): Not Affected</description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_AUTO_CMD_RESP_ERR</name>
	<description>Force Event for Auto CMD Response Error
Values:
0x1 (TRUE): Auto CMD Response Error Status is set
0x0 (FALSE): Not Affected</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_AUTO_CMD_IDX_ERR</name>
	<description>Force Event for Auto CMD Index Error
Values:
0x1 (TRUE): Auto CMD Index Error Status is set
0x0 (FALSE): Not Affected</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_AUTO_CMD_EBIT_ERR</name>
	<description>Force Event for Auto CMD End Bit Error
Values:
0x1 (TRUE): Auto CMD End Bit Error Status is set
0x0 (FALSE): Not Affected</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_AUTO_CMD_CRC_ERR</name>
	<description>Force Event for Auto CMD CRC Error
Values:
0x1 (TRUE): Auto CMD CRC Error Status is set
0x0 (FALSE): Not Affected</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_AUTO_CMD_TOUT_ERR</name>
	<description>Force Event for Auto CMD Timeout Error
Values:
0x1 (TRUE): Auto CMD Timeout Error Status is set
0x0 (FALSE): Not Affected</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_AUTO_CMD12_NOT_EXEC</name>
	<description>Force Event for Auto CMD12 Not Executed
Values:
0x1 (TRUE): Auto CMD12 Not Executed Status is set
0x0 (FALSE): Not Affected</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>EMMC_FORCE_ERROR_INT_STAT_R_REG</name>
	<description>This register is not physically implemented but is an address at which the Error Interrupt Status register can be written. The </description>
	<addressOffset>0x00000052</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>FORCE_VENDOR_ERR3</name>
	<description>This bit (FORCE_VENDOR_ERR3) of the FORCE_ERROR_INT_STAT_R register is reserved. It always returns 0.
</description>
	<bitRange>[15:15]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_VENDOR_ERR2</name>
	<description>This bit (FORCE_VENDOR_ERR2) of the FORCE_ERROR_INT_STAT_R register is reserved. It always returns 0.
</description>
	<bitRange>[14:14]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_VENDOR_ERR1</name>
	<description>This bit (FORCE_VENDOR_ERR1) of the FORCE_ERROR_INT_STAT_R register is reserved. It always returns 0.
</description>
	<bitRange>[13:13]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_BOOT_ACK_ERR</name>
	<description>Force Event for Boot Ack error
Values:

0x0 (FALSE): Not Affected
0x1 (TRUE): Boot ack Error Status is set</description>
	<bitRange>[12:12]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_RESP_ERR</name>
	<description>Force Event for Response Error (SD Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Response Error Status is set</description>
	<bitRange>[11:11]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_TUNING_ERR</name>
	<description>Force Event for Tuning Error (UHS-I Mode only)
</description>
	<bitRange>[10:10]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_ADMA_ERR</name>
	<description>Force Event for ADMA Error
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): ADMA Error Status is set</description>
	<bitRange>[9:9]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_AUTO_CMD_ERR</name>
	<description>Force Event for Auto CMD Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): ADMA Error Status is set</description>
	<bitRange>[8:8]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_CUR_LMT_ERR</name>
	<description>Force Event for Current Limit Error
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Current Limit Error Status is set</description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_DATA_END_BIT_ERR</name>
	<description>Force Event for Data End Bit Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Data End Bit Error Status is set</description>
	<bitRange>[6:6]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_DATA_CRC_ERR</name>
	<description>Force Event for Data CRC Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Data CRC Error Status is set</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_DATA_TOUT_ERR</name>
	<description>Force Event for Data Timeout Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Data Timeout Error Status is set</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_CMD_IDX_ERR</name>
	<description>Force Event for Command Index Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Command Index Error Status is set</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_CMD_END_BIT_ERR</name>
	<description>Force Event for Command End Bit Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Command End Bit Error Status is set</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_CMD_CRC_ERR</name>
	<description>Force Event for Command CRC Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Command CRC Error Status is set</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>FORCE_CMD_TOUT_ERR</name>
	<description>Force Event for Command Timeout Error (SD/eMMC Mode only)
Values:
0x0 (FALSE): Not Affected
0x1 (TRUE): Command Timeout Error Status is set</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>EMMC_HOST_CNTRL_VERS_R_REG</name>
	<description>This register is used to indicate the Host Controller Version number.</description>
	<addressOffset>0x000000fe</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000005</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>VENDOR_VERSION_NUM</name>
	<description>Vendor Version Number             

This field is reserved for the vendor version number. Host Driver must not use this status.
</description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SPEC_VERSION_NUM</name>
	<description>Specification Version Number
These bits indicate the Host controller specification version. The upper and lower 4-bits indicate the version. Values 0x06-0xFF are reserved.
Values:
0x0 (VER_1_00): SD Host Controller Specification Version 1.00
0x1 (VER_2_00): SD Host Controller Specification Version 2.00
0x2 (VER_3_00): SD Host Controller Specification Version 3.00
0x3 (VER_4_00): SD Host Controller Specification Version 4.00
0x4 (VER_4_10): SD Host Controller Specification Version 4.10
0x5 (VER_4_20): SD Host Controller Specification Version 4.20</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_HOST_CTRL1_R_REG</name>
	<description>This register is used to control the operation of the Host Controller. This register is applicable for an SD/eMMC/UHS-II mode.</description>
	<addressOffset>0x00000028</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>CARD_DETECT_SIG_SEL</name>
	<description>Card Detect Signal Selection.
This bit selects a source for card detection. When the source for the card detection is switched, the interrupt must be disabled during the switching period.

Values:
0x1 (CARD_DT_TEST_LEVEL): Card Detect Test Level is selected (for test purpose)
0x0 (SDCD_PIN): SDCD# (card_detect_n signal) is selected (for normal use)</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_DETECT_TEST_LVL</name>
	<description>Card Detect Test Level.
This bit is enabled while the Card Detect Signal Selection is set to 1 and it indicates whether a card inserted or not.

Values:
0x1 (CARD_INSERTED): Card Inserted
0x0 (No_CARD): No Card</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EXT_DAT_XFER</name>
	<description>Extended Data Transfer Width.
This bit controls 8-bit bus width mode of embedded device.

Values:
0x1 (EIGHT_BIT): 8-bit Bus Width
0x0 (DEFAULT): Bus Width is selected by the Data Transfer Width</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_SEL</name>
	<description>DMA Select.
This field is used to select the DMA type.
When Host Version 4 Enable is 1 in Host Control 2 register:
- 0x0 : SDMA is selected
- 0x1 : Reserved
- 0x2 : ADMA2 is selected
- 0x3 : ADMA2 or ADMA3 is selected
When Host Version 4 Enable is 0 in Host Control 2 register:
- 0x0 : SDMA is selected
- 0x1 : Reserved
- 0x2 : 32-bit Address ADMA2 is selected
- 0x3 : 64-bit Address ADMA2 is selected

Values:
0x0 (SDMA): SDMA is selected
0x1 (RSVD_BIT): Reserved
0x2 (ADMA2): ADMA2 is selected
0x3 (ADMA2_3): ADMA2 or ADMA3 is selected</description>
	<bitRange>[4:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HIGH_SPEED_EN</name>
	<description>High Speed Enable (SD/eMMC Mode only).
In SD/eMMC mode, this bit is used to determine the selection of preset value for High Speed mode.
Before setting this bit, the Host Driver checks the High Speed Support in the Capabilities register.
Note:emmc always outputs the sd_cmd_out and sd_dat_out lines at the rising edge of cclk_tx clock irrespective of this bit.Please refer the section Connecting the Clock IO interface  in the Mobile Storage Host Controller user guide on clocking requirement for an SD/eMMC card.

Values:
0x1 (HIGH_SPEED): High Speed mode
0x0 (NORMAL_SPEED): Normal Speed mode</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DAT_XFER_WIDTH</name>
	<description>Data Transfer Width.
For SD/eMMC mode,this bit selects the data transfer width of the Host Controller. The Host Driver sets it to match the data width of the SD/eMMC card.

Values:
0x1 (FOUR_BIT): 4-bit mode
0x0 (ONE_BIT): 1-bit mode</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>LED_CTRL</name>
	<description>LED Control.
This bit is used to caution the user not to remove the card while the SD card is being accessed. The value is reflected on the led_control signal.

Values:
0x0 (OFF): LED off
0x1 (ON): LED on</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_HOST_CTRL2_R_REG</name>
	<description>This register is used to control how the Host Controller operates. This register is applicable for an SD/eMMC/UHS-II mode.</description>
	<addressOffset>0x0000003e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>PRESET_VAL_ENABLE</name>
	<description>Preset Value Enable
This bit enables automatic selection of SDCLK frequency and Driver strength Preset Value registers. When Preset Value Enable is set, SDCLK frequency generation (Frequency Select and Clock Generator
Select) and the driver strength selection are performed by the controller. These values are selected from set of Preset Value registers based on selected speed mode.
Values:
0x0 (FALSE): SDCLK and Driver Strength are controlled by Host Driver
0x1 (TRUE): Automatic Selection by Preset Value are Enabled</description>
	<bitRange>[15:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ASYNC_INT_ENABLE</name>
	<description>Asynchronous Interrupt Enable
This bit can be set if a card supports asynchronous interrupts and Asynchronous Interrupt Support is set to 1 in the Capabilities register.
Values:
0x0 (FALSE): Disabled
0x1 (TRUE): Enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADDRESSING</name>
	<description>64-bit Addressing
This bit is effective when Host Version 4 Enable is set to 1.
Values:
0x0 (FALSE): 32 bits addressing
0x1 (TRUE): 64 bits addressing</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HOST_VER4_ENABLE</name>
	<description>Host Version 4 Enable
This bit selects either Version 3.00 compatible mode or Version 4 mode.
Functions of following fields are modified for Host Version 4 mode:
- SDMA Address: SDMA uses ADMA System Address (05Fh-058h) instead of SDMA System Address register (003h-000h)
- ADMA2/ADMA3 selection: ADMA3 is selected by DMA select in Host Control 1 register
- 64-bit ADMA Descriptor Size: 128-bit descriptor is used instead of 96-bit descriptor when 64-bit Addressing is set to 1
- Selection of 32-bit/64-bit System Addressing: Either 32-bit or 64-bit system addressing is selected by 64-bit Addressing bit in this register
- 32-bit Block Count: SDMA System Address register (003h-000h) is modified to 32-bit Block Count register
Note: It is recommended not to program ADMA3 Integrated Descriptor Address registers, UHS-II registers and Command Queuing registers (if applicable) while operating in Host version less than 4 mode (Host Version 4 Enable = 0).
Values:
0x0 (FALSE): Version 3.00 compatible mode
0x1 (TRUE): Version 4 mode</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD23_ENABLE</name>
	<description>CMD23 Enable
If the card supports CMD23, this bit is set to 1. This bit is used to select Auto CMD23 or Auto CMD12 for ADMA3 data transfer.
Values:
0x0 (FALSE): Auto CMD23 is disabled
0x1 (TRUE): Auto CMD23 is enabled</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ADMA2_LEN_MODE</name>
	<description>ADMA2 Length Mode
This bit selects ADMA2 Length mode to be either 16-bit or 26-bit.
Values:
0x0 (FALSE): 16-bit Data Length Mode
0x1 (TRUE): 26-bit Data Length Mode</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UHS2_IF_ENABLE</name>
	<description>UHS-II Interface Enable
This bit is used to enable the UHS-II Interface. The value is reflected on the uhs2_if_en pin.
Values:
0x0 (FALSE): SD/eMMC Interface Enabled
0x1 (TRUE): UHS-II Interface Enabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SAMPLE_CLK_SEL</name>
	<description>Sampling Clock Select
This bit is used by the Host Controller to select the sampling clock in SD/eMMC mode to receive CMD and DAT. This bit is set by the tuning procedure and is valid after the completion of tuning (when Execute Tuning is cleared). Setting this bit to 1 means that tuning is completed successfully and setting this bit to 0 means that tuning has failed. The value is reflected on the sample_cclk_sel pin.
Values:
0x0 (FALSE): Fixed clock is used to sample data
0x1 (TRUE): Tuned clock is used to sample data</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>EXEC_TUNING</name>
	<description>Execute Tuning
This bit is set to 1 to start the tuning procedure in UHS-I/eMMC speed modes and this bit is automatically cleared when tuning procedure is completed.
Values:
0x0 (FALSE): Not Tuned or Tuning completed
0x1 (TRUE): Execute Tuning</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DRV_STRENGTH_SEL</name>
	<description>Driver Strength Select
This bit is used to select the Host Controller output driver in 1.8V signaling UHS-I/eMMC speed modes. The bit depends on setting of Preset Value Enable. The value is reflected on the uhs1_drv_sth pin.
Values:
0x0 (TYPEB): Driver TYPEB is selected
0x1 (TYPEA): Driver TYPEA is selected
0x2 (TYPEC): Driver TYPEC is selected
0x3 (TYPED): Driver TYPED is selected</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SIGNALING_EN</name>
	<description>1.8V Signaling Enable
This bit controls voltage regulator for I/O cell in UHS-I/eMMC speed modes. Setting this bit from 0 to 1 starts changing the signal voltage from 3.3V to 1.8V. Host Controller clears this bit if switching to 1.8 signaling
fails. The value is reflected on the uhs1_swvolt_en pin.
Note: This bit must be set for all UHS-I speed modes (SDR12/SDR25/SDR50/SDR104/DDR50).
Values:
0x0 (V_3_3): 3.3V Signalling
0x1 (V_1_8): 1.8V Signalling</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UHS_MODE_SEL</name>
	<description>UHS Mode/eMMC Speed Mode Select
These bits are used to select UHS mode in the SD mode of operation. In eMMC mode, these bits are used to select eMMC Speed mode.
UHS Mode (SD/UHS-II mode only):
- 0x0: SDR12
- 0x1: SDR25
- 0x2: SDR50
- 0x3: SDR104
- 0x4: DDR50
- 0x5: Reserved
- 0x6: Reserved
- 0x7: UHS-II
eMMC Speed Mode (eMMC mode only):
- 0x0: Legacy
- 0x1: High Speed SDR
- 0x2: Reserved
- 0x3: HS200
- 0x4: High Speed DDR
- 0x5: Reserved
- 0x6: Reserved
- 0x7: HS400
Values:
0x0 (SDR12): SDR12/Legacy
0x1 (SDR25): SDR25/High Speed SDR
0x2 (SDR50): SDR50
0x3 (SDR104): SDR104/HS200
0x4 (DDR50): DDR50/High Speed DDR
0x5 (RSVD5): Reserved
0x6 (RSVD6): Reserved
0x7 (UHS2): UHS-II/HS400</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_MBIU_CTRL_R_REG</name>
	<description>This register is used to select the valid burst types that the AHB Master bus interface can generate. &#13;
When more than one bit </description>
	<addressOffset>0x00000510</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x0000000e</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>BURST_INCR16_EN</name>
	<description>INCR16 Burst
Controls generation of INCR16 transfers on Master interface.
Values:
0x0 (FALSE): AHB INCR16 burst type is not generated on Master I/F
0x1 (TRUE): AHB INCR16 burst type can be generated on Master I/F</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BURST_INCR8_EN</name>
	<description>INCR8 Burst
Controls generation of INCR8 transfers on Master interface.
Values:
0x0 (FALSE): AHB INCR8 burst type is not generated on Master I/F
0x1 (TRUE): AHB INCR8 burst type can be generated on Master I/F</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BURST_INCR4_EN</name>
	<description>INCR4 Burst
Controls generation of INCR4 transfers on Master interface.
Values:
0x0 (FALSE): AHB INCR4 burst type is not generated on Master I/F
0x1 (TRUE): AHB INCR4 burst type can be generated on Master I/F</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>UNDEFL_INCR_EN</name>
	<description>Undefined INCR Burst
Controls generation of undefined length INCR transfer on Master interface.
Values:
0x0 (FALSE): Undefined INCR type burst is the least preferred burst on AHB Master I/F
0x1 (TRUE): Undefined INCR type burst is the most preferred burst on AHB Master I/F</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_NORMAL_INT_SIGNAL_EN_R_REG</name>
	<description>This register is used to select the interrupt status that is indicated to the Host System as the interrupt. All these status bi</description>
	<addressOffset>0x00000038</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CQE_EVENT_SIGNAL_EN</name>
	<description>Command Queuing Engine Event Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FX_EVENT_SIGNAL_EN</name>
	<description>FX Event Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RE_TUNE_EVENT_SIGNAL_EN</name>
	<description>Re-Tuning Event (UHS-I only) Signal Enable.
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INT_C_SIGNAL_EN</name>
	<description>INT_C (Embedded) Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INT_B_SIGNAL_EN</name>
	<description>INT_B (Embedded) Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INT_A_SIGNAL_EN</name>
	<description>INT_A (Embedded) Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_INTERRUPT_SIGNAL_EN</name>
	<description>Card Interrupt Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_REMOVAL_SIGNAL_EN</name>
	<description>Card Removal Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_INSERTION_SIGNAL_EN</name>
	<description>Card Insertion Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUF_RD_READY_SIGNAL_EN</name>
	<description>Buffer Read Ready Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUF_WR_READY_SIGNAL_EN</name>
	<description>Buffer Write Ready Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_INTERRUPT_SIGNAL_EN</name>
	<description>DMA Interrupt Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BGAP_EVENT_SIGNAL_EN</name>
	<description>Block Gap Event Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XFER_COMPLETE_SIGNAL_EN</name>
	<description>Transfer Complete Signal Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_COMPLETE_SIGNAL_EN</name>
	<description>Command Complete Signal Enable
Values:

