honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_NORMAL_INT_STAT_EN_R_REG</name>
	<description>This register enables the Interrupt Status for Normal Interrupt Status register (NORMAL_INT_STAT_R) when NORMAL_INT_STAT_R is s</description>
	<addressOffset>0x00000034</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>CQE_EVENT_STAT_EN</name>
	<description>CQE Event Status Enable

Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FX_EVENT_STAT_EN</name>
	<description>FX Event Status Enable
This bit is added from Version 4.10.

Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RE_TUNE_EVENT_STAT_EN</name>
	<description>Re-Tuning Event (UHS-I only) Status Enable

Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INT_C_STAT_EN</name>
	<description>INT_C (Embedded) Status Enable

If this bit is set to 0, the Host Controller clears the interrupt request to the System. The Host Driver may clear this bit before servicing the INT_C and may set this bit again after all interrupt requests to INT_C pin are cleared to prevent inadvertent interrupts.

Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled
</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INT_B_STAT_EN</name>
	<description>INT_B (Embedded) Status Enable

If this bit is set to 0, the Host Controller clears the interrupt request to the System. The Host Driver may clear this bit before servicing the INT_B and may set this bit again after all interrupt requests to INT_B pin are cleared to prevent inadvertent interrupts.

Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>INT_A_STAT_EN</name>
	<description>INT_A (Embedded) Status Enable

If this bit is set to 0, the Host Controller clears the interrupt request to the System. The Host Driver may clear this bit before servicing the INT_A and may set this bit again after all interrupt requests to INT_A pin are cleared to prevent inadvertent interrupts.

Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_INTERRUPT_STAT_EN</name>
	<description>Card Interrupt Status Enable

If this bit is set to 0, the Host Controller clears the interrupt request to the System. The Card Interrupt detection is stopped when this bit is cleared and restarted when this bit is set to 1. The Host Driver may clear the Card Interrupt Status Enable before servicing the Card Interrupt and may set this bit again after all interrupt requests from the card are cleared to prevent inadvertent interrupts.

By setting this bit to 0, interrupt input must be masked by implementation so that the interrupt input is not affected by external signal in any state (for example, floating).

Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_REMOVAL_STAT_EN</name>
	<description>Card Removal Status Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_INSERTION_STAT_EN</name>
	<description>Card Insertion Status Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUF_RD_READY_STAT_EN</name>
	<description>Buffer Read Ready Status Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUF_WR_READY_STAT_EN</name>
	<description>Buffer Write Ready Status Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_INTERRUPT_STAT_EN</name>
	<description>DMA Interrupt Status Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BGAP_EVENT_STAT_EN</name>
	<description>Block Gap Event Status Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XFER_COMPLETE_STAT_EN</name>
	<description>Transfer Complete Status Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_COMPLETE_STAT_EN</name>
	<description>Command Complete Status Enable
Values:

0x0 (FALSE): Masked
0x1 (TRUE): Enabled</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_NORMAL_INT_STAT_R_REG</name>
	<description>This register reflects the status of the Normal Interrupt. This register is applicable for an SD/eMMC/UHS-II mode.</description>
	<addressOffset>0x00000030</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>ERR_INTERRUPT</name>
	<description>Error Interrupt.
If any of the bits in the Error Interrupt Status register are set, then this bit is set.

Values:
0x0 (FALSE): No Error
0x1 (TRUE): Error</description>
	<bitRange>[15:15]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CQE_EVENT</name>
	<description>Command Queuing Event
This status is set if Command Queuing/Crypto related event has occurred in eMMC/SD mode. Read CQHCI's CQIS/CRNQIS register for more details.

Values:
0x0 (FALSE): No Event
0x1 (TRUE): Command Queuing Event is detected</description>
	<bitRange>[14:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>FX_EVENT</name>
	<description>FX Event.
This status is set when R[14] of response register is set to 1 and Response Type R1/R5 is set to 0 in Transfer Mode register. This interrupt is used with response check function.

Values:
0x0 (FALSE): No Event
0x1 (TRUE): FX Event is detected</description>
	<bitRange>[13:13]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RE_TUNE_EVENT</name>
	<description>Re-tuning Event.
This bit is set if the Re-Tuning Request changes from 0 to 1. Re-Tuning request is not supported.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>INT_C</name>
	<description>INT_C (Embedded).
This bit is set if INT_C is enabled and if INT_C# pin is in low level. The INT_C# pin is not supported.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>INT_B</name>
	<description>INT_B (Embedded).
This bit is set if INT_B is enabled and if INT_B# pin is in low level. The INT_B# pin is not supported.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>INT_A</name>
	<description>INT_A (Embedded).
This bit is set if INT_A is enabled and if INT_A# pin is in low level. The INT_A# pin is not supported.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CARD_INTERRUPT</name>
	<description>Card Interrupt.
This bit reflects the synchronized value of:
- DAT[1] Interrupt Input for SD Mode
- DAT[2] Interrupt Input for UHS-II Mode

Values:
0x0 (FALSE): No Card Interrupt
0x1 (TRUE): Generate Card Interrupt</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CARD_REMOVAL_STAT_R</name>
	<description>Card Removal.
This bit is set if the Card Inserted in the Present State register changes from 1 to 0.

Values:
0x0 (FALSE): Card state stable or Debouncing
0x1 (TRUE): Card Removed</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CARD_INSERTION</name>
	<description>Card Insertion
This bit is set if the Card Inserted in the Present State register changes from 0 to 1.

Values:
0x0 (FALSE): Card state stable or Debouncing
0x1 (TRUE): Card Inserted</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUF_RD_READY</name>
	<description>Buffer Read Ready.
This bit is set if the Buffer Read Enable changes from 0 to 1.

Values:
0x0 (FALSE): Not ready to read buffer
0x1 (TRUE): Ready to read buffer</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BUF_WR_READY</name>
	<description>Buffer Write Ready.
This bit is set if the Buffer Write Enable changes from 0 to 1.

Values:
0x0 (FALSE): Not ready to write buffer
0x1 (TRUE): Ready to write buffer</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_INTERRUPT</name>
	<description>DMA Interrupt.
This bit is set if the Host Controller detects the SDMA Buffer Boundary during transfer. In case of ADMA, by setting the Int field in the descriptor table, the Host controller generates this interrupt. This interrupt is not generated after a Transfer Complete.

Values:
0x0 (FALSE): No DMA Interrupt
0x1 (TRUE): DMA Interrupt is generated</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>BGAP_EVENT</name>
	<description>Block Gap Event.
This bit is set when both read/write transaction is stopped at block gap due to a Stop at Block Gap Request.

Values:
0x0 (FALSE): No Block Gap Event
0x1 (TRUE): Transaction stopped at block gap</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>XFER_COMPLETE</name>
	<description>Transfer Complete.
This bit is set when a read/write transfer and a command with status busy is completed.

Values:
0x0 (FALSE): Not complete
0x1 (TRUE): Command execution is completed</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_COMPLETE</name>
	<description>Command Complete.
In an SD/eMMC Mode, this bit is set when the end bit of a response except for Auto CMD12 and Auto CMD23.
This interrupt is not generated when the Response Interrupt Disable in Transfer Mode Register is set to 1.

