honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
Values:
0x0 (FALSE): No command complete
0x1 (TRUE): Command Complete</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_DDR50_R_REG</name>
	<description>This register defines the Preset Value for DDR50 and High Speed DDR speed modes in the SD and eMMC modes, respectively.</description>
	<addressOffset>0x0000006e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate Driver strength value supported for DDR50 bus speed mode. These bits are meaningless for 3.3V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when Host Controller supports programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
These bits specify a 10-bit preset value that must be set in the SDCLK/RCLK Frequency Select field of the Clock Control register, as described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_DS_R_REG</name>
	<description>This register defines Preset Value for Default Speed mode in SD mode.</description>
	<addressOffset>0x00000062</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate the Driver strength value supported by 1.8V signaling bus speed modes. This field is meaningless for the Default speed mode as it uses 3.3V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when Host Controller supports programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency Select field of the Clock Control register described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_HS_R_REG</name>
	<description>This register defines Preset Value for High Speed mode in SD mode.</description>
	<addressOffset>0x00000064</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate the Driver strength value supported by 1.8V signaling bus speed modes. This field is meaningless for High speed mode as it uses 3.3V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when Host Controller supports programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency Select field of the Clock Control register described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_INIT_R_REG</name>
	<description>This register defines Preset Value for Initialization in SD/eMMC mode.</description>
	<addressOffset>0x00000060</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate that the Driver strength is supported by 1.8V signaling bus speed modes. These bits are meaningless for 3.3V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when the Host Controller supports a programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency Select field of the Clock Control register described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_SDR104_R_REG</name>
	<description>This register defines Preset Value for SDR104 and HS200 speed modes in the SD and eMMC modes, respectively.</description>
	<addressOffset>0x0000006c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate Driver strength value supported for SDR104 bus speed mode. These bits are meaningless for 3.3V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when Host Controller supports programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
These bits specify a 10-bit preset value that must be set in the SDCLK/RCLK Frequency Select field of the Clock Control register described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_SDR12_R_REG</name>
	<description>This register defines Preset Value for SDR12 and Legacy speed mode in SD and eMMC mode respectively.</description>
	<addressOffset>0x00000066</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate the Driver strength value supported for the SDR12 bus speed mode. These bits are meaningless for 3.3V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when Host Controller supports programmable clock generator
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency Select field of the Clock Control register described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_SDR25_R_REG</name>
	<description>This register defines Preset Value for SDR25 and High Speed SDR speed mode in SD and eMMC mode respectively.</description>
	<addressOffset>0x00000068</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate the Driver strength value supported for the SDR25 bus speed mode. These bits are meaningless for 3.3V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when Host Controller supports programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency Select field of the Clock Control register described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_SDR50_R_REG</name>
	<description>This register defines Preset Value for SDR50 speed mode in SD mode.</description>
	<addressOffset>0x0000006a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate Driver strength value supported for SDR50 bus speed mode. These bits are meaningless for 3.3V signaling.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when Host Controller supports programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
10-bit preset value to be set in SDCLK/RCLK Frequency Select field of the Clock Control register described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PRESET_UHS2_R_REG</name>
	<description>This register is used to hold the preset value for UHS-II and HS400 speed modes in the SD and eMMC modes, respectively.</description>
	<addressOffset>0x00000074</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>DRV_SEL_VAL</name>
	<description>Driver Strength Select Value
These bits indicate the Driver strength value supported by 1.8V signaling bus speed modes in the SD mode. This field is meaningless for UHS-II mode. In eMMC mode, these bits can be used for selecting
the Drive strength value for HS400 mode.
Values:
0x0 (TYPEB): Driver Type B is selected
0x1 (TYPEA): Driver Type A is selected
0x2 (TYPEC): Driver Type C is selected
0x3 (TYPED): Driver Type D is selected</description>
	<bitRange>[15:14]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLK_GEN_SEL_VAL</name>
	<description>Clock Generator Select Value
This bit is effective when the Host Controller supports a programmable clock generator.
Values:
0x0 (FALSE): Host Controller Ver2.0 Compatible Clock Generator
0x1 (PROG): Programmable Clock Generator</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FREQ_SEL_VAL</name>
	<description>SDCLK/RCLK Frequency Select Value
These bits specify the 10-bit preset value that must be set in the SDCLK/RCLK Frequency Select field of the Clock Control register, as described by a Host System.</description>
	<bitRange>[9:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PSTATE_REG</name>
	<description>This register indicates the present status of the Host Controller. This register is applicable for an SD/eMMC/UHS-II mode.</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x020c0000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>UHS2_IF_DETECT</name>
	<description>UHS-II Interface Detection.
For SD/eMMC mode, this bit always returns 0.

Values:
0x0 (FALSE): UHS-II interface is not detected
0x1 (TRUE): UHS-II interface is detected
</description>
	<bitRange>[31:31]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>LANE_SYNC</name>
	<description>Lane Synchronization.
For SD/eMMC mode, this bit always returns 0.

Values:
0x0 (FALSE): UHS-II PHY is not initialized
0x1 (TRUE): UHS-II PHY is initialized
</description>
	<bitRange>[30:30]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IN_DORMANT_ST</name>
	<description>In Dormant Status
For SD/eMMC mode, this bit always returns 0.

Values:
0x0 (FALSE): Not in DORMANT state
0x1 (TRUE): In DORMANT state
</description>
	<bitRange>[29:29]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SUB_CMD_STAT</name>
	<description>Sub Command Status.
This bit is used to distinguish between a main command and a sub command status.

Values:
0x0 (FALSE): Main Command Status
0x1 (TRUE): Sub Command Status
</description>
	<bitRange>[28:28]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_ISSUE_ERR</name>
	<description>Command Not Issued by Error.
This bit is set if a command cannot be issued after setting the command register due to an error except the Auto CMD12 error.

Values:
0x0 (FALSE): No error for issuing a command
0x1 (TRUE): Command cannot be issued
</description>
	<bitRange>[27:27]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HOST_REG_VOL</name>
	<description>Host Regulator Voltage Stable.
This bit is used to check whether the host regulator voltage is stable for switching the voltage of UHS-I mode. This bit reflects the synchronized value of the host_reg_vol_stable signal.

Values:
Description
0x0 (FALSE): Host Regulator Voltage is not stable
0x1 (TRUE): Host Regulator Voltage is stable
</description>
	<bitRange>[25:25]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_LINE_LVL</name>
	<description>Command-Line Signal Level.
This bit is used to check the CMD line level to recover from errors and for debugging. These bits reflect the value of the sd_cmd_in signal.</description>
	<bitRange>[24:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DAT_3_0</name>
	<description>DAT[3:0] Line Signal Level.
This bit is used to check the DAT line level to recover from errors and for debugging. These bits reflect the value of the sd_dat_in (lower nibble) signal. </description>
	<bitRange>[23:20]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>WR_PROTECT_SW_LVL</name>
	<description>Write Protect Switch Pin Level.
This bit is supported only for memory and combo cards. This bit reflects the synchronized value of the card_write_prot signal.

Values:
0x0 (FALSE): Write protected
0x1 (TRUE): Write enabled</description>
	<bitRange>[19:19]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CARD_DETECT_PIN_LEVEL</name>
	<description>Card Detect Pin Level.
This bit reflects the inverse synchronized value of the card_detect_n signal.

Values:
0x0 (FALSE): No card present
0x1 (TRUE): Card Present</description>
	<bitRange>[18:18]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CARD_STABLE</name>
	<description>Card Stable.
This bit indicates the stability of the Card Detect Pin Level. A card is not detected if this bit is set to 1 and the value of the CARD_INSERTED bit is 0.

Values:
0x0 (FALSE): Reset or Debouncing
0x1 (TRUE): No Card or Inserted</description>
	<bitRange>[17:17]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CARD_INSERTED</name>
	<description>Card Inserted.
This bit indicates whether a card has been inserted. The Host Controller debounces this signal so that Host Driver need not wait for it to stabilize.

Values:
0x0 (FALSE): Reset, Debouncing, or No card
0x1 (TRUE): Card Inserted</description>
	<bitRange>[16:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUF_RD_ENABLE</name>
	<description>Buffer Read Enable.
This bit is used for non-DMA transfers. This bit is set if valid data exists in the Host buffer.

Values:
0x0 (DISABLED): Read disable
0x1 (ENABLED): Read enable</description>
	<bitRange>[11:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>BUF_WR_ENABLE</name>
	<description>Buffer Write Enable.
This bit is used for non-DMA transfers. This bit is set if space is available for writing data.

Values:
0x0 (DISABLED): Write disable
0x1 (ENABLED): Write enable</description>
	<bitRange>[10:10]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RD_XFER_ACTIVE</name>
	<description>Read Transfer Active.
This bit indicates whether a read transfer is active for SD/eMMC mode.

Values:
0x0 (INACTIVE): No valid data
0x1 (ACTIVE): Transferring data</description>
	<bitRange>[9:9]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>WR_XFER_ACTIVE</name>
	<description>Write Transfer Active.
This status indicates whether a write transfer is active  for SD/eMMC mode.

Values:
0x0 (INACTIVE): No valid data
0x1 (ACTIVE): Transferring data</description>
	<bitRange>[8:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DAT_7_4</name>
	<description>DAT[7:4] Line Signal Level.
This bit is used to check the DAT line level to recover from errors and for debugging. These bits reflect the value of the sd_dat_in (upper nibble) signal.</description>
	<bitRange>[7:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RE_TUNE_REQ</name>
	<description>Re-Tuning Request.
emmc does not generate retuning request. The software must maintain the Retuning timer. </description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DAT_LINE_ACTIVE</name>
	<description>DAT Line Active (SD/eMMC Mode only).
This bit indicates whether one of the DAT lines on the SD/eMMC bus is in use.
In the case of read transactions, this bit indicates whether a read transfer is executing on the SD/eMMC bus.
In the case of write transactions, this bit indicates whether a write transfer is executing on the SD/eMMC bus.
For a command with busy, this status indicates whether the command executing busy is executing on an SD or eMMC bus.

Values:
0x0 (INACTIVE): DAT Line Inactive
0x1 (ACTIVE): DAT Line Active</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_INHIBIT_DAT</name>
	<description>Command Inhibit (DAT).
This bit is applicable for SD/eMMC mode and is generated if either DAT line active or Read transfer active is set to 1.
If this bit is set to 0, it indicates that the Host Controller can issue subsequent SD/eMMC commands.

Values:
0x0 (READY): Can issue command which used DAT line
0x1 (NOT_READY): Cannot issue command which used
DAT line</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_INHIBIT</name>
	<description>Command Inhibit (CMD).
This bit indicates the following :
- SD/eMMC mode: If this bit is set to 0, it indicates that the CMD line is not in use and the Host controller can issue an SD/eMMC command using the CMD line. This bit is set when the command register is written. This bit is cleared when the command response is received. This bit is not cleared by the response of auto CMD12/23 but cleared by the response of read/write command.

Values:
0x0 (READY): Host Controller is ready to issue a command
0x1 (NOT_READY): Host Controller is not ready to issue a command</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>EMMC_PWR_CTRL_R_REG</name>
	<description>This register is used to control the bus power for the Card. This register is applicable for an SD, eMMC, and UHS-II modes.</description>
	<addressOffset>0x00000029</addressOffset>
	<size>8</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>SD_BUS_VOL_VDD2</name>
	<description>SD Bus Voltage Select for VDD2.
This is irrelevant for SD/eMMC card.

Values:
0x7 (NOT_USED7): Not used
0x6 (NOT_USED6): Not used
0x5 (V_1_8): 1.8V
0x4 (V_1_2): Reserved for 1.2V
0x3 (RSVD3): Reserved
0x2 (RSVD2): Reserved
0x1 (RSVD1): Reserved
0x0 (NO_VDD2): VDD2 Not Supported</description>
	<bitRange>[7:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SD_BUS_PWR_VDD2</name>
	<description>SD Bus Power for VDD2.
This is irrelevant for SD/eMMC card.

Values:
0x0 (OFF): Power off
0x1 (ON): Power on</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>SD_BUS_VOL_VDD1</name>
	<description>SD Bus Voltage Select for VDD1/eMMC Bus Voltage Select for VDD.
These bits enable the Host Driver to select the voltage level for an SD/eMMC card. Before setting this register, the Host Driver checks the Voltage Support bits in the Capabilities register.
If an unsupported voltage is selected, the Host System does not supply the SD Bus voltage. The value set in this field is available on the emmc output signal (sd_vdd1_sel), which is used by the voltage switching circuitry.
SD Bus Voltage Select options:
- 0x7 : 3.3V(Typical)
- 0x6 : 3.0V(Typical)
- 0x5 : 1.8V(Typical) for Embedded
- 0x4 : 0x0   - Reserved
eMMC Bus Voltage Select options:
- 0x7 : 3.3V(Typical)
- 0x6 : 1.8V(Typical)
- 0x5 : 1.2V(Typical)
- 0x4 : 0x0   - Reserved

