honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
	<registers>
	<register>
	<name>D2_CACHECTL</name>
	<description>#49: cache control register&#13;

Internal caches can be enabled/disabled and flushed using this register.&#13;
Note that caches will b</description>
	<addressOffset>0x000000c4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields><field>
	<name>D2C_CACHECTL_FLUSH_TX</name>
	<description>Flush texture cache</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_CACHECTL_ENABLE_TX</name>
	<description>Texture cache enable</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_CACHECTL_FLUSH_FB</name>
	<description>Flush framebuffer cache</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_CACHECTL_ENABLE_FB</name>
	<description>Framebuffer cache enable</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_COLKEY</name>
	<description>#58: Color key value&#13;

The R, G and B components of the internal color representation of a texel is compared with the color key</description>
	<addressOffset>0x000000e8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>COLKEY_RGB</name>
	<description>Color Key Value RGB888</description>
	<bitRange>[23:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_COLOR1</name>
	<description>#25: Base color register&#13;

All color registers are *write only*, reading will return undefined results.&#13;
When using textures th</description>
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>COLOR1</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_COLOR2</name>
	<description>#26: Secondary color register&#13;

Secondary color is relevant only when rendering patterns, textures or using&#13;
a D2C_BC2 blendmod</description>
	<addressOffset>0x00000068</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>COLOR2</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_CONTROL</name>
	<description>#0: geometry control register    This register controls the pixel enumeration and selection units, deciding   which pixels are </description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>RESERVED</name>
	<description>reserved for GPU internal use</description>
	<bitRange>[31:27]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIMITERPRECISION</name>
	<description>increase precision of limiters from 16.16 to 10.22</description>
	<bitRange>[24:24]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_SPANSTORE</name>
	<description>nextline span start is always equal or left to current-line span start</description>
	<bitRange>[23:23]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_SPANABORT</name>
	<description>shape is horizontally convex. only a single span per scanline</description>
	<bitRange>[22:22]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_UNIONCD</name>
	<description>combine outputs C &amp; D as union (output is final)</description>
	<bitRange>[21:21]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_UNIONAB</name>
	<description>combine outputs A &amp; B as union (output is called C)</description>
	<bitRange>[20:20]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_UNION56</name>
	<description>combine limter 5 &amp; 6 as union (output is called D)</description>
	<bitRange>[19:19]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_UNION34</name>
	<description>combine limter 3 &amp; 4 as union (output is called B)</description>
	<bitRange>[18:18]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_UNION12</name>
	<description>combine limter 1 &amp; 2 as union (output is called A)</description>
	<bitRange>[17:17]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BAND2ENABLE</name>
	<description>enable band postprocess for limiter 2 (see &lt;D2_L2BAND&gt;)</description>
	<bitRange>[16:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BAND1ENABLE</name>
	<description>enable band postprocess for limiter 1 (see &lt;D2_L1BAND&gt;)</description>
	<bitRange>[15:15]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM6THRESHOLD</name>
	<description>enable limiter 6 threshold mode</description>
	<bitRange>[14:14]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM5THRESHOLD</name>
	<description>enable limiter 5 threshold mode</description>
	<bitRange>[13:13]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM4THRESHOLD</name>
	<description>enable limiter 4 threshold mode</description>
	<bitRange>[12:12]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM3THRESHOLD</name>
	<description>enable limiter 3 threshold mode</description>
	<bitRange>[11:11]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM2THRESHOLD</name>
	<description>enable limiter 2 threshold mode</description>
	<bitRange>[10:10]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM1THRESHOLD</name>
	<description>enable limiter 1 threshold mode</description>
	<bitRange>[9:9]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_QUAD3ENABLE</name>
	<description>enable quadratic coupling of limiters 5 and 6</description>
	<bitRange>[8:8]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_QUAD2ENABLE</name>
	<description>enable quadratic coupling of limiters 3 and 4</description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_QUAD1ENABLE</name>
	<description>enable quadratic coupling of limiters 1 and 2</description>
	<bitRange>[6:6]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM6ENABLE</name>
	<description>enable limiter 6</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM5ENABLE</name>
	<description>enable limiter 5</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM4ENABLE</name>
	<description>enable limiter 4</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM3ENABLE</name>
	<description>enable limiter 3</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM2ENABLE</name>
	<description>enable limiter 2</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_LIM1ENABLE</name>
	<description>enable limiter 1</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_CONTROL2</name>
	<description>#1: surface control register   This register controls the colorization, texturing and blending units, deciding   what color a p</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>D2C_RLEFORMAT2</name>
	<description>bit1 of RLE texel format</description>
	<bitRange>[31:31]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_RLEFORMAT1</name>
	<description>bit0 of RLE texel format</description>
	<bitRange>[30:30]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BDIA</name>
	<description>dst factor for alpha channel will be inverted (meaning 1-a or 1-1 depending on BDFA)</description>
	<bitRange>[29:29]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BSIA</name>
	<description>src factor for alpha channel will be inverted (meaning 1-a or 1-1 depending on BSFA)</description>
	<bitRange>[28:28]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_CLUTFORMAT1</name>
	<description>bit0 of the CLUT entry format</description>
	<bitRange>[27:27]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_COLKEY_ENABLE</name>
	<description>enable color keying (see also &lt;D2_COLKEY&gt; and feature bits of &lt;D2_HWREVISION&gt;)</description>
	<bitRange>[26:26]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_CLUT_ENABLE</name>
	<description>enable the use of the CLUT (see also feature bits of &lt;D2_HWREVISION&gt;); if disabled the texture indices are written to FB</description>
	<bitRange>[25:25]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_RLE_ENABLE</name>
	<description>enable RLE decoder (see also feature bits of &lt;D2_HWREVISION&gt;)</description>
	<bitRange>[24:24]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEALPHA2</name>
	<description>bit1 of the 'alpha source' (depends on USE_ACB)</description>
	<bitRange>[23:23]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEALPHA1</name>
	<description>bit0 of the 'alpha source' (depends on USE_ACB)</description>
	<bitRange>[22:22]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEFORMAT2</name>
	<description>bit1 of the framebuffer format descriptor</description>
	<bitRange>[21:21]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEFORMAT1</name>
	<description>bit0 of the framebuffer format descriptor</description>
	<bitRange>[20:20]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_READFORMAT2</name>
	<description>bit1 of the texture format descriptor</description>
	<bitRange>[19:19]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_READFORMAT1</name>
	<description>bit0 of the texture format descriptor</description>
	<bitRange>[18:18]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTUREFILTERY</name>
	<description>linear filtering on texture v axis</description>
	<bitRange>[17:17]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTUREFILTERX</name>
	<description>linear filtering on texture u axis</description>
	<bitRange>[16:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTURECLAMPY</name>
	<description>clamp instead of mask v coordinate</description>
	<bitRange>[15:15]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTURECLAMPX</name>
	<description>clamp instead of mask u coordinate</description>
	<bitRange>[14:14]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BC2</name>
	<description>blending for color channels is done with &lt;D2_COLOR2&gt; instead of the real dst value</description>
	<bitRange>[13:13]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BDI</name>
	<description>dst factor for color channels will be inverted (meaning 1-a or 1-1 depending on BDF)</description>
	<bitRange>[12:12]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BSI</name>
	<description>src factor for color channels will be inverted (meaning 1-a or 1-1 depending on BSF)</description>
	<bitRange>[11:11]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BDF</name>
	<description>dst factor for color channels is alpha (factor is 1 per default)</description>
	<bitRange>[10:10]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BSF</name>
	<description>src factor for color channels is alpha (factor is 1 per default)</description>
	<bitRange>[9:9]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_WRITEFORMAT3</name>
	<description>bit2 of the framebuffer format descriptor</description>
	<bitRange>[8:8]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BDFA</name>
	<description>dst factor for alpha channel is alpha (factor is 1 per default)</description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_BSFA</name>
	<description>src factor for alpha channel is alpha (factor is 1 per default)</description>
	<bitRange>[6:6]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_READFORMAT4</name>
	<description>bit3 of the texture format descriptor</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_READFORMAT3</name>
	<description>bit2 of the texture format descriptor</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>USE_ACB</name>
	<description>use full alpha channel blending, else use write-alpha mode</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_PATTERNSOURCEL5</name>
	<description>Limiter 5 is used as pattern index instead of the default U-Limiter</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_TEXTUREENABLE</name>
	<description>Pixel source is read from texture and used as an alpha to blend between &lt;D2_COLOR1&gt; and &lt;D2_COLOR2&gt;</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2C_PATTERNENABLE</name>
	<description>Pixel source is a pattern color (blend of &lt;D2_COLOR1&gt; and &lt;D2_COLOR2&gt; depending on &lt;D2_PATTERN&gt; and pattern index)</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_CONTROL3</name>
	<description>#2: burst length limit control register   This register controls the burst length limit for the master bus interfaces   Log2 of</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x04040404</resetValue>
	<resetMask>0x07ffffff</resetMask>
	<fields><field>
	<name>BURSTLENGTH_MDL</name>
	<description>Burst length limit for MDL read (other values are not allowed)
0: single word transfer
2: 4 words
3: 8 words
4: 16 words</description>
	<bitRange>[26:24]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>BURSTLENGTH_MTX</name>
	<description>Burst length limit for MTX read (other values are not allowed)
0: single word transfer
2: 4 words
3: 8 words
4: 16 words</description>
	<bitRange>[18:16]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>BURSTLENGTH_MFBW</name>
	<description>Burst length limit for MFB write (other values are not allowed)
0: single word transfer
2: 4 words
3: 8 words
4: 16 words</description>
	<bitRange>[10:8]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>BURSTLENGTH_MFBR</name>
	<description>Burst length limit for MFB read (other values are not allowed)
0: single word transfer
2: 4 words
3: 8 words
4: 16 words</description>
	<bitRange>[2:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_DLISTSTART</name>
	<description>#50: Displaylist start address&#13;

