honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
Setting a new displaylist base address (writing to D2_DLISTSTART) &#13;
*triggers* execution of th</description>
	<addressOffset>0x000000c8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DLISTSTART</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_HWREVISION</name>
	<description>#1: hardware version and feature set ID   Read this (constant) register to identify the present hardware revision and  feature </description>
	<addressOffset>0x000000f0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x1fbe000d</resetValue>
	<resetMask>0x1fffffff</resetMask>
	<fields><field>
	<name>FB_BURSTSPLITTING</name>
	<description>bursts can be split with respect to burst length limit</description>
	<bitRange>[28:28]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_ALPHACHANNELBLENDING</name>
	<description>full alpha channel blending available</description>
	<bitRange>[27:27]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_HILIMITERPRECISION</name>
	<description>increasable precision of limiters available</description>
	<bitRange>[26:26]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_COLORKEY</name>
	<description>color keying available</description>
	<bitRange>[25:25]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_TEXCLUT256</name>
	<description>extend CLUT to 256x32bit ARGB8888</description>
	<bitRange>[24:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_RLEUNIT</name>
	<description>RLE texture decoder available</description>
	<bitRange>[23:23]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_FBPREFETCH</name>
	<description>Framebuffer prefetch available</description>
	<bitRange>[22:22]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_TEXCLUT</name>
	<description>Color Lookup Table 16x24bit for indexed textureformat available</description>
	<bitRange>[21:21]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_PERFCOUNT</name>
	<description>Two performance counters available</description>
	<bitRange>[20:20]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_TXCACHE</name>
	<description>Texture Cache available</description>
	<bitRange>[19:19]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_FBCACHE</name>
	<description>Framebuffer Cache available</description>
	<bitRange>[18:18]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_DLR</name>
	<description>DisplayListReader available</description>
	<bitRange>[17:17]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>FB_SWGPU</name>
	<description>Software GPU</description>
	<bitRange>[16:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HWTYPE</name>
	<description>GPU Type</description>
	<bitRange>[15:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HWBRANCH</name>
	<description>Branch number</description>
	<bitRange>[11:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HWREVISION</name>
	<description>Revision number</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>D2_IRQCTL</name>
	<description>#48: interrupt control register   .The GPU features three sources for interrupts. They can be enabled and cleared individually.   </description>
	<addressOffset>0x000000c0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>D2IRQCTL_CLR_BUS_ERROR</name>
	<description>Clear Interrupt 'Bus error'</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2IRQCTL_ENABLE_BUS_ERROR</name>
	<description>Interruptmask enable 'Bus error'</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2IRQCTL_CLR_FINISH_DLIST</name>
	<description>Clear Interrupt 'Displaylist is finished'. Make sure to clear the IRQ before starting the DLR again! No register writes must be done by the CPU while the DLR is active!</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2IRQCTL_CLR_FINISH_ENUM</name>
	<description>Clear Interrupt 'Enumeration is finished'</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2IRQCTL_ENABLE_FINISH_DLIST</name>
	<description>Interruptmask enable 'Displaylist is finished'</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>D2IRQCTL_ENABLE_FINISH_ENUM</name>
	<description>Interruptmask enable 'Enumeration is finished'</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L1BAND</name>
	<description>#22: Limiter1 band width parameter&#13;

Postfilter&#13;
First two limiter outputs can be routed through an additional unit before&#13;
cla</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L1BAND</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L1START</name>
	<description>#4: Limiter1 start value&#13;

All limiter registers are *write only*, reading will return undefined results.&#13;
Limiters must be ena</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>L1START</name>
	
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>D2_L1XADD</name>
	<description>#10: Limiter1 X-Axis increment&#13;

