honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
	<registers>
	<register>
	<name>I3C_BUS_FREE_AVAIL_TIMING_REG</name>
	<description>Bus Free Timing Register</description>
	<addressOffset>0x000000d4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000020</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>BUS_FREE_TIME</name>
	<description>This register field is used only in Master mode of operation

I3C Bus Free Count Value.

In Pure Bus System, this field represents tCAS parameter. In Mixed Bus system, this field is expected to be programmed to tLOW of I2C Timing.
</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_COMMAND_QUEUE_PORT_REG</name>
	<description>COMMAND_QUEUE_PORT</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>COMMAND</name>
	<description>32 bit command</description>
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>I3C_DATA_BUFFER_STAT_LEVEL_REG</name>
	<description>Data Buffer Status Level Register </description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000020</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>RX_BUF_BLR</name>
	<description>Receive Buffer Level Value.

Contains the number of valid data entries in the receive Buffer.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TX_BUF_EMPTY_LOC</name>
	<description>Transmit Buffer Empty Level Value.

Contains the number of empty locations in the transmit Buffer.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_DATA_BUFFER_THLD_CTRL_REG</name>
	<description>Data Buffer Threshold Control Register </description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x03030303</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>RX_START_THLD</name>
	<description>Receive Start Threshold Value.

In master mode of operation when the controller is set up to initiate a read transfer, it waits until either one of the conditions are met before it initiates the read transfer on the I3C Interface.

Data length (as specified in the command) number of locations are empty in the Receive FIFO.

Threshold number of locations (or more) are empty in the Receive FIFO.

The supported values for RX_START_THLD are:

000 - 1
001 - 4
010 - 8
011 - 16
100 - 32
101 - 64</description>
	<bitRange>[26:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_START_THLD</name>
	<description>Transfer Start Threshold Value.

In master mode of operation when the controller is set up to initiate a write transfer, it waits until either one of the following conditions are met before it initiates the write transfer on the I3C Interface.

Data length (as specified in the command) number of locations are filled in the Transmit FIFO

Threshold number of entries (or more) are available in the Transmit FIFO

The supported values for TX_START_THLD are:

000: 1
001: 4
010: 8
011: 16
100: 32
101: 64
</description>
	<bitRange>[18:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RX_BUF_THLD</name>
	<description>Receive Buffer Threshold Value.

This field controls the number of entries (or above) in the Receive FIFO that trigger the RX_THLD_STAT interrupt.

If the programmed value is greater than the buffer depth, then threshold will be set to 32. The supported values for RX_BUF_THLD are

000: 1
001: 4
010: 8
011: 16
100: 32
101: 64
</description>
	<bitRange>[10:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_EMPTY_BUF_THLD</name>
	<description>Transmit Buffer Threshold Value.

This field controls the number of empty locations (or above) in the Transmit FIFO that trigger the TX_THLD_STAT interrupt.

If the programmed value is greater than the buffer depth, then threshold will be set to 32. The supported values for TX_BUF_THLD are

000: 1
001: 4
010: 8
011: 16
100: 32
101: 64</description>
	<bitRange>[2:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEVICE_ADDR_REG</name>
	<description>Device Address Register</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x80000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DYNAMIC_ADDR_VALID</name>
	<description>Dynamic Address Valid

This bit is used to control whether the DYNAMIC_ADDR is valid or not.

In I3C Main Master mode, the user sets this bit to 1 as it self-assigns its dynamic address.
In all other operation modes, the Controller sets this bit to 1 when Main Master assigns the Dynamic address during ENTDAA or SETDASA mechanism.

Values:

0x0 (INVALID): Dynamic Address is invalid
0x1 (VALID): Dynamic Address is valid
</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DYNAMIC_ADDR</name>
	<description>Device Dynamic Address.

This field is used to program the Device Dynamic Address. The Controller uses this address for I3C transfers.

In Main Master mode, the user/application has to program the Dynamic Address through the Slave interface as it self-assigns its Dynamic Address.
In all other modes, the Main Master assigns this address during ENTDAA or SETDASA mechanism.
</description>
	<bitRange>[22:16]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEVICE_ADDR_TABLE_PTR_REG</name>
	<description>Pointer for Device Address Table Registers </description>
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00080280</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DEV_ADDR_TABLE_DEPTH</name>
	<description>Depth of Device Address Table</description>
	<bitRange>[31:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>P_DEV_ADDR_TABLE_START_ADDR</name>
	<description>Start Address of Device Address Table.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_DEVICE_CTRL_EXTENDED_REG</name>
	<description>Device Control Extended Register </description>
	<addressOffset>0x000000b0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DEV_OPERATION_MODE</name>
	<description>This bit is used to select the Device Operation Mode before the controller is enabled.

This field shall be written only when the i3c is disabled.

0: Master
1: Slave
2: Reserved
3: Reserved

This field will be automatically updated by the controller once the role change happens in secondary master mode..</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEVICE_CTRL_REG</name>
	<description>Device Control Register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000181</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>ENABLE</name>
	<description>Controls whether or not i3c is enabled.

