honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
1: Enables the i3c controller.
0: Disables the i3c controller.

In Master mode of operation, software can Disable i3c while it is active. However, the controller may not get Disabled immediately and will be 'Disabled' after commands in the Command queue (if any) are executed leading to a STOP condition on the bus and Master FSM is in IDLE state (as indicated by PRESENT_STATE Register).
</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESUME</name>
	<description>i3c Resume.

This bit is used to resume the Controller after it goes to Halt state.

In the master mode of operation the controller goes to the halt state (as indicated in PRESENT_STATE Register) due to any type of error in the transfer (the type of error is indicated by ERR_STATUS field in the RESPONSE_QUEUE_PORT register).

After the controller has gone to halt state, the application has to write 1'b1 to this bit to resume the controller. This bit is auto-cleared once the controller resumes the transfers by initiating the next command.
</description>
	<bitRange>[30:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ABORT</name>
	<description>i3c Abort.

This bit is used in master mode of operation.

This bit allows the controller to relinquish the I3C Bus before completing the issued transfer.

In response to an ABORT request, the controller issues the STOP condition after the complete data byte is transferred or received.

This bit is auto-cleared once the transfer is aborted and controller issues a 'Transfer Abort' interrupt.
</description>
	<bitRange>[29:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DMA_ENABLE_I3C</name>
	<description>DMA Handshake Interface Enable.

This bit is used to enable or disable the DMA Handshaking interface and is applicable to both Master and Slave mode of operation.

1: Enables the DMA handshake control to interact with external DMA.

0: The DMA handshake control has no significance.
</description>
	<bitRange>[28:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>HOT_JOIN_CTRL</name>
	<description>Hot-Join Ack/Nack Control

This bit is used in master mode of operation.

This bit acts as global control to ACK/NACK the Hot-Join Request from the devices. The i3c Master will ACK/NACK the Hot-Join request from other devices connected on the I3C Bus, based on programming of this bit.

0: ACK the Hot-join request.
1: NACK and send broadcast CCC to disable Hot-join.

Values:

0x0 (DISABLED): Ack Hot-Join requests
0x1 (ENABLED): Nack and auto-disable Hot-Join request
</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C_SLAVE_PRESENT</name>
	<description>I2C Slave Present

This bit is used in master mode of operation.

This Bit indicates whether any Legacy I2C Devices are present in the system.

In HDR mode, this field is used to select TSL over TSP in mixed bus configuration.

Values:

0x0 (DISABLED): I2C Slave not present
0x1 (ENABLED): I2C Slave present</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IBA_INCLUDE</name>
	<description>I3C Broadcast Address include.

This bit is used in master mode of operation.

This bit is used to include I3C broadcast address (0x7E) for private transfer.

Note: If I3C broadcast address is not included for the private transfers, In-band Interrupts (IBI) driven from Slaves may not win address arbitration. Hence, the IBIs will get delayed.

Values:

0x0 (NOT_INCLUDED): I3C Broadcast Address is not included for Private Transfers
0x1 (INCLUDED): I3C Broadcast Address is included for Private Transfers
</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_ADDR_TABLE_LOC1_REG</name>
	<description>Device Address Table of Device1 </description>
	<addressOffset>0x00000280</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LEGACY_I2C_DEVICE</name>
	<description>Legacy I2C device or not.

This bit should be set to 1 if the device is a legacy I2C device.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_NACK_RETRY_CNT</name>
	<description>This field is used to set the Device NACK Retry count for the particular device.

If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then Controller generates an error response and move to the Halt state.

This feature is used for Retry Model for the following features mentioned in the I3C Specification:

Retry Model for Direct GET CCC Commands.
The incoming SIR-IBI matches with the slave address initated by the Master.
</description>
	<bitRange>[30:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_DYNAMIC_ADDR</name>
	<description>Device Dynamic Address with parity. The MSB, bit[23], should be programmed with parity of dynamic address.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_STATIC_ADDR</name>
	<description>Device Static Address.</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_ADDR_TABLE_LOC2_REG</name>
	<description>Device Address Table of Device2</description>
	<addressOffset>0x00000284</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LEGACY_I2C_DEVICE</name>
	<description>Legacy I2C device or not.

This bit should be set to 1 if the device is a legacy I2C device.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_NACK_RETRY_CNT</name>
	<description>This field is used to set the Device NACK Retry count for the particular device.

