honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then Controller generates an error response and move to the Halt state.

This feature is used for Retry Model for the following features mentioned in the I3C Specification:

Retry Model for Direct GET CCC Commands.
The incoming SIR-IBI matches with the slave address initated by the Master.
</description>
	<bitRange>[30:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_DYNAMIC_ADDR</name>
	<description>Device Dynamic Address with parity. The MSB, bit[23], should be programmed with parity of dynamic address.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_STATIC_ADDR</name>
	<description>Device Static Address.</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_ADDR_TABLE_LOC3_REG</name>
	<description>Device Address Table of Device3</description>
	<addressOffset>0x00000288</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LEGACY_I2C_DEVICE</name>
	<description>Legacy I2C device or not.

This bit should be set to 1 if the device is a legacy I2C device.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_NACK_RETRY_CNT</name>
	<description>This field is used to set the Device NACK Retry count for the particular device.

If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then Controller generates an error response and move to the Halt state.

This feature is used for Retry Model for the following features mentioned in the I3C Specification:

Retry Model for Direct GET CCC Commands.
The incoming SIR-IBI matches with the slave address initated by the Master.
</description>
	<bitRange>[30:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_DYNAMIC_ADDR</name>
	<description>Device Dynamic Address with parity. The MSB, bit[23], should be programmed with parity of dynamic address.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_STATIC_ADDR</name>
	<description>Device Static Address.</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_ADDR_TABLE_LOC4_REG</name>
	<description>Device Address Table of Device4</description>
	<addressOffset>0x0000028c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LEGACY_I2C_DEVICE</name>
	<description>Legacy I2C device or not.

This bit should be set to 1 if the device is a legacy I2C device.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_NACK_RETRY_CNT</name>
	<description>This field is used to set the Device NACK Retry count for the particular device.

If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then Controller generates an error response and move to the Halt state.

This feature is used for Retry Model for the following features mentioned in the I3C Specification:

Retry Model for Direct GET CCC Commands.
The incoming SIR-IBI matches with the slave address initated by the Master.
</description>
	<bitRange>[30:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_DYNAMIC_ADDR</name>
	<description>Device Dynamic Address with parity. The MSB, bit[23], should be programmed with parity of dynamic address.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_STATIC_ADDR</name>
	<description>Device Static Address.</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_ADDR_TABLE_LOC5_REG</name>
	<description>Device Address Table of Device5</description>
	<addressOffset>0x00000290</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LEGACY_I2C_DEVICE</name>
	<description>Legacy I2C device or not.

This bit should be set to 1 if the device is a legacy I2C device.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_NACK_RETRY_CNT</name>
	<description>This field is used to set the Device NACK Retry count for the particular device.

If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then Controller generates an error response and move to the Halt state.

This feature is used for Retry Model for the following features mentioned in the I3C Specification:

Retry Model for Direct GET CCC Commands.
The incoming SIR-IBI matches with the slave address initated by the Master.
</description>
	<bitRange>[30:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_DYNAMIC_ADDR</name>
	<description>Device Dynamic Address with parity. The MSB, bit[23], should be programmed with parity of dynamic address.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_STATIC_ADDR</name>
	<description>Device Static Address.</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_ADDR_TABLE_LOC6_REG</name>
	<description>Device Address Table of Device6</description>
	<addressOffset>0x00000294</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LEGACY_I2C_DEVICE</name>
	<description>Legacy I2C device or not.

