honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
This bit should be set to 1 if the device is a legacy I2C device.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_NACK_RETRY_CNT</name>
	<description>This field is used to set the Device NACK Retry count for the particular device.

If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then Controller generates an error response and move to the Halt state.

This feature is used for Retry Model for the following features mentioned in the I3C Specification:

Retry Model for Direct GET CCC Commands.
The incoming SIR-IBI matches with the slave address initated by the Master.
</description>
	<bitRange>[30:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_DYNAMIC_ADDR</name>
	<description>Device Dynamic Address with parity. The MSB, bit[23], should be programmed with parity of dynamic address.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_STATIC_ADDR</name>
	<description>Device Static Address.</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_ADDR_TABLE_LOC7_REG</name>
	<description>Device Address Table of Device7</description>
	<addressOffset>0x00000298</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LEGACY_I2C_DEVICE</name>
	<description>Legacy I2C device or not.

This bit should be set to 1 if the device is a legacy I2C device.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_NACK_RETRY_CNT</name>
	<description>This field is used to set the Device NACK Retry count for the particular device.

If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then Controller generates an error response and move to the Halt state.

This feature is used for Retry Model for the following features mentioned in the I3C Specification:

Retry Model for Direct GET CCC Commands.
The incoming SIR-IBI matches with the slave address initated by the Master.
</description>
	<bitRange>[30:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_DYNAMIC_ADDR</name>
	<description>Device Dynamic Address with parity. The MSB, bit[23], should be programmed with parity of dynamic address.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_STATIC_ADDR</name>
	<description>Device Static Address.</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_ADDR_TABLE_LOC8_REG</name>
	<description>Device Address Table of Device8</description>
	<addressOffset>0x0000029c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LEGACY_I2C_DEVICE</name>
	<description>Legacy I2C device or not.

This bit should be set to 1 if the device is a legacy I2C device.</description>
	<bitRange>[31:31]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_NACK_RETRY_CNT</name>
	<description>This field is used to set the Device NACK Retry count for the particular device.

If the Device NACK's for the device address, the controller automatically retries the same device until this count expires. If the Slave does not ACK for the mentioned number of retries, then Controller generates an error response and move to the Halt state.

This feature is used for Retry Model for the following features mentioned in the I3C Specification:

Retry Model for Direct GET CCC Commands.
The incoming SIR-IBI matches with the slave address initated by the Master.
</description>
	<bitRange>[30:29]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_DYNAMIC_ADDR</name>
	<description>Device Dynamic Address with parity. The MSB, bit[23], should be programmed with parity of dynamic address.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_STATIC_ADDR</name>
	<description>Device Static Address.</description>
	<bitRange>[6:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE1_LOC1_REG</name>
	<description> Device Characteristic Table Location-1 of Device1</description>
	<addressOffset>0x00000200</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LSB_PROVISIONAL_ID</name>
	<description>The LSB 32-bit value of Provisional-ID</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE1_LOC2_REG</name>
	<description>Device Characteristic Table Location-2 of Device1</description>
	<addressOffset>0x00000204</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>MSB_PROVISIONAL_ID</name>
	<description>The MSB 16-bit value of Provisional-ID</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE1_LOC3_REG</name>
	<description>Device Characteristic Table Location-3 of Device1</description>
	<addressOffset>0x00000208</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>BCR</name>
	<description>Bus Characteristic Value</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCR</name>
	<description>Device Characteristic Value</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE1_LOC4_REG</name>
	<description>Device Characteristic Table Location-4 of Device1</description>
	<addressOffset>0x0000020c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DEV_DYNAMIC_ADDR_LOC4</name>
	<description>Device Dynamic Address assigned.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE2_LOC1_REG</name>
	<description> Device Characteristic Table Location-1 of Device2</description>
	<addressOffset>0x00000210</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LSB_PROVISIONAL_ID</name>
	<description>The LSB 32-bit value of Provisional-ID</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE2_LOC2_REG</name>
	<description>Device Characteristic Table Location-2 of Device2</description>
	<addressOffset>0x00000214</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>MSB_PROVISIONAL_ID</name>
	<description>The MSB 16-bit value of Provisional-ID</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE2_LOC3_REG</name>
	<description>Device Characteristic Table Location-3 of Device2</description>
	<addressOffset>0x00000218</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>BCR</name>
	<description>Bus Characteristic Value</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCR</name>
	<description>Device Characteristic Value</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE2_LOC4_REG</name>
	<description>Device Characteristic Table Location-4 of Device2</description>
	<addressOffset>0x0000021c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DEV_DYNAMIC_ADDR_LOC4</name>
	<description>Device Dynamic Address assigned.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE3_LOC1_REG</name>
	<description> Device Characteristic Table Location-1 of Device3</description>
	<addressOffset>0x00000220</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LSB_PROVISIONAL_ID</name>
	<description>The LSB 32-bit value of Provisional-ID</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE3_LOC2_REG</name>
	<description>Device Characteristic Table Location-2 of Device3</description>
	<addressOffset>0x00000224</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>MSB_PROVISIONAL_ID</name>
	<description>The MSB 16-bit value of Provisional-ID</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE3_LOC3_REG</name>
	<description>Device Characteristic Table Location-3 of Device3</description>
	<addressOffset>0x00000228</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>BCR</name>
	<description>Bus Characteristic Value</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCR</name>
	<description>Device Characteristic Value</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE3_LOC4_REG</name>
	<description>Device Characteristic Table Location-4 of Device3</description>
	<addressOffset>0x0000022c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DEV_DYNAMIC_ADDR_LOC4</name>
	<description>Device Dynamic Address assigned.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE4_LOC1_REG</name>
	<description> Device Characteristic Table Location-1 of Device4</description>
	<addressOffset>0x00000230</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LSB_PROVISIONAL_ID</name>
	<description>The LSB 32-bit value of Provisional-ID</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE4_LOC2_REG</name>
	<description>Device Characteristic Table Location-2 of Device4</description>
	<addressOffset>0x00000234</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>MSB_PROVISIONAL_ID</name>
	<description>The MSB 16-bit value of Provisional-ID</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE4_LOC3_REG</name>
	<description>Device Characteristic Table Location-3 of Device4</description>
	<addressOffset>0x00000238</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>BCR</name>
	<description>Bus Characteristic Value</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCR</name>
	<description>Device Characteristic Value</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE4_LOC4_REG</name>
	<description>Device Characteristic Table Location-4 of Device4</description>
	<addressOffset>0x0000023c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DEV_DYNAMIC_ADDR_LOC4</name>
	<description>Device Dynamic Address assigned.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE5_LOC1_REG</name>
	<description> Device Characteristic Table Location-1 of Device5</description>
	<addressOffset>0x00000240</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LSB_PROVISIONAL_ID</name>
	<description>The LSB 32-bit value of Provisional-ID</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE5_LOC2_REG</name>
	<description>Device Characteristic Table Location-2 of Device5</description>
	<addressOffset>0x00000244</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>MSB_PROVISIONAL_ID</name>
	<description>The MSB 16-bit value of Provisional-ID</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE5_LOC3_REG</name>
	<description>Device Characteristic Table Location-3 of Device5</description>
	<addressOffset>0x00000248</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>BCR</name>
	<description>Bus Characteristic Value</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCR</name>
	<description>Device Characteristic Value</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE5_LOC4_REG</name>
	<description>Device Characteristic Table Location-4 of Device5</description>
	<addressOffset>0x0000024c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DEV_DYNAMIC_ADDR_LOC4</name>
	<description>Device Dynamic Address assigned.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE6_LOC1_REG</name>
	<description> Device Characteristic Table Location-1 of Device6</description>
	<addressOffset>0x00000250</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LSB_PROVISIONAL_ID</name>
	<description>The LSB 32-bit value of Provisional-ID</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE6_LOC2_REG</name>
	<description>Device Characteristic Table Location-2 of Device6</description>
	<addressOffset>0x00000254</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>MSB_PROVISIONAL_ID</name>
	<description>The MSB 16-bit value of Provisional-ID</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE6_LOC3_REG</name>
	<description>Device Characteristic Table Location-3 of Device6</description>
	<addressOffset>0x00000258</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>BCR</name>
	<description>Bus Characteristic Value</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCR</name>
	<description>Device Characteristic Value</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE6_LOC4_REG</name>
	<description>Device Characteristic Table Location-4 of Device6</description>
	<addressOffset>0x0000025c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DEV_DYNAMIC_ADDR_LOC4</name>
	<description>Device Dynamic Address assigned.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE7_LOC1_REG</name>
	<description> Device Characteristic Table Location-1 of Device7</description>
	<addressOffset>0x00000260</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LSB_PROVISIONAL_ID</name>
	<description>The LSB 32-bit value of Provisional-ID</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE7_LOC2_REG</name>
	<description>Device Characteristic Table Location-2 of Device7</description>
	<addressOffset>0x00000264</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>MSB_PROVISIONAL_ID</name>
	<description>The MSB 16-bit value of Provisional-ID</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE7_LOC3_REG</name>
	<description>Device Characteristic Table Location-3 of Device7</description>
	<addressOffset>0x00000268</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>BCR</name>
	<description>Bus Characteristic Value</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCR</name>
	<description>Device Characteristic Value</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE7_LOC4_REG</name>
	<description>Device Characteristic Table Location-4 of Device7</description>
	<addressOffset>0x0000026c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DEV_DYNAMIC_ADDR_LOC4</name>
	<description>Device Dynamic Address assigned.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE8_LOC1_REG</name>
	<description> Device Characteristic Table Location-1 of Device8</description>
	<addressOffset>0x00000270</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>LSB_PROVISIONAL_ID</name>
	<description>The LSB 32-bit value of Provisional-ID</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE8_LOC2_REG</name>
	<description>Device Characteristic Table Location-2 of Device8</description>
	<addressOffset>0x00000274</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>MSB_PROVISIONAL_ID</name>
	<description>The MSB 16-bit value of Provisional-ID</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE8_LOC3_REG</name>
	<description>Device Characteristic Table Location-3 of Device8</description>
	<addressOffset>0x00000278</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>BCR</name>
	<description>Bus Characteristic Value</description>
	<bitRange>[15:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DCR</name>
	<description>Device Characteristic Value</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE8_LOC4_REG</name>
	<description>Device Characteristic Table Location-4 of Device8</description>
	<addressOffset>0x0000027c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>DEV_DYNAMIC_ADDR_LOC4</name>
	<description>Device Dynamic Address assigned.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_DEV_CHAR_TABLE_POINTER_REG</name>
	<description>Pointer for Device Characteristics Table </description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00020200</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>PRESENT_DEV_CHAR_TABLE_INDX</name>
	<description>Current index of Device Characteristics Table.

This field returns the current location of Device Characteristics Table index. Initially, this index points to 0.

