honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
Once the complete characteristics information of a Slave device is written into Device Characteristics Table during ENTDAA, this index increments by 1. The first winning device information is stored in Device Characteristics Table index 0, the second winning device information in index 1, and so on.

If required, this index can be used to override the location, where characteristic information of Slave devices on the I3C bus are written during ENTDAA. Hence, this field is useful only if the device is Current Master. During DEFSLV CCC, the index always starts from 0.

In Non-current Master, this field is always read-only.</description>
	<bitRange>[21:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>DEV_CHAR_TABLE_DEPTH</name>
	<description>Depth of Device Characteristics Table</description>
	<bitRange>[18:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>P_DEV_CHAR_TABLE_START_ADDR</name>
	<description>Start Address of Device Characteristics Table.</description>
	<bitRange>[11:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_HW_CAPABILITY_REG</name>
	<description>Hardware Capability register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00034101</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>SLV_IBI_CAP</name>
	<description>Reflects the IC_SLV_IBI Configurable Parameter.

Specifies slave's capability to initiate slave interrupt requests.
</description>
	<bitRange>[19:19]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SLV_HJ_CAP</name>
	<description>Reflects the IC_SLV_HJ Configurable Parameter.

Specifies slave's capability to initiate Hot-join request.
</description>
	<bitRange>[18:18]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DMA_EN</name>
	<description>Reflects the IC_HAS_DMA Configurable Parameter.

Specifies whether controller is configured to have DMA handshaking interface.</description>
	<bitRange>[17:17]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HDR_TX_CLOCK_PERIOD</name>
	<description>Reflects the IC_HDR_TX_CLK_PERIOD Configurable Parameter.</description>
	<bitRange>[16:11]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CLOCK_PERIOD</name>
	<description>Reflects the IC_CLK_PERIOD Configurable Parameter</description>
	<bitRange>[10:5]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HDR_TS_EN</name>
	<description>Reflects the IC_SPEED_HDR_TS Configurable Parameter.

Specifies the Controllers capability to perform HDR-TS transfers.

0 : HDR-TS not supported
1 : HDR-TS supported</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>HDR_DDR_EN</name>
	<description>Reflects the IC_SPEED_HDR_DDR Configurable Parameter.

Specifies the Controllers capability to perform HDR-DDR transfers.

0 : HDR-DDR not supported
1 : HDR-DDR supported</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DEVICE_ROLE_CONFIG</name>
	<description>Reflects the IC_DEVICE_ROLE Configurable Parameter.

Specifies the configured role of i3c controller

1 : Master Only
2 : Programmable Master-Slave
3 : Secondary Master
4 : Slave Only</description>
	<bitRange>[2:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_IBI_QUEUE_CTRL_REG</name>
	<description>IBI Queue Control Register </description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>NOTIFY_SIR_REJECTED</name>
	<description>Notify Rejected Slave Interrupt Request Control.

This bit is used to suppress reporting to the application about SIR request rejected.

0: Suppress passing the IBI Status to the IBI FIFO (hence not notifying the application) when a Slave Interrupt Request is NACKed and auto-disabled based on the IBI_SIR_REQ_REJECT Register.
1: Writes IBI Status to the IBI FIFO (hence notifying the application) when a Slave Interrupt Request is NACKed and auto-disabled based on the IBI_SIR_REQ_REJECT Register.

Values:

0x0 (DISABLED): Notify SIR Rejected Disable
0x1 (ENABLED): Notify SIR Rejected Enable</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>NOTIFY_HJ_REJECTED</name>
	<description>Notify Rejected Hot-Join Control.

This bit is used to suppress reporting to the application about Hot-Join request rejected (NACK and Auto Disable).

0: Suppress passing the IBI Status to the IBI FIFO (hence not notifying the application) when a HJ Request is NACKed and auto-disabled based on the DEVICE_CTRL.HOT_JOIN_CTRL.
1: Writes IBI Status to the IBI FIFO (hence notifying the application) when a HJ Request is NACKed and auto-disabled based on the DEVICE_CTRL.HOT_JOIN_CTRL.

Values:

0x0 (DISABLED): Notify Hot-Join Rejected Disable
0x1 (ENABLED): Notify Hot-Join Rejected Enable
</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_IBI_QUEUE_STATUS_DATA_REG</name>
	<description>In-Band Interrupt Queue Status and Data Register </description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>IBI_STS</name>
	<description>IBI Received Status.

Defines the master response for IBI received.

4'b0xxx: Responded with ACK
4'b1xxx: Responded with NACK
Others : RESERVED</description>
	<bitRange>[31:28]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IBI_ID</name>
	<description>IBI Identifier.

The byte received after START which includes the address and the R/W bit.

Device address and R/W bit in case of Slave Interrupt or Master Request.
Hot-Join ID and R/W bit in case of Hot-Join IBI.</description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>DATA_LENGTH</name>
	<description>In-Band Interrupt data length.

This field represents the length of data received along with the IBI, in bytes.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_IBI_SIR_REQ_REJECT_REG</name>
	<description>IBI SIR Request Rejection Control Register </description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>SIR_REQ_REJECT</name>
	<description>In-band Slave Interrupt Request Reject.

The application of the i3c can decide whether to send ACK or NACK for a Slave request received from any I3C device.

A device specific response control bit is provided to select the response option. Master will ACK/NACK the Master Request based on programming of control bit, corresponding to the interrupting device.

0 - ACK the SIR Request
1 - NACK and send directed auto disable CCC
</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_INTR_FORCE_REG</name>
	<description>Interrupt Force Enable Register </description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TRANSFER_ERR_FORCE_EN</name>
	<description>Transfer Error Force Enable</description>
	<bitRange>[9:9]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>TRANSFER_ABORT_FORCE_EN</name>
	<description>Transfer Abort Force Enable.

This field is used only in master mode of operation.
</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>RESP_READY_FORCE_EN</name>
	<description>Response Queue Ready Force Enable</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>CMD_QUEUE_READY_FORCE_EN</name>
	<description>Command Queue Ready Force Enable</description>
	<bitRange>[3:3]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>IBI_THLD_FORCE_EN</name>
	<description>IBI Buffer Threshold Force Enable.

This field is used only in master mode of operation.
</description>
	<bitRange>[2:2]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>RX_THLD_FORCE_EN</name>
	<description>Receive Buffer Threshold Force Enable
</description>
	<bitRange>[1:1]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>TX_THLD_FORCE_EN</name>
	<description>Transmit Buffer Threshold Force Enable.</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>I3C_INTR_SIGNAL_EN_REG</name>
	<description>Interrupt Signal Enable Register </description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TRANSFER_ERR_SIGNAL_EN</name>
	<description>Transfer Error Signal Enable</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TRANSFER_ABORT_SIGNAL_EN</name>
	<description>Transfer Abort Signal Enable.

This field is used only in master mode of operation.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESP_READY_SIGNAL_EN</name>
	<description>Response Queue Ready Signal Enable</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_QUEUE_READY_SIGNAL_EN</name>
	<description>Command Queue Ready Signal Enable</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IBI_THLD_SIGNAL_EN</name>
	<description>IBI Buffer Threshold Signal Enable.

This field is used only in master mode of operation.
</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RX_THLD_SIGNAL_EN</name>
	<description>Receive Buffer Threshold Signal Enable
</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_THLD_SIGNAL_EN</name>
	<description>Transmit Buffer Threshold Signal Enable.

