honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
*Note: For the deassertion of the interrupt, first the *SIGNAL_EN bitfield should be cleared and then the *STATUS_EN one, otherwise is not working. This comment applies for the rest bitfields of this register </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_INTR_STATUS_EN_REG</name>
	<description>Interrupt Status Enable Register </description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TRANSFER_ERR_STS_EN</name>
	<description>Transfer Error Status Enable</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TRANSFER_ABORT_STS_EN</name>
	<description>Transfer Abort Status Enable.

This field is used only in master mode of operation.
</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESP_READY_STS_EN</name>
	<description>Response Queue Ready Status Enable
</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>CMD_QUEUE_READY_STS_EN</name>
	<description>Command Queue Ready Status Enable
</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>IBI_THLD_STS_EN</name>
	<description>IBI Buffer Threshold Status Enable.

This field is used only in master mode of operation.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RX_THLD_STS_EN</name>
	<description>Receive Buffer Threshold Status Enable</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TX_THLD_STS_EN</name>
	<description>Transmit Buffer Threshold Status Enable</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_INTR_STATUS_REG</name>
	<description>Interrupt Status Register</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TRANSFER_ERR_STS</name>
	<description>Transfer Error Status.

This interrupt is generated if any error occurs during transfer. The error type will be specified in the response packet associated with the command (in ERR_STATUS field of RESPONSE_QUEUE_PORT register). This bit can be cleared by writing 1'b1.
</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TRANSFER_ABORT_STS</name>
	<description>Transfer Abort Status.

This field is used only in master mode of operation.

This interrupt is generated if transfer is aborted. This interrupt can be cleared by writing 1'b1.
</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESP_READY_STS</name>
	<description>Response Queue Ready Status.

This interrupt is generated when number of entries in response queue is greater than or equal to threshold value specified by RESP_BUF_THLD field in QUEUE_THLD_CTRL register. This interrupt will be cleared automatically when number of entries in response buffer is less than threshold value specified.
</description>
	<bitRange>[4:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_QUEUE_READY_STS</name>
	<description>Command Queue Ready.

This interrupt is generated when number of empty locations in command queue is greater than or equal to threshold value specified by CMD_EMPTY_BUF_THLD field in QUEUE_THLD_CTRL register. This interrupt will be cleared automatically when number of empty locations in command buffer is less than threshold value specified.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IBI_THLD_STS</name>
	<description>IBI Buffer Threshold Status.

This field is only used in master mode of operation This interrupt is generated when number of entries in IBI buffer is greater than or equal to threshold value specified by IBI_BUF_THLD field in QUEUE_THLD_CTRL register. This interrupt will be cleared automatically when number of entries in IBI buffer is less than threshold value specified.
</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RX_THLD_STS</name>
	<description>Receive Buffer Threshold Status.

This interrupt is generated when number of entries in receive buffer is greater than or equal to threshold value specified by RX_BUF_THLD field in DATA_BUFFER_THLD_CTRL register. This interrupt will be cleared automatically when number of entries in receive buffer is less than threshold value specified.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TX_THLD_STS</name>
	<description>Transmit Buffer Threshold Status.

This interrupt is generated when number of empty locations in transmit buffer is greater than or equal to threshold value specified by TX_EMPTY_BUF_THLD field in DATA_BUFFER_THLD_CTRL register. This interrupt will be cleared automatically when number of empty locations in transmit buffer is less than threshold value specified.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_PRESENT_STATE_REG</name>
	<description>Present State Register </description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x10000003</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>MASTER_IDLE</name>
	<description>This field reflects whether the Master Controller is in Idle state or not. This bit will set when all the Queues(Command , Response, IBI) and Buffers(Transmit and Receive) are empty along with the Master State machine is in Idle state.

Values:

0x0 (MST_NOT_IDLE): Master Controller is not in IDLE State
0x1 (MST_IDLE): Master Controller is in IDLE State.
</description>
	<bitRange>[28:28]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_TID</name>
	<description>This field reflects the Transaction-ID of the current executing command.</description>
	<bitRange>[27:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CM_TFR_ST_STS</name>
	<description>Current Master Transfer State Status.

Indicates the state of current transfer currently executing by the i3c controller. This is valid in Master mode only.

