honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
6'h0: IDLE (Controller is Idle state, waiting for commands from application or Slave initated In-band Interrupt)
6'h1: START Generation State.
6'h2: RESTART Generation State.
6'h3: STOP Generation State.
6'h4: START Hold Generation for the Slave Initiated START State.
6'h5: Broadcast Write Address Header(7'h7E,W) Generation State.
6'h6: Broadcast Read Address Header(7'h7E,R) Generation State.
6'h7: Dynamic Address Assignment State.
6'h8: Slave Address Generation State.
6'hB: CCC Byte Generation State.
6'hC: HDR Command Generation State.
6'hD: Write Data Transfer State.
6'hE: Read Data Transfer State.
6'hF: In-Band Interrupt(SIR) Read Data State.
6'h10: In-Band Interrupt Auto-Disable State
6'h11: HDR-DDR CRC Data Generation/Receive State.
6'h12: Clock Extension State.
6'h13: Halt State.
</description>
	<bitRange>[21:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CM_TFR_STS</name>
	<description>Transfer Type Status.

Indicates the type of transfer currently executing by the i3c controller.

In Master mode of operation :

6'h0: IDLE (Controller is in Idle state, waiting for commands from application or Slave initated In-band Interrupt)
6'h1: Broadcast CCC Write Transfer.
6'h2: Directed CCC Write Transfer.
6'h3: Directed CCC Read Transfer.
6'h4: ENTDAA Address Assignment Transfer.
6'h5: SETDASA Address Assignment Transfer.
6'h6: Private I3C SDR Write Transfer.
6'h7: Private I3C SDR Read Transfer.
6'h8: Private I2C SDR Write Transfer.
6'h9: Private I2C SDR Read Transfer.
6'hA: Private HDR Ternary Symbol(TS) Write Transfer.
6'hB: Private HDR Ternary Symbol(TS) Read Transfer.
6'hC: Private HDR Double-Data Rate(DDR) Write Transfer.
6'hD: Private HDR Double-Data Rate(DDR) Read Transfer.
6'hE: Servicing In-Band Interrupt Transfer.
6'hF: Halt state (Controller is in Halt State, waiting for the application to resume through DEVICE_CTRL Register)
</description>
	<bitRange>[13:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CURRENT_MASTER</name>
	<description>This Bit is used to check whether the Master is Current Master or not. The Current Master is the Master that owns the SCL line.

If this bit is set to 0, the Master is not Current Master and requires to request and the ownership before initiating any transfer on the line.

If this bit is set to 1, the Master is the Current Master and can initate the transfers on the line.

0: Master is not Current Master
1: Master is Current Master</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SDA_LINE_SIGNAL_LEVEL</name>
	<description>This bit is used to check the SDA line level to recover from errors and for debugging. This bit reflects the value of synchronized sda_in_a signal. This is valid in Master mode only.
</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>SCL_LINE_SIGNAL_LEVEL</name>
	<description>This bit is used to check the SCL line level to recover from errors and for debugging. This bit reflects the value of synchronized scl_in_a signal. This is valid in Master mode only</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_QUEUE_SIZE_CAPABILITY_REG</name>
	<description>I3C Queue Size Capability Register </description>
	<addressOffset>0x000000e8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00021244</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>IBI_BUF_SIZE</name>
	<description>IBI Queue Size

This field reflects the configured IBI Queue size (in DWORDS) in Encoded Values.

Values:

- 0x0 : 2 DWORDS

- 0x1 : 4 DWORDS

- 0x2 : 8 DWORDS

- 0x3 : 16 DWORDS
</description>
	<bitRange>[19:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RESP_BUF_SIZE</name>
	<description>Response Queue Size

This field reflects the configured Response Queue size (in DWORDS) in Encoded Values.

Values:

- 0x0 : 2 DWORDS

- 0x1 : 4 DWORDS

- 0x2 : 8 DWORDS

- 0x3 : 16 DWORDS</description>
	<bitRange>[15:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_BUF_SIZE</name>
	<description>Command Queue Size

This field reflects the configured Command Queue size (in DWORDS) in Encoded Values.

Values:

- 0x0 : 2 DWORDS

- 0x1 : 4 DWORDS

- 0x2 : 8 DWORDS

- 0x3 : 16 DWORDS
</description>
	<bitRange>[11:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RX_BUF_SIZE</name>
	<description>Receive Data Buffer Size

This field reflects the configured Receive Buffer size (in DWORDS) in Encoded Values.

Values:

- 0x0 : 2 DWORDS

- 0x1 : 4 DWORDS

- 0x2 : 8 DWORDS

- 0x3 : 16 DWORDS

- 0x4 : 32 DWORDS

- 0x5 : 64 DWORDS</description>
	<bitRange>[7:4]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>TX_BUF_SIZE</name>
	<description>Transmit Data Buffer Size

This field reflects the configured Transmit Buffer size (in DWORDS) in Encoded Values.

Values:

- 0x0 : 2 DWORDS

- 0x1 : 4 DWORDS

- 0x2 : 8 DWORDS

- 0x3 : 16 DWORDS

- 0x4 : 32 DWORDS

- 0x5 : 64 DWORDS
</description>
	<bitRange>[3:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_QUEUE_STATUS_LEVEL_REG</name>
	<description>Queue Status Level Register </description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000008</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>IBI_STS_CNT</name>
	<description>IBI Buffer Status Count.

Contains the number of IBI status entries in the IBI Buffer.

This field is used in master mode of operation.</description>
	<bitRange>[28:24]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>IBI_BUF_BLR</name>
	<description>IBI Buffer Level Value.

Contains the number of valid entries in the IBI Buffer.

This field is used in master mode of operation.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>RESP_BUF_BLR</name>
	<description>Response Buffer Level Value.

Contains the number of valid data entries in the response Buffer.</description>
	<bitRange>[15:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>CMD_QUEUE_EMPTY_LOC</name>
	<description>Command Queue Empty Locations.

Contains the number of empty locations in the command Buffer.</description>
	<bitRange>[7:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_QUEUE_THLD_CTRL_REG</name>
	<description>Queue Threshold Control Register</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x01000101</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>IBI_STATUS_THLD</name>
	<description>In-Band Interrupt Status Threshold Value.

Every In Band Interrupt received (with or without data) by I3C controller generates an IBI status. This field controls the number of IBI status entries (or greater) in the IBI queue that trigger the IBI_THLD_STAT interrupt.

The valid range is 0 to 7. The software shall program only valid values. A value of 0 sets the threshold for 1 entry, and a value of N sets the threshold for N+1 entries.</description>
	<bitRange>[31:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RESP_BUF_THLD</name>
	<description>Response Buffer Threshold Value.

Controls the number of entries (or greater) in the Response Queue that trigger the RESP_READY_STAT_INTR interrupt.

