honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
The SCL open-drain low count timing for I2C fast mode transfers.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SCL_I2C_FM_TIMING_REG</name>
	<description>SCL I2C Fast Mode Timing Register </description>
	<addressOffset>0x000000bc</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00100010</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>I2C_FM_HCNT</name>
	<description>I2C Fast Mode High Count

The SCL open-drain high count timing for I2C fast mode transfers.</description>
	<bitRange>[31:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I2C_FM_LCNT</name>
	<description>I2C Fast Mode Low Count

The SCL open-drain low count timing for I2C fast mode transfers.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SCL_I3C_OD_TIMING_REG</name>
	<description>SCL I3C Open Drain Timing Register </description>
	<addressOffset>0x000000b4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000a0010</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>I3C_OD_HCNT</name>
	<description>I3C Open Drain High Count.

SCL open-drain High count (I3C) for I3C transfers targeted to I3C devices.</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I3C_OD_LCNT</name>
	<description>I3C Open Drain Low Count.

SCL Open-drain low count for I3C transfers targeted to I3C devices.
</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SCL_I3C_PP_TIMING_REG</name>
	<description>SCL I3C Push Pull Timing Register</description>
	<addressOffset>0x000000b8</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000a000a</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>I3C_PP_HCNT</name>
	<description>I3C Push Pull High Count.

SCL push-pull High count for I3C transfers targeted to I3C devices.
</description>
	<bitRange>[23:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>I3C_PP_LCNT</name>
	<description>I3C Push Pull Low Count.

SCL Push-pull low count for I3C transfers targeted to I3C devices.
</description>
	<bitRange>[7:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SDA_HOLD_DLY_TIMING_REG</name>
	<description> SDA Hold Delay Timing Register</description>
	<addressOffset>0x000000d0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00010000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>SDA_TX_HOLD</name>
	<description>This field controls the hold time (in term of the core clock period) of the transmit data (SDA) with respect to the SCL edge in FM FM+ SDR and DDR speed mode of operations. This field is not applicable for the ternary speed modes. The valid values are 1 to 7. Others are Reserved.</description>
	<bitRange>[18:16]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>I3C_SLV_EVENT_STATUS_REG</name>
	<description>Slave Event Status Register</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>MWL_UPDATED</name>
	<description>MWL Updated Status.

This bit indicates a SETMWL CCC is received by the slave. The updated MWL value can be read from SLV_MAX_LEN register. This status can be cleared by writing 1'b1 to this field after reading the updated MWL.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>MRL_UPDATED</name>
	<description>MRL Updated Status.

This bit indicates a SETMRL CCC is received by the slave. The updated MRL value can be read from SLV_MAX_LEN register. This status can be cleared by writing 1'b1 to this field after reading the updated MRL.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ACTIVITY_STATE</name>
	<description>Activity State Status.

ENTAS0 - 00

ENTAS1 - 01

ENTAS2 - 10

ENTAS3 - 11

This bit reflects the Activity State of slave set by the Master.</description>
	<bitRange>[5:4]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_VENDOR_SPECIFIC_REG_PTR_REG</name>
	<description>Pointer for Vendor specific Registers </description>
	<addressOffset>0x0000006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000b0</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>P_VENDOR_REG_START_ADDR</name>
	<description>Start Address of Vendor specific registers.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_VER_ID_REG</name>
	<description>I3C Version ID Register </description>
	<addressOffset>0x000000e0</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x3130302a</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>I3C_VER_ID</name>
	<description>Current release type

This field indicates the mipi_i3c current release type that is read by an application.

For example, release type &quot;ga&quot; is represented in ASCII as 0x6761 and &quot;ea&quot; is represented as 0x6561. Lower 16 bits read from this register can be ignored by the application if release type is &quot;ga&quot;. If release type is &quot;ea&quot; the lower 16 bits represents the &quot;ea&quot; release version.

An application reading this register along with the I3C_VER_ID register, gathers details of the current release.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>I3C_VER_TYPE_REG</name>
	<description>I3C Version Type Register</description>
	<addressOffset>0x000000e4</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x6c633033</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>I3C_VER_TYPE</name>
	<description>Current release type

This field indicates the i3c current release type that is read by an application.

