honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
	<resetMask>0x000fffff</resetMask>
	<fields><field>
	<name>CMI_DATA_BASE_ADDR</name>
	<description>Base address for CMAC data with steps of 4 bytes.
0x00001: 4 byte base address
0x00010: 64 byte base address
0x00100: 1 kB base address
0x01000: 16 kB base address
0x10000: 256 kB base address
Note: Uses the CMAC Physical address space provided by System Memory Controller.
That is, 0x0 is base for RAM10, 0x30000 is base for RAM9, 0x80000 is base for RAM11.

This register should only be updated when CMAC is running on DIVN clock or is not running at all.</description>
	<bitRange>[19:2]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CMI_END_REG</name>
	<description>CMAC end Address Register</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000fffff</resetValue>
	<resetMask>0x000fffff</resetMask>
	<fields><field>
	<name>CMI_END_ADDR</name>
	<description>End address for CMAC code and data accesses with steps of 1 kB.
0x000: accesses up to 1kB are allowed
0x001: accesses up to 2kB are allowed
0x01F: accesses up to 32kB are allowed
0x1FF: accesses up to 512kB are allowed
Note: Uses the CMAC Physical address space provided by System Memory Controller.
That is, 0x0 is base for RAM10, 0x30000 is base for RAM9, 0x80000 is base for RAM11.

This register should only be updated when CMAC is running on DIVN clock or is not running at all.</description>
	<bitRange>[19:10]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>CMI_SHARED_BASE_REG</name>
	<description>CMAC shared data Base Address Register</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000fffff</resetMask>
	<fields><field>
	<name>CMI_SHARED_BASE_ADDR</name>
	<description>Base address for CMAC shared data with steps of 1 kB. 0x001: 1 kB base address
0x010: 16 kB base address
0x100: 256 kB base address
Note: CMAC address scheme is used and should only be used to point to RAM 9 or 10.
Note: Uses the CMAC Physical address space provided by System Memory Controller.
That is, 0x0 is base for RAM10, 0x30000 is base for RAM9.

This register should only be updated when CMAC is running on DIVN clock or is not running at all.</description>
	<bitRange>[19:10]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MEM_PRIO_ARB1_4_REG</name>
	<description>Priority Control Register for arbiter 1, 2, 3 and 4</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>ARB4_AHB_DMA_PRIO</name>
	<description>Priority for the DMA AHB interface of arbiter 4
00: low priority (default)
01: mid priority
1x: high priority</description>
	<bitRange>[29:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB4_AHB_CPUS_PRIO</name>
	<description>Priority for the CPUS AHB interface of arbiter 4.
00: low priority (default)
01: mid priority
10: high priority
11: top priority</description>
	<bitRange>[27:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB3_AHB_DMA_PRIO</name>
	<description>Priority for the DMA AHB interface of arbiter 3
00: low priority (default)
01: mid priority
1x: high priority</description>
	<bitRange>[21:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB3_AHB_CPUS_PRIO</name>
	<description>Priority for the CPUS AHB interface of arbiter 3.
00: low priority (default)
01: mid priority
10: high priority
11: top priority</description>
	<bitRange>[19:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB3_AHB_CPUC_PRIO</name>
	<description>Priority for the CPUC AHB interface of arbiter 3.
00: low priority (default)
01: mid priority
10: high priority
11: top priority</description>
	<bitRange>[17:16]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB2_SNC_PRIO</name>
	<description>Priority for the SNC interface of arbiter 2.
00: low priority (default)
01: mid priority
10: high priority
11: top priority</description>
	<bitRange>[15:14]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB2_AHB_DMA_PRIO</name>
	<description>Priority for the DMA AHB interface of arbiter 2.
00: low priority (default)
01: mid priority
1x: high priority</description>
	<bitRange>[13:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB2_AHB_CPUS_PRIO</name>
	<description>Priority for the CPUS AHB interface of arbiter 2.
00: low priority (default)
01: mid priority
10: high priority
11: top priority</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB2_AHB_CPUC_PRIO</name>
	<description>Priority for the CPUC AHB interface of arbiter 2.
00: low priority (default)
01: mid priority
10: high priority
11: top priority</description>
	<bitRange>[9:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB1_SNC_PRIO</name>
	<description>Priority for the SNC interface of arbiter 1.
00: low priority (default)
01: mid priority
10: high priority
11: top priority</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB1_AHB_DMA_PRIO</name>
	<description>Priority for the DMA AHB interface of arbiter 1.
00: low priority (default)
01: mid priority
1x: high priority</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB1_AHB_CPUS_PRIO</name>
	<description>Priority for the CPUS AHB interface of arbiter 1.
00: low priority (default)
01: mid priority
10: high priority
11: top priority</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB1_AHB_CPUC_PRIO</name>
	<description>Priority for the CPUC AHB interface of arbiter 1.
00: low priority (default)
01: mid priority
10: high priority
11: top priority</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MEM_PRIO_ARB5_8_REG</name>
	<description>Priority Control Register for arbiter 5, 6, 7 and 8</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>ARB8_SNC_PRIO</name>
	<description>Priority for the SNC interface of arbiter 8.
00: low priority (default)
01: mid priority
10: high priority
11: top priority</description>
	<bitRange>[31:30]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB8_AHB_DMA_PRIO</name>
	<description>Priority for the DMA AHB interface of arbiter 8.
00: low priority (default)
01: mid priority
1x: high priority</description>
	<bitRange>[29:28]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB8_AHB_CPUS_PRIO</name>
	<description>Priority for the CPUS AHB interface of arbiter 8.
00: low priority (default)
01: mid priority
10: high priority
11: top priority</description>
	<bitRange>[27:26]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB7_AHB_DMA_PRIO</name>
	<description>Priority for the DMA AHB interface of arbiter 7.
00: low priority (default)
01: mid priority
1x: high priority</description>
	<bitRange>[21:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB7_AHB_CPUS_PRIO</name>
	<description>Priority for the CPUS AHB interface of arbiter 7.
00: low priority (default)
01: mid priority
10: high priority
11: top priority</description>
	<bitRange>[19:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB6_AHB_DMA_PRIO</name>
	<description>Priority for the DMA AHB interface of arbiter 6.
00: low priority (default)
01: mid priority
1x: high priority</description>
	<bitRange>[13:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB6_AHB_CPUS_PRIO</name>
	<description>Priority for the CPUS AHB interface of arbiter 6.
00: low priority (default)
01: mid priority
10: high priority
11: top priority</description>
	<bitRange>[11:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB5_AHB_DMA_PRIO</name>
	<description>Priority for the DMA AHB interface of arbiter 5.
00: low priority (default)
01: mid priority
1x: high priority</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>ARB5_AHB_CPUS_PRIO</name>
	<description>Priority for the CPUS AHB interface of arbiter 5.
00: low priority (default)
01: mid priority
10: high priority
11: top priority</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MEM_STALL_REG</name>
	<description>Maximum Stall cycles Control Register</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000ffff</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>SNC_MAX_STALL</name>
	<description>Maximum allowed number of stall cycles for the SNC interface. If exceeded, the interface will get high priority. Valid for a single access so the next access (of a burst) might end up in the que for the same number of wait cycles.
0: don't use, not feasible and can block other interfaces
1: max 1 stall cycle
15: max 15 stall cycles</description>
	<bitRange>[15:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AHB_DMA_MAX_STALL</name>
	<description>Maximum allowed number of stall cycles for the DMA AHB interface. If exceeded, the interface will get high priority. Valid for a single access so the next access (of a burst) might end up in the que for the same number of wait cycles.
0: don't use, not feasible and can block other interfaces
1: max 1 stall cycle
15: max 15 stall cycles</description>
	<bitRange>[11:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AHB_CPUS_MAX_STALL</name>
	<description>Maximum allowed number of stall cycles for the CPUS AHB interface. If exceeded, the interface will get high priority. Valid for a single access so the next access (of a burst) might end up in the que for the same number of wait cycles.
0: don't use, not feasible and can block other interfaces
1: max 1 stall cycle
15: max 15 stall cycles</description>
	<bitRange>[7:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AHB_CPUC_MAX_STALL</name>
	<description>Maximum allowed number of stall cycles for the CPUC AHB interface. If exceeded, the interface will get high priority. Valid for a single access so the next access (of a burst) might end up in the que for the same number of wait cycles.
0: don't use, not feasible and can block other interfaces
1: max 1 stall cycle
15: max 15 stall cycles</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MEM_STATUS2_REG</name>
	<description>RAM cells Status Register</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields><field>
	<name>RAM13_OFF_BUT_ACCESS</name>
	<description>Reading a '1' indicates RAM13 was off but still access was performed.
Writing a '1' will clear the status back to '0'.</description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM12_OFF_BUT_ACCESS</name>
	<description>Reading a '1' indicates RAM12 was off but still access was performed.
Writing a '1' will clear the status back to '0'.</description>
	<bitRange>[12:12]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM11_OFF_BUT_ACCESS</name>
	<description>Reading a '1' indicates RAM11 was off but still access was performed.
Writing a '1' will clear the status back to '0'.</description>
	<bitRange>[11:11]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM10_OFF_BUT_ACCESS</name>
	<description>Reading a '1' indicates RAM10 was off but still access was performed.
Writing a '1' will clear the status back to '0'.</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM9_OFF_BUT_ACCESS</name>
	<description>Reading a '1' indicates RAM9 was off but still access was performed.
Writing a '1' will clear the status back to '0'.</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM8_OFF_BUT_ACCESS</name>
	<description>Reading a '1' indicates RAM8 was off but still access was performed.
Writing a '1' will clear the status back to '0'.</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM7_OFF_BUT_ACCESS</name>
	<description>Reading a '1' indicates RAM7 was off but still access was performed.
Writing a '1' will clear the status back to '0'.</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM6_OFF_BUT_ACCESS</name>
	<description>Reading a '1' indicates RAM6 was off but still access was performed.
Writing a '1' will clear the status back to '0'.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM5_OFF_BUT_ACCESS</name>
	<description>Reading a '1' indicates RAM5 was off but still access was performed.
Writing a '1' will clear the status back to '0'.</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM4_OFF_BUT_ACCESS</name>
	<description>Reading a '1' indicates RAM4 was off but still access was performed.
Writing a '1' will clear the status back to '0'.</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM3_OFF_BUT_ACCESS</name>
	<description>Reading a '1' indicates RAM3 was off but still access was performed.
Writing a '1' will clear the status back to '0'.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM2_OFF_BUT_ACCESS</name>
	<description>Reading a '1' indicates RAM2 was off but still access was performed.
Writing a '1' will clear the status back to '0'.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM1_OFF_BUT_ACCESS</name>
	<description>Reading a '1' indicates RAM1 was off but still access was performed.
Writing a '1' will clear the status back to '0'.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>RAM0_OFF_BUT_ACCESS</name>
	<description>Reading a '1' indicates RAM0 was off but still access was performed.
Writing a '1' will clear the status back to '0'.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>MEM_STATUS_REG</name>
	<description>Memory Arbiter Status Register</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00ffffff</resetMask>
	<fields><field>
	<name>AHB_SNC_WR_BUFF_CNT</name>
	<description>The maximum number of arbiter clock cycles that an SNC AHB access has been buffered.</description>
	<bitRange>[23:20]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AHB_DMA_WR_BUFF_CNT</name>
	<description>The maximum number of arbiter clock cycles that an DMA AHB access has been buffered.</description>
	<bitRange>[19:16]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AHB_CPUC_WR_BUFF_CNT</name>
	<description>The maximum number of arbiter clock cycles that an CPUC AHB access has been buffered.</description>
	<bitRange>[15:12]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AHB_CPUS_WR_BUFF_CNT</name>
	<description>The maximum number of arbiter clock cycles that an CPUS_AHB access has been buffered.</description>
	<bitRange>[11:8]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AHB_SNC_CLR_WR_BUFF</name>
	<description>Writing a '1' clears AHB_SNC_WR_BUFF_CNT.</description>
	<bitRange>[7:7]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>AHB_DMA_CLR_WR_BUFF</name>
	<description>Writing a '1' clears AHB_DMA_WR_BUFF_CNT.</description>
	<bitRange>[6:6]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>AHB_CPUC_CLR_WR_BUFF</name>
	<description>Writing a '1' clears AHB_CPUC_WR_BUFF_CNT.</description>
	<bitRange>[5:5]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>AHB_CPUS_CLR_WR_BUFF</name>
	<description>Writing a '1' clears AHB_CPUS_WR_BUFF_CNT.</description>
	<bitRange>[4:4]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>AHB_SNC_WRITE_BUFF</name>
	<description>0: No SNC AHB write access is buffered.
1: Currently a single SNC AHB write access is buffered in the arbiter.</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AHB_DMA_WRITE_BUFF</name>
	<description>0: No DMA AHB write access is buffered.
1: Currently a single DMA AHB write access is buffered in the arbiter.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AHB_CPUC_WRITE_BUFF</name>
	<description>0: No CPUC AHB write access is buffered.
1: Currently a single CPUC AHB write access is buffered in the arbiter.</description>
	<bitRange>[1:1]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>AHB_CPUS_WRITE_BUFF</name>
	<description>0: No CPUS AHB write access is buffered.
1: Currently a single CPUS AHB write access is buffered in the arbiter.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>OQSPIF</name>
	<version>1.0</version>
	<description>OQSPIF registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x36000000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>308</size>
	<usage>registers</usage>
</addressBlock>
	
