honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
	<registers>
	<register>
	<name>WATCHDOG_CTRL_REG</name>
	<description>Watchdog control register.</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000006</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WRITE_BUSY</name>
	<description>0 = A new WATCHDOG_REG[WDOG_VAL] can be written.
1 = No new WATCHDOG_REG[WDOG_VAL] can be written.
Note: It takes some time before the programmed WDOG_VAL is updated in the (independent) Watchdog timer. During this time it is not possible to write a new value to WATCHDOG_REG[WDOG_VAL].</description>
	<bitRange>[3:3]</bitRange>
	<access>read-only</access>
	</field><field>
	<name>WDOG_FREEZE_EN</name>
	<description>0 = Watchdog timer can not be frozen when NMI_RST=0.
1 = Watchdog timer can be frozen/resumed using
SET_FREEZE_REG[FRZ_WDOG]/
RESET_FREEZE_REG[FRZ_WDOG] when NMI_RST=0.
Note: Although this bit is retained during sleep, the SET_FREEZE_REG[FRZ_SYS_WDOG] is not, so the watchdog cannot be frozen during CM33 sleep.</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>NMI_RST</name>
	<description>0 = Watchdog timer generates NMI at value 0, and WDOG (SYS) reset at &lt;= -16. Timer can be frozen/resumed using
SET_FREEZE_REG[FRZ_WDOG]/
RESET_FREEZE_REG[FRZ_WDOG].
1 = Watchdog timer generates a WDOG (SYS) reset at value 0 and can not be frozen by Software.
Note that this bit can only be set to 1 by SW and only be reset with a WDOG (SYS) reset or SW reset.
The watchdog is always frozen when the Cortex-M33 is halted in DEBUG State. </description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WATCHDOG_REG</name>
	<description>Watchdog timer register.</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00001fff</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WDOG_WEN</name>
	<description>Bit [31:14] = 0 = Write enable for Watchdog timer
else Write disable. This filter prevents unintentional presetting the watchdog with a SW run-away. </description>
	<bitRange>[31:14]</bitRange>
	<access>write-only</access>
	</field><field>
	<name>WDOG_VAL_NEG</name>
	<description>0 = Watchdog timer value is positive.
1 = Watchdog timer value is negative. </description>
	<bitRange>[13:13]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WDOG_VAL</name>
	<description>Write: Watchdog timer reload value. Note that all bits [31-14] must be 0 to reload this register.
Read: Actual Watchdog timer value. Decremented by 1 every ~10 msec (RC32K) or ~29 msec (RCX), i.e. the Watchdog timer clock tick.
Bit 13 indicates a negative counter value. 2, 1, 0, 3FFF16, 3FFE16 etc. An NMI or WDOG (SYS) reset is generated under the following conditions:
If WATCHDOG_CTRL_REG[NMI_RST] = 0 then
  If WDOG_VAL = 0 -&gt; NMI (Non Maskable Interrupt)
  if WDOG_VAL =3FF016 -&gt; WDOG reset -&gt; reload 1FFF16
If WATCHDOG_CTRL_REG[NMI_RST] = 1 then
  if WDOG_VAL &lt;= 0 -&gt; WDOG reset -&gt; reload 1FFF16
Note 1: The programmed value WDOG_VAL is updated in the (independent) Watchdog timer at the 2nd next RC32K or RCX clock tick.
Note 2: Select RC32K or RCX with CLK_RCX_REG[RCX_ENABLE]. The RC32K is selected by default.
Note 3: If WATCHDOG_CTRL_REG[NMI_RST] = 0, the time between the NMI generation and the WDOG reset generation is 15 Watchdog timer clock ticks.</description>
	<bitRange>[12:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SYSBUS</name>
	<version>1.0</version>
	<description>SYSBUS registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x30020000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>148</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>AHB_DMA_CCLM1_REG</name>
	<description>LCD Master clock tokens</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_CCLM</name>
	<description>Number of tokens (counted in AHB clock cycles) that a master can use on the bus before it has to arbitrate on a bus master with low priority and having tokens. Masters with tokens remaining have priority over masters that have used all of their tokens. User should configure all the token values ensuring that the sum does not exceeds the total allocated number of tokens. If a value of zero is configured, then the bus is deemed to have infinite tokens and will always operate in the upper-tier of arbitration.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_CCLM2_REG</name>
	<description>GPU Master clock tokens</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_CCLM</name>
	<description>Refer to AHB_DMA_CCLM1_REG</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_CCLM3_REG</name>
	<description>GEN-DMA Master clock tokens</description>
	<addressOffset>0x0000005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_CCLM</name>
	<description>AHB_DMA_CCLM1_REG</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_CCLM4_REG</name>
	<description>CRYPTO-DMA Master clock tokens</description>
	<addressOffset>0x00000060</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_CCLM</name>
	<description>AHB_DMA_CCLM1_REG</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_CCLM5_REG</name>
	<description>MMC Master clock tokens</description>
	<addressOffset>0x00000064</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_CCLM</name>
	<description>AHB_DMA_CCLM1_REG</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_CCLM7_REG</name>
	<description>AHB-S Master clock tokens</description>
	<addressOffset>0x0000006c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_CCLM</name>
	<description>AHB_DMA_CCLM1_REG</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_DFLT_MASTER_REG</name>
	<description>Default master ID number (AHB DMA layer only)</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_DFLT_MASTER</name>
	<description>Default master ID number register. The default master is the master that is granted by the bus when no master has requested ownership.
0: Dummy master
1: LCD
2: GPU
3: GEN-DMA
4: CRYPTO-DMA
5: MMC
6: reserved</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_PL1_REG</name>
	<description>AHB-DMA layer priority level LCD</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000f</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_PL1</name>
	<description>Arbitration priority for master LCD.
0 : disables the master
1 : lowest ... 15: highest</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_PL2_REG</name>
	<description>AHB-DMA layer priority level GPU</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000e</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_PL2</name>
	<description>Arbitration priority for master GPU.
0 : disables the master
1 : lowest ... 15: highest</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_PL3_REG</name>
	<description>AHB-DMA layer Priority level GEN-DMA</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000d</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_PL3</name>
	<description>Arbitration priority for master GEN-DMA.
0 : disables the master
1 : lowest ... 15: highest</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_PL4_REG</name>
	<description>AHB-DMA layer Priority level CRYPTO-DMA</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000c</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_PL4</name>
	<description>Arbitration priority for master CRYPTO-DMA.
0 : disables the master
1 : lowest ... 15: highest</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_PL5_REG</name>
	<description>AHB-DMA layer Priority level MMC</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000000b</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_PL5</name>
	<description>Arbitration priority for master MMC.
0 : disables the master
1 : lowest ...15: highest</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_PL7_REG</name>
	<description>AHB-DMA layer Priority level AHB-S to AHB_DMA arbiter registers</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000009</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_PL7</name>
	<description>Arbitration priority for master AHB-S. 1: lowest, 15: highest.</description>
	<bitRange>[3:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_TCL_REG</name>
	<description>Master clock refresh period (AHB DMA layer only)</description>
	<addressOffset>0x00000050</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x0000ffff</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_TCL</name>
	<description>Master clock refresh period, counting clock cycles. An arbitration period is defined over this number of tokens. When a new arbitration period starts, the master counters are reloaded. Recommended value is the sum of the AHB_DMA_CCLMx_REG valuesplus 2 tokens for each master.</description>
	<bitRange>[15:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_VERSION_REG</name>
	<description>Version ID (AHB DMA layer only)</description>
	<addressOffset>0x00000090</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x3231342a</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_VERSION</name>
	
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>AHB_DMA_WTEN_REG</name>
	<description>Weighted-Token Arbitration Scheme Enable (AHB DMA layer only)</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>AHB_DMA_WTEN</name>
	<description>Weighted-token arbitration scheme enable.</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>SYSBUS_ICM</name>
	<version>1.0</version>
	<description>SYSBUS_ICM registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50040600</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>20</size>
	<usage>registers</usage>
</addressBlock>
	
