honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
	<registers>
	<register>
	<name>AHBREG_ARB_REG</name>
	
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000002</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>AHBREG_AHB_AHBS_PRIO</name>
	<description>priority AHB AHBS layer system bus
0x0 : Highest priority
0x1 : Second prority</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>AHBREG_AHB_DMA_PRIO</name>
	<description>priority AHB DMA layer system bus
0x0 : Highest priority
0x1 : Second prority</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>APBF_ARB_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000024</resetValue>
	<resetMask>0x0000003f</resetMask>
	<fields><field>
	<name>APBF_AHB_DMA_PRIO</name>
	<description>priority AHB DMA layer system bus
0x0 : Highest priority
0x1 : Second prority
0x2 : Third priority
0x3 : Fourth priority</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>APBF_SNC_PRIO</name>
	<description>priority SNC interface
0x0 : Highest priority
0x1 : Second prority
0x2 : Third priority
0x3 : Fourth priority</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>APBF_AHB_AHBS_PRIO</name>
	<description>priority AHB CPUS layer system bus
0x0 : Highest priority
0x1 : Second prority
0x2 : Third priority
0x3 : Fourth priority</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>APB_ARB_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000e4</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields><field>
	<name>APB_AHB_CPUS_PRIO</name>
	<description>priority AHB_CPUS layer system bus
0x0 : Highest priority
0x1 : Second prority
0x2 : Third priority
0x3 : Fourth priority</description>
	<bitRange>[7:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>APB_AHB_DMA_PRIO</name>
	<description>priority AHB_DMA layer system bus
0x0 : Highest priority
0x1 : Second prority
0x2 : Third priority
0x3 : Fourth priority</description>
	<bitRange>[5:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>APB_SNC_PRIO</name>
	<description>priority SNC interface
0x0 : Highest priority
0x1 : Second prority
0x2 : Third priority
0x3 : Fourth priority</description>
	<bitRange>[3:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>APB_CMAC_PRIO</name>
	<description>priority CMAC interface
0x0 : Highest priority
0x1 : Second prority
0x2 : Third priority
0x3 : Fourth priority</description>
	<bitRange>[1:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>QSPIFL2_ARB_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000002</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>QSPIFL2_AHB_CPUS_PRIO</name>
	<description>priority AHB_CPUS layer system bus
0x0 : Highest priority
0x1 : Second prority</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QSPIFL2_AHB_DMA_PRIO</name>
	<description>priority AHB_DMA layer system bus
0x0 : Highest priority
0x1 : Second prority</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>QSPIRAM_ARB_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000002</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields><field>
	<name>QSPIRAM_AHB_AHBS_PRIO</name>
	<description>priority AHB AHBS layer system bus
0x0 : Highest priority
0x1 : Second prority</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>QSPIRAM_AHB_DMA_PRIO</name>
	<description>priority AHB DMA layer system bus
0x0 : Highest priority
0x1 : Second prority</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>TIMER</name>
	<version>1.0</version>
	<description>TIMER registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50010000</baseAddress>
	<size>0</size>
	<addressBlock>
	<offset>0</offset>
	<size>92</size>
	<usage>registers</usage>
</addressBlock>
	
	<registers>
	<register>
	<name>TIMER_CAPTURE_GPIO1_REG</name>
	<description>Timer value for event on GPIO1</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_CAPTURE_GPIO1</name>
	<description>Gives the Capture time for event on GPIO1</description>
	<bitRange>[23:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>TIMER_CAPTURE_GPIO2_REG</name>
	<description>Timer value for event on GPIO2</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_CAPTURE_GPIO2</name>
	<description>Gives the Capture time for event on GPIO2</description>
	<bitRange>[23:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>TIMER_CAPTURE_GPIO3_REG</name>
	<description>Timer value for event on GPIO1</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_CAPTURE_GPIO3</name>
	<description>Gives the Capture time for event on GPIO3</description>
	<bitRange>[23:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>TIMER_CAPTURE_GPIO4_REG</name>
	<description>Timer value for event on GPIO1</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_CAPTURE_GPIO4</name>
	<description>Gives the Capture time for event on GPIO4</description>
	<bitRange>[23:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>TIMER_CLEAR_IRQ_PULSE_REG</name>
	<description>Timer clear pulse interrupt</description>
	<addressOffset>0x00000058</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TIM_CLEAR_PULSE_IRQ</name>
	<description>Write any value will clear irq pulse interrupt</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>TIMER_CLEAR_IRQ_REG</name>
	<description>Timer clear interrupt</description>
	<addressOffset>0x00000054</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TIM_CLEAR_IRQ</name>
	<description>Write any value clear interrupt</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>TIMER_CTRL_REG</name>
	<description>Timer control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_SINGLE_EVENT_CAPTURE</name>
	<description>When this bit is set, only the first event on captimer1 is captured</description>
	<bitRange>[20:20]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_EDGE_DET_CNT_FALL_EN</name>
	<description>Select on which edge the edge detection should react;
0: the counter is triggered on a rising edge
1: the counter is triggered on a falling edge

NOTE: Only change this when EDGE_DET_CNT_EN=0 in TIMER_CTRL_REG</description>
	<bitRange>[19:19]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_EDGE_DET_CNT_EN</name>
	<description>Enable edge detection counter.
NOTE: In sleep only 80Mhz can be reached at 900 mV</description>
	<bitRange>[18:18]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_ONESHOT_SWITCH</name>
	<description>Automatically switch after the completion of the pulse output without the CPU programming anything.
0: No automated switch from OneShot to Counter mode
1: Automated switch from OneShot to Counter mode and start counting down. In case no start value has been programmed (reload=0), the timer keeps generating interrupts until the timer clock is disabled</description>
	<bitRange>[17:17]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_ONESHOT_TRIGGER</name>
	<description>Oneshot trigger source
00: Select external GPIO as the trigger for one shot
01: Select a register write as the trigger of one shot
10: Either of the two triggers one shot
11: None of the two triggers one shot
</description>
	<bitRange>[16:15]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_IN4_EVENT_FALL_EN</name>
	<description>Event input 4 edge type
1 = falling edge
0 = rising edge</description>
	<bitRange>[10:10]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_IN3_EVENT_FALL_EN</name>
	<description>Event input 3 edge type
1 = falling edge
0 = rising edge</description>
	<bitRange>[9:9]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_CLK_EN</name>
	<description>Timer clock enable
1 = clock enabled
0 = clock disabled</description>
	<bitRange>[8:8]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_SYS_CLK_EN</name>
	<description>Select clock
1 = Timer uses the DIVN clock
0 = Timer uses the lp clock


NOTE: when switching clock, the timer clock should be disabled (TIM_CLK_EN, bit 8)</description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_FREE_RUN_MODE_EN</name>
	<description>Valid when timer counts up, if it is '1' timer does not zero when reaches to reload value. it becomes zero only when it reaches the max value.</description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_IRQ_EN</name>
	<description>Interrupt mask
1 = timer IRQ is unmasked
0 = timer IRQ is masked</description>
	<bitRange>[5:5]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_IN2_EVENT_FALL_EN</name>
	<description>Event input 2 edge type
1 = falling edge
0 = rising edge</description>
	<bitRange>[4:4]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_IN1_EVENT_FALL_EN</name>
	<description>Event input 1 edge type
1 = falling edge
0 = rising edge</description>
	<bitRange>[3:3]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_COUNT_DOWN_EN</name>
	<description>Timer count direction
1 = down
0 = up
NOTE: only change counter direction when timer is not enabled</description>
	<bitRange>[2:2]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_ONESHOT_MODE_EN</name>
	<description>Timer mode
1 = One shot enabled
0 = Counter enabled</description>
	<bitRange>[1:1]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>TIM_EN</name>
	<description>Timer enable
1 = On
0 = Off</description>
	<bitRange>[0:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER_GPIO1_CONF_REG</name>
	<description>Timer gpio1 selection</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_GPIO1_CONF</name>
	<description>Select one of the 32 GPIOs as IN1, Valid values 0-32.
0: Disable input
1: P0_00
2: P0_01
3: P0_02
4: P0_03
5: P0_04
6: P0_05
7: P0_06
8: P0_07
9: P0_08
10: P0_09
11: P0_10
12: P0_11
13: P0_12
14: P0_13
15: P1_00
16: P1_01
17: P1_02
18: P1_03
19: P1_04
20: P1_05
21: P1_06
22: P1_07
23: P1_08
24: P1_09
25: P1_10
26: P1_11
27: P1_12
28: P1_13
29: P1_14
30: P1_15
31: P1_16
32: P1_17</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER_GPIO2_CONF_REG</name>
	<description>Timer gpio2 selection</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_GPIO2_CONF</name>
	<description>Select one of the 32 GPIOs as IN2, Valid values 0-32.
0: Disable input
1: P0_00
2: P0_01
3: P0_02
4: P0_03
5: P0_04
6: P0_05
7: P0_06
8: P0_07
9: P0_08
10: P0_09
11: P0_10
12: P0_11
13: P0_12
14: P0_13
15: P1_00
16: P1_01
17: P1_02
18: P1_03
19: P1_04
20: P1_05
21: P1_06
22: P1_07
23: P1_08
24: P1_09
25: P1_10
26: P1_11
27: P1_12
28: P1_13
29: P1_14
30: P1_15
31: P1_16
32: P1_17</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER_GPIO3_CONF_REG</name>
	<description>Timer gpio3 selection</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_GPIO3_CONF</name>
	<description>Select one of the 32 GPIOs as IN3, Valid value 0-32. 1 for the first gpio, 32 for the last gpio.
0: Disable input
1: P0_00
2: P0_01
3: P0_02
4: P0_03
5: P0_04
6: P0_05
7: P0_06
8: P0_07
9: P0_08
10: P0_09
11: P0_10
12: P0_11
13: P0_12
14: P0_13
15: P1_00
16: P1_01
17: P1_02
18: P1_03
19: P1_04
20: P1_05
21: P1_06
22: P1_07
23: P1_08
24: P1_09
25: P1_10
26: P1_11
27: P1_12
28: P1_13
29: P1_14
30: P1_15
31: P1_16
32: P1_17</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER_GPIO4_CONF_REG</name>
	<description>Timer gpio4 selection</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_GPIO4_CONF</name>
	<description>Select one of the 32 GPIOs as IN4, Valid values 0-32.
0: Disable input
1: P0_00
2: P0_01
3: P0_02
4: P0_03
5: P0_04
6: P0_05
7: P0_06
8: P0_07
9: P0_08
10: P0_09
11: P0_10
12: P0_11
13: P0_12
14: P0_13
15: P1_00
16: P1_01
17: P1_02
18: P1_03
19: P1_04
20: P1_05
21: P1_06
22: P1_07
23: P1_08
24: P1_09
25: P1_10
26: P1_11
27: P1_12
28: P1_13
29: P1_14
30: P1_15
31: P1_16
32: P1_17</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>TIMER_ONESHOT_TRIGGER_REG</name>
	<description>Timer oneshot trigger register</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields><field>
	<name>TIM_ONESHOT_TRIGGER_SW</name>
	<description>trigger oneshot</description>
	<bitRange>[0:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>TIMER_PRESCALER_VAL_REG</name>
	<description>Timer prescaler counter valuew</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>TIM_PRESCALER_VAL</name>
	<description>Gives the current prescaler counter value</description>
	<bitRange>[4:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>TIMER_PULSE_CNT_CTRL_REG</name>
	<description>Timer pulse counter ctrl register</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x3fffffff</resetMask>
	<fields><field>
	<name>PULSE_CNT_GPIO_SEL</name>
	<description>Select one of the 32 GPIOs as input for the pulse counter, Valid values 0-32.
0: Disable input
1: P0_00
2: P0_01
3: P0_02
4: P0_03
5: P0_04
6: P0_05
7: P0_06
8: P0_07
9: P0_08
10: P0_09
11: P0_10
12: P0_11
13: P0_12
14: P0_13
15: P1_00
16: P1_01
17: P1_02
18: P1_03
19: P1_04
20: P1_05
21: P1_06
22: P1_07
23: P1_08
24: P1_09
25: P1_10
26: P1_11
27: P1_12
28: P1_13
29: P1_14
30: P1_15
31: P1_16
32: P1_17

NOTE: Only change this when EDGE_DET_CNT_EN=0 in TIMER_CTRL_REG</description>
	<bitRange>[29:24]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>PULSE_CNT_THRESHOLD</name>
	<description>Select after how many pulses an irq is fired for the pulse counter n-2.

