honnet/ATC_SR08_Ring/Firmware_src/projects/target_apps/ble_examples/prox_reporter/Eclipse/tool/common_resources/SupportPackages/DA1470x/toolbox_resources/common/DA1470x.xml
	<registers>
	<register>
	<name>WKUP_CLEAR_P0_REG</name>
	<description>Clear event register for P0</description>
	<addressOffset>0x0000002c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WKUP_CLEAR_P0</name>
	<description>Clear latched value of the GPIOs P0 when corresponding bit is 1</description>
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>WKUP_CLEAR_P1_REG</name>
	<description>Clear event register for P1</description>
	<addressOffset>0x00000030</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WKUP_CLEAR_P1</name>
	<description>Clear latched value of the GPIOs P1 when corresponding bit is 1</description>
	<bitRange>[31:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>WKUP_CLEAR_P2_REG</name>
	<description>Clear event register for P2</description>
	<addressOffset>0x00000034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>WKUP_CLEAR_P2</name>
	<description>Clear latched value of the GPIOs P2 when corresponding bit is 1</description>
	<bitRange>[14:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>WKUP_CTRL_REG</name>
	<description>Control register for the wakeup counter</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>WKUP_ENABLE_IRQ</name>
	<description>0: no interrupt will be enabled
1: if you have an event an IRQ will be generated </description>
	<bitRange>[7:7]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WKUP_SFT_KEYHIT</name>
	<description>0 = no effect
1 = emulate key hit. First make this bit 0 before any new key hit can be sensed. </description>
	<bitRange>[6:6]</bitRange>
	<access>read-write</access>
	</field><field>
	<name>WKUP_DEB_VALUE</name>
	<description>Wakeup debounce time. If set to 0, no debouncing will be done.
Debounce time: N*1 ms. N =1..63

Note: Depending on the time key is pressed, debounce time can be less than N*1 ms. To make sure that debounce time is bigger than the programmed time, program this register field to (&quot;desired value&quot;+1). So, if at least 2 ms of debounce time is required, program the register to 3.</description>
	<bitRange>[5:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_POL_P0_REG</name>
	<description>select the sesitivity polarity for each P0 input</description>
	<addressOffset>0x00000014</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WKUP_POL_P0</name>
	<description>0: enabled input P0_xx will give an event if that input goes high
1: enabled input P0_xx will give an event if that input goes low</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_POL_P1_REG</name>
	<description>select the sesitivity polarity for each P1 input</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WKUP_POL_P1</name>
	<description>0: enabled input P1_xx will give an event if that input goes high
1: enabled input P1_xx will give an event if that input goes low</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_POL_P2_REG</name>
	<description>select the sesitivity polarity for each P2 input</description>
	<addressOffset>0x0000001c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>WKUP_POL_P2</name>
	<description>0: enabled input P2_xx will give an event if that input goes high
1: enabled input P2_xx will give an event if that input goes low</description>
	<bitRange>[14:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_RESET_IRQ_REG</name>
	<description>Reset wakeup interrupt</description>
	<addressOffset>0x00000004</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields><field>
	<name>WKUP_IRQ_RST</name>
	<description>writing any value to this register will reset the interrupt. reading always returns 0. </description>
	<bitRange>[15:0]</bitRange>
	<access>write-only</access>
	</field></fields>
</register><register>
	<name>WKUP_SEL1_GPIO_P0_REG</name>
	<description>Configure to generate level or edge sensitive IRQ on P0 events</description>
	<addressOffset>0x00000044</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WKUP_SEL1_GPIO_P0</name>
	<description>0 (level sensitive):
If WKUP_SEL_GPIO_P0_REG[x] is 1, generate GPIO_P0_IRQ based on P0_x level.
Fast wakeup is not enabled if the corresponding WKUP_SEL_GPIO_P0_REG[x] is 0 too.
1 (edge sensitive):
If WKUP_SEL_GPIO_P0_REG[x] is 1, GPIO_P0_IRQ will be generated only on rising/falling (defined by WKUP_POL_P0_REG) edge on P0_x.
Fast wakeup from the corresponding P0_x input is enabled.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_SEL1_GPIO_P1_REG</name>
	<description>Configure to generate level or edge sensitive IRQ on P1 events</description>
	<addressOffset>0x00000048</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WKUP_SEL1_GPIO_P1</name>
	<description>0 (level sensitive):
If WKUP_SEL_GPIO_P1_REG[x] is 1, generate GPIO_P1_IRQ based on P1_x level.
Fast wakeup is not enabled if the corresponding WKUP_SEL_GPIO_P1_REG[x] is 0 too.
1 (edge sensitive):
If WKUP_SEL_GPIO_P1_REG[x] is 1, GPIO_P1_IRQ will be generated only on rising/falling (defined by WKUP_POL_P1_REG) edge on P1_x.
Fast wakeup from the corresponding P1_x input is enabled.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_SEL1_GPIO_P2_REG</name>
	<description>Configure to generate level or edge sensitive IRQ on P2 events</description>
	<addressOffset>0x0000004c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>WKUP_SEL1_GPIO_P2</name>
	<description>0 (level sensitive):
If WKUP_SEL_GPIO_P2_REG[x] is 1, generate GPIO_P2_IRQ based on P2_x level.
Fast wakeup is not enabled if the corresponding WKUP_SEL_GPIO_P2_REG[x] is 0 too.
1 (edge sensitive):
If WKUP_SEL_GPIO_P2_REG[x] is 1, GPIO_P2_IRQ will be generated only on rising/falling (defined by WKUP_POL_P2_REG) edge on P1_x.
Fast wakeup from the corresponding P2_x input is enabled.</description>
	<bitRange>[14:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_SELECT_P0_REG</name>
	<description>Select which inputs from P0 port can trigger wkup counter</description>
	<addressOffset>0x00000008</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WKUP_SELECT_P0</name>
	<description>0: input P0_xx is not enabled for wakeup event
1: input P0_xx is enabled for wakeup event</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_SELECT_P1_REG</name>
	<description>Select which inputs from P1 port can trigger wkup counter</description>
	<addressOffset>0x0000000c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WKUP_SELECT_P1</name>
	<description>0: input P1_xx is not enabled for wakeup event
1: input P1_xx is enabled for wakeup event </description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_SELECT_P2_REG</name>
	<description>Select which inputs from P2 port can trigger wkup counter</description>
	<addressOffset>0x00000010</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>WKUP_SELECT_P2</name>
	<description>0: input P2_xx is not enabled for wakeup event
1: input P2_xx is enabled for wakeup event </description>
	<bitRange>[14:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_SEL_GPIO_P0_REG</name>
	<description>Enable fast wakeup and enable GPIO_P0_IRQ</description>
	<addressOffset>0x00000038</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WKUP_SEL_GPIO_P0</name>
	<description>0:
No GPIO_P0_IRQ on input P0_x.
Fast wakeup is not enabled if the corresponding WKUP_SEL1_GPIO_P0_REG[x] is 0 too.
1:
GPIO_P0_IRQ will be generated on P0_x input event. If WKUP_SEL1_GPIO_P0_REG[x] is 0, IRQ generation is level sensitive. If WKUP_SEL1_GPIO_P0_REG[x] is 1, IRQ generation is edge sensitive (only if there is a change on P0_x input).
Fast wakeup from the corresponding P0_x input is enabled.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_SEL_GPIO_P1_REG</name>
	<description>Enable fast wakeup and enable GPIO_P1_IRQ</description>
	<addressOffset>0x0000003c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WKUP_SEL_GPIO_P1</name>
	<description>0:
No GPIO_P1_IRQ on input P1_x.
Fast wakeup is not enabled if the corresponding WKUP_SEL1_GPIO_P1_REG[x] is 0 too.
1:
GPIO_P1_IRQ will be generated on P1_x input event. If WKUP_SEL1_GPIO_P1_REG[x] is 0, IRQ generation is level sensitive. If WKUP_SEL1_GPIO_P1_REG[x] is 1, IRQ generation is edge sensitive (only if there is a change on P1_x input).
Fast wakeup from the corresponding P1_x input is enabled.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_SEL_GPIO_P2_REG</name>
	<description>Enable fast wakeup and enable GPIO_P2_IRQ</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>WKUP_SEL_GPIO_P2</name>
	<description>0:
No GPIO_P2_IRQ on input P2_x.
Fast wakeup is not enabled if the corresponding WKUP_SEL1_GPIO_P2_REG[x] is 0 too.
1:
GPIO_P2_IRQ will be generated on P1_x input event. If WKUP_SEL1_GPIO_P2_REG[x] is 0, IRQ generation is level sensitive. If WKUP_SEL1_GPIO_P2_REG[x] is 1, IRQ generation is edge sensitive (only if there is a change on P2_x input).
Fast wakeup from the corresponding P2_x input is enabled.</description>
	<bitRange>[14:0]</bitRange>
	<access>read-write</access>
	</field></fields>
</register><register>
	<name>WKUP_STATUS_P0_REG</name>
	<description>Event status register for P0</description>
	<addressOffset>0x00000020</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WKUP_STAT_P0</name>
	<description>Contains the latched value of any toggle of the GPIOs Port P0. WKUP_STAT_P0[0] -&gt; P0_00.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>WKUP_STATUS_P1_REG</name>
	<description>Event status register for P1</description>
	<addressOffset>0x00000024</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0xffffffff</resetMask>
	<fields><field>
	<name>WKUP_STAT_P1</name>
	<description>Contains the latched value of any toggle of the GPIOs Port P1. WKUP_STAT_P1[0] -&gt; P1_00.</description>
	<bitRange>[31:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register><register>
	<name>WKUP_STATUS_P2_REG</name>
	<description>Event status register for P2</description>
	<addressOffset>0x00000028</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields><field>
	<name>WKUP_STAT_P2</name>
	<description>Contains the latched value of any toggle of the GPIOs Port P2. WKUP_STAT_P2[0] -&gt; P2_00.</description>
	<bitRange>[14:0]</bitRange>
	<access>read-only</access>
	</field></fields>
</register></registers>
</peripheral></peripherals>
</device>
